{
  "passages": [
    {
      "text": "\n(set: $playerTags to (a:))\n(set: $inv to (a:\"waterskin\"))\n\n(set: $health to 5)\n(set: $filth to 1)\n(set: $timeindungeon to 1)\n\n\n\n(set: $clothing to (datamap:\n\"head\", \"\",\n\"torso\", \"dusty robe\",\n\"feet\", \"sandals\",\n\"hands\", \"\",\n\"neck\", \"\",\n))\n\n(set: $headDescription to \"Your face is drawn and reddened by the sun.\")\n(set: $torsoDescription to \"Your robe is tattered and bleached from months on the road.\")\n(set: $feetDescription to \"Ragged sandals adorn your feet.\")\n(set: $handsDescription to \"Your hands are empty.\")\n(set: $neckDescription to \"\")\n\n(set: $playerJourney to \"\")\n\n(set: $knowledge to (datamap:\n\"people\", (datamap:),\n\"places\", (datamap:),\n\"history\", (datamap:),\n))\n\n(goto:\"InitialiseConversation\")",
      "name": "Initialisation",
      "pid": "1",
      "position": {
        "x": "313",
        "y": "13"
      }
    },
    {
      "text": "<div class = \"Boxout\">\\\nhow I look\nhow I feel\nwhat I carry\nwhat I know\\\n\\\n(click: \"how I feel\")[(goto: \"Feelings\")]\n(click: \"how I look\")[(goto: \"Appearance\")]\\\n(click: \"what I carry\")[(goto: \"InventoryExplorer\")]\\\n(click: \"what I know\")[(goto: \"KnowledgeExplorer\")]\\\n</div>",
      "name": "GenericActions",
      "pid": "2",
      "position": {
        "x": "1094",
        "y": "28"
      }
    },
    {
      "text": "-- develop filth and water (add filth description to appearance)\n-- Add a rummage pile of items (use a push-your-luck mechanic)\n\n-- Rethinking knowledge dialogue options\n\n\n-- Threads to develop: Pit crew, strange symbols, whispering keepers, woman on the roof, locket, burial sites\n\n-- some option to remove clothing (eg to uncover face)\n-- concept of Filth, which should be attached to clothing rather than to the player generally. Think how this interacts with the \n-- Conversation system needs the following: options for silence or threatening behvaiour\n-- some more procedural stuff for use in conversations (the hag will be the first place to really explore this I reckon)\n-- explore concept of 'bring knowledge up to a certain point' passages for (display)ing when new information is gained and there are various cases for what needs bringing to what point\n\n-- ways to escape cell: wait for transferral to the Pit, use broken glass to cut bonds, persuade jailer using Ledger conversation, or else perhaps using knowledge of the Whispering Keepers?\n\n- consider possible variations on ending: Reach the Depths either via the Pit (by escaping the slavers/making them dig in the right place) or via the Comb (by overcoming the monster that lives there). Also, you should be able to simply escape from the skull through some other means, either contacting the Whispering Keepers or via the roof somehow. However, before you can leave either of those ways you should have to encounter the FACT of the ledger and its unbelievable power, and learn something that makes you think that YOU might be able to access it (that isn't just the fact that you're the protagonist of the game). Perhaps your ability to read differentiates you, and you could use the library?\n\n\n\n- Traveller's Friend -> her real role? Involves luring people to the skull, bamboozling them into making the wrongheaded decision to enter? She's definitely not aligned to any of the agents at work within the skull, however. Her role might be to disrupt whatever's happening in there. Perhaps her story contains some personal tragedy. Perhaps she is very ancient indeed.\n\n\n\n-some characters might refuse to talk to you about certain topics until criteria are met. For example, someone might need bribing with items or some such thing. This is easy to do - just add extra elements to their conversation database when appropritate, and remove these same things from their 'list of things asked already' array to allow those topics to be revisited.\n",
      "name": "ToDo",
      "pid": "3",
      "position": {
        "x": "40",
        "y": "25"
      }
    },
    {
      "text": "(print: $croachOpinion)\n\n(link:\"log\")[(display:\"log\")]",
      "name": "Debug Footer",
      "pid": "4",
      "position": {
        "x": "36",
        "y": "166"
      },
      "tags": [
        "debug-footer"
      ]
    },
    {
      "text": "The skull rises above the bone-bare plain. The sheer ivory walls reveal no windows, doors or gates. Above the walls, the structure is ribbed by gantries, walkways, and flying buttresses. It squats, pallid in the cold afternoon sun.\n\nLight glints off something moving along a cloister. The temple's cathedral-deep eye sockets stare, blind and hollow, across the desert. A lick of smoke emerges from somewhere behind the dome of the skull and curls into the sky.\n\n[[you have strayed too close|Intro1b]]",
      "links": [
        {
          "name": "you have strayed too close|Intro1b",
          "link": "you have strayed too close|Intro1b"
        }
      ],
      "name": "Intro1",
      "pid": "5",
      "position": {
        "x": "613",
        "y": "151"
      }
    },
    {
      "text": "You bid farewell to the shrouded stranger and her gaunt horse and begin the long walk toward the monument. Dust eddies between the lifeless rocks.\n\nYou lose an hour picking your way around the base of a vast rampart. The stone is foreign to this land. Was it from some far continent, borne here on the backs of countless long-dead slaves? You stare upwards, admiring the way that the flying buttresses seem to form a diadem around the temples of the skull.\n{(set: $playerTags to it + (a:\"curious\"))}\n[[night falls quickly in this part of the world|Intro5]]",
      "links": [
        {
          "name": "night falls quickly in this part of the world|Intro5",
          "link": "night falls quickly in this part of the world|Intro5"
        }
      ],
      "name": "Intro2",
      "pid": "6",
      "position": {
        "x": "477",
        "y": "664"
      }
    },
    {
      "text": "You bid farewell to the gaunt horse and its owner and begin the long walk toward the monument. Dust eddies between the lifeless rocks.\n\nAgainst the advice of a memory now fading, you tread a path across the plateau, meaning to keep a mile or more between you and the accursed heap. What is it that draws you toward it? No matter how many times you adjust your course away from the thing, it seems always to grow larger, coming between you and the setting sun, until you find yourself in its shadow, a mere stones throw from its base.\n{(set: $playerTags to it + (a:\"impetuous\"))}\n[[night falls quickly in this part of the world|Intro5]]",
      "links": [
        {
          "name": "night falls quickly in this part of the world|Intro5",
          "link": "night falls quickly in this part of the world|Intro5"
        }
      ],
      "name": "Intro3",
      "pid": "7",
      "position": {
        "x": "616",
        "y": "668"
      }
    },
    {
      "text": "You take a farewell drink with the kindly woman and begin the long march. It's a fine day for it.\n\nYou yomp across the plain, full of confrontations. The evening sunlight spills behind rounded domes and elevated cornices until you stand at the base of the long, high wall that's the first barrier between you and the skull.\n{(set: $playerTags to it + (a:\"drunk\"))\n(set: $inv to it + (a:\"empty wine bottle\"))}\n[[i'm going to be sick|Intro4a]]\n[[a noisome yell|Intro4b]]",
      "links": [
        {
          "name": "i'm going to be sick|Intro4a",
          "link": "i'm going to be sick|Intro4a"
        },
        {
          "name": "a noisome yell|Intro4b",
          "link": "a noisome yell|Intro4b"
        }
      ],
      "name": "Intro4",
      "pid": "8",
      "position": {
        "x": "806",
        "y": "676"
      }
    },
    {
      "text": "As the darkness sets in, you cast about for somewhere you can lay your head. This is no place to spend a night out in the open. You curse aloud the chain of events that led you on this journey.\n\n[[i had a wedding to attend|Intro6]]\n[[a census had been called in the city of my birth|Intro7]]\n[[i am an exile|Intro8]]",
      "links": [
        {
          "name": "i had a wedding to attend|Intro6",
          "link": "i had a wedding to attend|Intro6"
        },
        {
          "name": "a census had been called in the city of my birth|Intro7",
          "link": "a census had been called in the city of my birth|Intro7"
        },
        {
          "name": "i am an exile|Intro8",
          "link": "i am an exile|Intro8"
        }
      ],
      "name": "Intro5",
      "pid": "9",
      "position": {
        "x": "468",
        "y": "1000"
      }
    },
    {
      "text": "<span class = \"Title\">\n\n[[Fragments of Skull|Intro1]]</span>\nby Fred Francis and Ed Sibley\n\n\n\n(display: \"Devcon\")\n",
      "links": [
        {
          "name": "Fragments of Skull|Intro1",
          "link": "Fragments of Skull|Intro1"
        }
      ],
      "name": "Intro0",
      "pid": "10",
      "position": {
        "x": "610",
        "y": "1"
      }
    },
    {
      "text": "You heave the last of your wine in a red yawn into the dirt. The chalk-white dust turns grape-skin purple to blood. You fall gently into the filth. The sun sets behind you. It's been a tough road.\n(set: $filth to it + 1)\n[[night falls quickly in this part of the world|Intro5b]]",
      "links": [
        {
          "name": "night falls quickly in this part of the world|Intro5b",
          "link": "night falls quickly in this part of the world|Intro5b"
        }
      ],
      "name": "Intro4a",
      "pid": "11",
      "position": {
        "x": "736",
        "y": "816"
      }
    },
    {
      "text": "{(set: $playerTags to it + (a:\"noisy\"))} You shout yourself hoarse, and once you almost fancy that you hear a yell responding to your own. You stop and listen, but you hear nothing else. A dismal place to find yourself at the end of a dismal journey.\n\n[[night falls quickly in this part of the world|Intro5b]]",
      "links": [
        {
          "name": "night falls quickly in this part of the world|Intro5b",
          "link": "night falls quickly in this part of the world|Intro5b"
        }
      ],
      "name": "Intro4b",
      "pid": "12",
      "position": {
        "x": "888",
        "y": "816"
      }
    },
    {
      "text": "(set: $playerJourney to \"wedding\")The penalties for failing to attend a licensed wedding are severe. What crippled family you have left will not suffer at the hands of the Record-Keepers by your failing.\n\n[[so i must present myself for the marriage to which i am bound|Intro6a]]\n[[so again i must bear witness to the binding of another pair of wretches|Intro6b]]",
      "links": [
        {
          "name": "so i must present myself for the marriage to which i am bound|Intro6a",
          "link": "so i must present myself for the marriage to which i am bound|Intro6a"
        },
        {
          "name": "so again i must bear witness to the binding of another pair of wretches|Intro6b",
          "link": "so again i must bear witness to the binding of another pair of wretches|Intro6b"
        }
      ],
      "name": "Intro6",
      "pid": "13",
      "position": {
        "x": "420",
        "y": "1223"
      }
    },
    {
      "text": "(set: $playerJourney to \"census\")And with you halfway across the continent. But, the consequences for your family if you were not registered are too severe to contemplate. If you are absent on the day that the Notariser-General visits the seat of your birth, your father will be found in Contempt of Rigour, and your sister deprived of her right to marry.\n\nStill, six months should have been plenty of time to make the journey.\n\n[[but the journey went awry|Intro9]]",
      "links": [
        {
          "name": "but the journey went awry|Intro9",
          "link": "but the journey went awry|Intro9"
        }
      ],
      "name": "Intro7",
      "pid": "14",
      "position": {
        "x": "620",
        "y": "1239"
      }
    },
    {
      "text": "{(set: $playerTags to it + (a:\"exile\"))\n(set: $playerJourney to \"exile\")}In choosing exile, you spared your family the more egregious consequences of the wrath of the State. Of course, your disgrace will cast a shadow over them forever. But at least they still have a License to Possess Currency, and a Designated Homestead. It could have been much worse for them.\n\n[[So, it seems the life of the monastery is the fate I have been cast|Intro8a]]\n[[So, I must learn to glean some succour from this barren land and establish a farm far from the watchful writ of the State|Intro8b]]",
      "links": [
        {
          "name": "So, it seems the life of the monastery is the fate I have been cast|Intro8a",
          "link": "So, it seems the life of the monastery is the fate I have been cast|Intro8a"
        },
        {
          "name": "So, I must learn to glean some succour from this barren land and establish a farm far from the watchful writ of the State|Intro8b",
          "link": "So, I must learn to glean some succour from this barren land and establish a farm far from the watchful writ of the State|Intro8b"
        }
      ],
      "name": "Intro8",
      "pid": "15",
      "position": {
        "x": "820",
        "y": "1216"
      }
    },
    {
      "text": "{(if: $playerJourney is \"wedding\")[At first, you travelled in style. You had a good horse, plenty of money, and made good time. ]\n(if: $playerJourney is \"exile\")[You left the city through the Unmarked Gate and turned your back on everything you'd ever known. This was bad country, and you were sustained only by the fickle kindness of others. Much of the time, you lacked the energy to travel, and slumped by the roadside in a scrap of shade until someone took pity. It took some time for the charity of a generous stranger to put you on your feet, with a little money and a good horse under you. ]\n(if: $playerJourney is \"census\")[The start of your journey was delayed by several days as the Gate Warden was taken ill and your travelling permit could not be validated. Your rode hard, at first, to make up for lost time. ]\n\n(if: $playerTags contains \"curious\")[However, one afternoon you observed a curious marking on the hand of a beggar. He wore the blackened garb of those without Documentation, and he took exception to your questions about his tattoo. That evening, you were assailed in your sleep and drugged. You awoke in a stone circle atop a windy hill covered in bruises and devoid of possessions, saving the clothes on your back.]\n(elseif: $playerTags contains \"impetuous\")[However, you soon found yourself travelling with companions who proved less than competent. They proposed to save three days of riding by taking a shortcut across a river that they assured you was easily fordable. They were all of them swept away, and you barely escaped the surge with your life. It took you over a week to find the main road again.]\n(elseif: $playerTags contains \"drunk\")[However, your journey was measured in stops at public houses. Whole days were lost to revels in dusty shacks by the roadside, and your gold reserves dwindled day-by-day. You fell foul of a group of ruffians with rancid breath who beat you and relieved you of your supplies.]}\n\nWithout money or any evidence of social standing, you were forced to travel cross-country, on foot. This was dangerous.\n\n(if: $playerJourney is \"wedding\" or $playerJourney is \"census\")[[[time was short|Intro10]]](else:)[[[your destination seemed further away than ever|Intro10]]]",
      "links": [
        {
          "name": "[time was short|Intro10",
          "link": "[time was short|Intro10"
        },
        {
          "name": "[your destination seemed further away than ever|Intro10",
          "link": "[your destination seemed further away than ever|Intro10"
        }
      ],
      "name": "Intro9",
      "pid": "16",
      "position": {
        "x": "621",
        "y": "1583"
      }
    },
    {
      "text": "As the end of your eleven-year betrothment approached, you found your attention diverted by a sudden threat to your mother's business interests. The expedition to the mining colony and back shouldn't have taken more than a month or so. You curse into the frigid air.\n{(set: $inv to it + (a:\"locket\"))}\n[[Blight the gods who wrote this journey into my life!|Intro9]]",
      "links": [
        {
          "name": "Blight the gods who wrote this journey into my life!|Intro9",
          "link": "Blight the gods who wrote this journey into my life!|Intro9"
        }
      ],
      "name": "Intro6a",
      "pid": "17",
      "position": {
        "x": "340",
        "y": "1420"
      }
    },
    {
      "text": "You last saw this pair over a decade ago, when you were present at the solemnisation of their betrothment. When you recieved the summons, so many years after you saw them last, you had virtually forgotten about the responsibility. Little time remained - you quickly packed a bag and set out on the road, towards the city of your birth.\n\n[[Alas, that damned journey too went awry|Intro9]]\n[[What will have become of the poor pair, withering through their Committal?|Intro6c]]",
      "links": [
        {
          "name": "Alas, that damned journey too went awry|Intro9",
          "link": "Alas, that damned journey too went awry|Intro9"
        },
        {
          "name": "What will have become of the poor pair, withering through their Committal?|Intro6c",
          "link": "What will have become of the poor pair, withering through their Committal?|Intro6c"
        }
      ],
      "name": "Intro6b",
      "pid": "18",
      "position": {
        "x": "496",
        "y": "1364"
      }
    },
    {
      "text": "You had heard tell of an order of exiles who live in the mountains to the West who have foresworn the intrusion of the written word. These apostates, barely tolerated by virtue of their remoteness, pass on the secrets of their religion by whispering in the ears of initiates in darkened rooms far above the ground. That sounded like a good place.\n{\n(set: $playerTags to it + (a:\"spiritual\"))\n(set: \"people\" of $knowledge to it + (datamap: \"Whispering Keepers\",\"An isolated order who hold a heretical ideology - that the written word is not inviolate, and that the secret history of the world can only be truly told in whispers\"))\n}\n[[Could I not have been offered a final journey through the land of my birth without obstruction?|Intro9]]",
      "links": [
        {
          "name": "Could I not have been offered a final journey through the land of my birth without obstruction?|Intro9",
          "link": "Could I not have been offered a final journey through the land of my birth without obstruction?|Intro9"
        }
      ],
      "name": "Intro8a",
      "pid": "19",
      "position": {
        "x": "688",
        "y": "1364"
      }
    },
    {
      "text": "You would plough your field wherever the soil looked less than dead. You would pitch a tent somewhere with a view away from the land that had cast you out, and build a lodge for yourself to whatever specification you pleased. You'd cut down trees, un-notarised, and with the plants you'd grow, you'd cook whatever you wanted.\n{(set: $inv to it + (a:\"seed-bag\"))}\n[[But, there is nothing it this land that does not fail at the first step|Intro9]]",
      "links": [
        {
          "name": "But, there is nothing it this land that does not fail at the first step|Intro9",
          "link": "But, there is nothing it this land that does not fail at the first step|Intro9"
        }
      ],
      "name": "Intro8b",
      "pid": "20",
      "position": {
        "x": "896",
        "y": "1416"
      }
    },
    {
      "text": "{\n(if: $playerJourney is \"wedding\")[(set: $tmp to \"the city you seek\")]\n(if: $playerJourney is \"census\")[(set: $tmp to \"the city of your birth\")]\n(if: $playerJourney is \"exile\")[(set: $tmp to \"the distant South\")]\n}If the ancient Traveller's-Friend with the shrouded face had not happened upon you, you would have starved trying to cross the long desert. Days passed, barely broken by a fleeting, crescent-mooned night. Your lips cracked, your skin blistered, you realised that you were due to die. And then! You felt the dry rasp of her finger across your jaw, and the taste of brackish water in your mouth. She lay you across her horse, and fed you, and eventually you were well enough to walk beside her. \n\nShe led you across the desert, until you reached this bone-bare plain and the strange towering structure that now looms above your head. The track that leads to the Golden Road to $tmp lies far to the East, in the lee of a mountain whose peak you can just make out in the distance.\n\nYou recall the last words you exchanged with the Traveller's Friend.\n\n[['all this time, and I have yet to ask your name...'|IntroTutorialConv]]\n[['i will go now. you have my gratitude.'|Intro10a]]",
      "links": [
        {
          "name": "'all this time, and I have yet to ask your name...'|IntroTutorialConv",
          "link": "'all this time, and I have yet to ask your name...'|IntroTutorialConv"
        },
        {
          "name": "'i will go now. you have my gratitude.'|Intro10a",
          "link": "'i will go now. you have my gratitude.'|Intro10a"
        }
      ],
      "name": "Intro10",
      "pid": "21",
      "position": {
        "x": "619",
        "y": "1708"
      }
    },
    {
      "text": "A withered hand reaches out to your reins and stays your mare; a puff of ashen-white dust blusters from her hooves. You turn to your travelling companion. Scraps of winding-sheet hood and mask her and protect her from the dust. It strikes you that you can no longer remember her name. Did you ever know it?\n\nHer voice is muffled by the shroud.\n\n'These slow bones will go no further. I must leave you. Will you cross this desert alone?'\n\n[['i wish to see the famous structure near-at-hand.'|Intro2]]\n[['my shortest route leads across the plain.'|Intro3]]\n[['i am flush with the courage of drink, and will brook no objection.'|Intro4]]\n(link-goto: \"'i will not. i shall heed your advice, rest here awhile and return.'\", \"gameover\")",
      "links": [
        {
          "name": "'i wish to see the famous structure near-at-hand.'|Intro2",
          "link": "'i wish to see the famous structure near-at-hand.'|Intro2"
        },
        {
          "name": "'my shortest route leads across the plain.'|Intro3",
          "link": "'my shortest route leads across the plain.'|Intro3"
        },
        {
          "name": "'i am flush with the courage of drink, and will brook no objection.'|Intro4",
          "link": "'i am flush with the courage of drink, and will brook no objection.'|Intro4"
        }
      ],
      "name": "Intro1b",
      "pid": "22",
      "position": {
        "x": "613",
        "y": "288"
      }
    },
    {
      "text": "A gust of wind made devils in the sand. Something in the distance rattled.\\\n(set: $playerTags to it + (a:\"friendswitholdwoman\"))\\\n\n\"I will not tell you my name,\" she said after a moment. \"It is foresworn. I have helped you. What else would you ask of me?\"\n\n(set: $interlocutor to $friend)\\\n(display: \"ConversationInitialise\")\\\n(display: \"ConversationOptions\")",
      "name": "IntroTutorialConv",
      "pid": "23",
      "position": {
        "x": "421",
        "y": "1752"
      }
    },
    {
      "text": "enter game over text here",
      "name": "gameover",
      "pid": "24",
      "position": {
        "x": "783",
        "y": "11"
      }
    },
    {
      "text": "You tilt into blackness, propped against the chalky wall. After a time, you are half-waked as the wall burns with the desert cold. You draw a ragged cloak around your shoulders and begin to recount the events that led you here in an effort to pass the time.\n\n[[i had a wedding to attend|Intro6]]\n[[a census had been called in the city of my birth|Intro7]]\n[[i am an exile|Intro8]]",
      "links": [
        {
          "name": "i had a wedding to attend|Intro6",
          "link": "i had a wedding to attend|Intro6"
        },
        {
          "name": "a census had been called in the city of my birth|Intro7",
          "link": "a census had been called in the city of my birth|Intro7"
        },
        {
          "name": "i am an exile|Intro8",
          "link": "i am an exile|Intro8"
        }
      ],
      "name": "Intro5b",
      "pid": "25",
      "position": {
        "x": "764",
        "y": "1012"
      }
    },
    {
      "text": "You have spent many any hour wondering this on the lonely journey. Will their lavish vestments have decayed to tattered rags? Will their rosy skin have taken the ashen pallor of the dead? It is comforting to think that even the successful cannot be immune to the cruel vissicitudes that are the daily life of the people of this land. \n\n(set: $playerTags to it + (a:\"weddingfriends\"))\n\n[[For even I have not been able to escape trials on this journey|Intro9]]",
      "links": [
        {
          "name": "For even I have not been able to escape trials on this journey|Intro9",
          "link": "For even I have not been able to escape trials on this journey|Intro9"
        }
      ],
      "name": "Intro6c",
      "pid": "26",
      "position": {
        "x": "416",
        "y": "1560"
      }
    },
    {
      "text": "(set: $interlocutor to (datamap:))\n\n(display: \"InitialiseFriend\")\n\n(display: \"InitialiseJailer\")\n\n(display: \"InitialiseShad\")\n\n(display: \"InitialiseCroach\")\n\n(display: \"InitialiseMOW\")\n\n(display: \"InitialisePubman\")\n\n(display: \"InitialisePubwoman\")\n\n(goto: \"InitialiseKnowledge\")",
      "name": "InitialiseConversation",
      "pid": "27",
      "position": {
        "x": "318",
        "y": "146"
      }
    },
    {
      "text": "(set: \"people\" of $knowledge to it + (datamap:\n\"Traveller's Friend\", \"A woman wrapped in winding sheets who brought you to this place.\",\n\"Arbiters\", \"Those whose rigid governance maintains the order upon which your old life was built.\",\n\n))\n\n(set: \"places\" of $knowledge to it + (datamap:\n\"the bone-bare plain\", \"At the edge of the map, orthogonal to every road, avoided by those who know their business, blasted.\",\n\n\"the skull\", \"It would take days to walk all the way around its outer wall. Its provenance is unknown. You are somewhere within it.\",\n\"my destination\",\"Past the mountain range that rises in the east of this plain is a pass that leads to the Great Gold Road, and thence to the object of your journey.\",\n))\n\n(set: \"history\" of $knowledge to it + (datamap:\n\"the Administration\", \"A bureaucracy as old as written records. Every detail of your life - the time of your birth, the positions of the planets on your coming-of-age, the projected date of your death - is stored in rolls somewhere below the Capital.\",\n))\n\n(set: $trash to (datamap:))\n(goto: \"InitialiseFeelings\")",
      "name": "InitialiseKnowledge",
      "pid": "28",
      "position": {
        "x": "320",
        "y": "271"
      }
    },
    {
      "text": "People:\n\n<span class = \"Fancy\">(print: (datanames: \"people\" of $knowledge).join(\"\n\"))\\\n</span>\\\n(set: $peopleNumber to (datanames: (\"people\" of $knowledge))'s length)\\\n(set: $i to 0)\\\n[(display: \"PeopleKnowledgeLooper\")]<peopleLoop|\n\nPlaces:\n\n<span class = \"Fancy\">(print: (datanames: \"places\" of $knowledge).join(\"\n\"))\\\n</span>\\\n(set: $placesNumber to (datanames: (\"places\" of $knowledge))'s length)\\\n(set: $i to 0)\\\n[(display: \"PlacesKnowledgeLooper\")]<placesLoop|\n\nHistory:\n\n<span class = \"Fancy\">(print: (datanames: \"history\" of $knowledge).join(\"\n\"))\\\n</span>\\\n(set: $historyNumber to (datanames: (\"history\" of $knowledge))'s length)\\\n(set: $i to 0)\\\n[(display: \"HistoryKnowledgeLooper\")]<historyLoop|\n\n(link: \"return\")[(goto:(history:)'s last)]",
      "name": "KnowledgeExplorer",
      "pid": "29",
      "position": {
        "x": "1105",
        "y": "181"
      }
    },
    {
      "text": "(if: $i < $peopleNumber)[\\\n(set: $name to (datanames: \"people\" of $knowledge)'s ($i))\\\n(set: $value to $knowledge's (\"people\")'s ($name))\\\n(set: $link to '(clickappend: \"' + $name + '\")[<span class = \"Normal\"> - ' + $value + '</span>\n]')\\\n(print: $link)\\\n(set: $i to it + 1)\\\n(replace: ?peopleLoop)[(display: \"PeopleKnowledgeLooper\")]\\\n]",
      "name": "PeopleKnowledgeLooper",
      "pid": "30",
      "position": {
        "x": "1240",
        "y": "183"
      }
    },
    {
      "text": "(if: $i < $placesNumber)[\\\n(set: $name to (datanames: \"places\" of $knowledge)'s ($i))\\\n(set: $value to $knowledge's (\"places\")'s ($name))\\\n(set: $link to '(clickappend: \"' + $name + '\")[<span class = \"Normal\"> - ' + $value + '</span>\n]')\\\n(print: $link)\\\n(set: $i to it + 1)\\\n(replace: ?placesLoop)[(display: \"PlacesKnowledgeLooper\")]\\\n]",
      "name": "PlacesKnowledgeLooper",
      "pid": "31",
      "position": {
        "x": "1365",
        "y": "181"
      }
    },
    {
      "text": "(if: $i < $historyNumber)[\\\n(set: $name to (datanames: \"history\" of $knowledge)'s ($i))\\\n(set: $value to $knowledge's (\"history\")'s ($name))\\\n(set: $link to '(clickappend: \"' + $name + '\")[<span class = \"Normal\"> - ' + $value + '</span>\n]')\\\n(print: $link)\\\n(set: $i to it + 1)\\\n(replace: ?historyLoop)[(display: \"HistoryKnowledgeLooper\")]\\\n]",
      "name": "HistoryKnowledgeLooper",
      "pid": "32",
      "position": {
        "x": "1491",
        "y": "181"
      }
    },
    {
      "text": "KNOWLEDGE\nPeople:\nTraveller's Friend\nArbiters\nWhispering Keepers\nstooped figures //replacable with Pit Crew//\nPit Crew\nthe betrothed woman\nCroach\nShad\nthe maggot\n\nPlaces:\nthe bone-bare plain\nthe skull\nwhat's below //replacable with whatever that is//\nthe cell\nthe library\nskull burial site\nhips burial site //currently unimplemented, but this is the burial site that marks the real location of the ledger (it is below here, but the pit crew could excavate it//\nthe Middens\nthe bloody chute\n\nHistory:\nthe Administration\nthe Bitten Tongue\nStrange symbol of teeth // Should be replaced with both Whispering Keepers (people) and The Bitten Tongue (history) if investigated somehow inside the dungeon. This might be a mechanism we use to develop knowledge - sometimes you'll gain incomplete knowledge and you'll get a placeholder entry in the knowledge bank like this, which is overwritten later. See Intro11 for an example of what I mean.//\nChildren's Song\nthe ledger //you don't know what this is yet//\nThe Black Ledger //you know what this is and it's dangerous knowledge to admit to//\nsign of linked circles\nstrange spectral attire\nlocation of the Ledger //currently unimplemented. Represents the point at which you know that the ledger is under the hips burial site. If you have this knowledge as well as hips burial site, you can try to convince the pit crew that they're digging in the wrong place.//\n\nplayer tags:\n\ncurious\nimpetuous\ndrunk\nnoisy\nexile\nspiritual\nweddingfriends\nfriendswitholdwoman\nboundhands\nthirsty\nowespublican //for if you drank in the bar in the Middens and owe the guy a favour//\nreleased //for if you're out of jail//\n\nunchained //for if you're out of the chain gang//\nrevolution //for if Croach has been overthrown//\nmanacles //for if you're wearing manacles//\nshoulderchains //for if you're in the Pit Crew with their chains//\n\njourney tags:\n\nwedding\ncensus\nexile\n\ninventory items:\n\nempty wine bottle\nwaterskin\nsandals\ndusty robe\nlocket\nseed-bag\nwinding sheet\nbone brooch\nshard of green glass\nrope\n\nbody parts:\n\nhead\ntorso\nfeet\nhands\n\nenvironmental actions:\n///$broochonfloor///\n///$ropeinhallway///\n///$sawbodydrop///\n///$boughtdrink///",
      "name": "relevant strings",
      "pid": "33",
      "position": {
        "x": "34",
        "y": "423"
      }
    },
    {
      "text": "The ceiling of the shelter is a rotten board, wedged into ragged cracks the stonework. The space is larger than it seemed from outside. The walls in the shelter are tacked with talismans of bone and hair, and something large and rotten is bundled up in the crook of the corner. There is a patterned mat of reeds spread across the floor. On the far wall, glistening, is a series of angular markings that depict a fleshy tongue, impaled on a series of long triangles. \n\nYou gaze at it, transfixed.\n\n(if: (datanames: \"people\" of $knowledge) contains \"Whispering Keepers\")[It is the icon of the Whispering Keepers, the order of monks that you seek. This sign is used by others to refer to them. What is it doing here? You know it to be a heretical sign, but then this is a place avoided by most, so perhaps here, of all places, it is not too unexpected to see it. You fear that it designates a warning.\n(set: \"history\" of $knowledge to it + (datamap:\"The Bitten Tongue\",\"An icon that depicts a tongue protruding between sharpened teeth. It is used to refer to the Whispering Monks, and has been daubed (perhaps in warning) on the wall of a shack, leaning up against the exterior of the skull.\"))]\n(else:)[You've never seen anything like it.(set: \"history\" of $knowledge to it + (datamap:\"Strange symbol of teeth\", \"A marking spotted outside the Skull, depicting a tongue clamped tight between sharp fangs.\"))]\n\nIt's the last thing you see before the grit beneath your feet starts to shift, and the ground gives way, and you begin to fall into the ground. \n\n[[i bid my freedom goodbye|Entrance0]]",
      "links": [
        {
          "name": "i bid my freedom goodbye|Entrance0",
          "link": "i bid my freedom goodbye|Entrance0"
        }
      ],
      "name": "Intro11",
      "pid": "34",
      "position": {
        "x": "468",
        "y": "2207"
      }
    },
    {
      "text": "You attempt to sleep. With the darkness comes an intense cold, and through the veil of half-waking you hear voices, and the sound of a campfire. Inchoate, you rise and walk towards the light. You are shaking with cold, but you are surrounded by voices of encouragement and welcome, so you keep moving forwards towards the flickering light of more fortunate campers. Hands touch your back and your neck as you are brought into the fold. Their touch is dry, like that of the Traveller's Friend.\n\n(if: $playerJourney is \"wedding\")[Things are fine here. The voices are warm. You are invited to sit down. Such comfort - so unlike the treatment you will, in all likelihood, receive upon the completion of your journey. The thin gruel, the sour wine of the wedding feast are as nothing to the repast at this desert campfire.]\n\nSomething gives way beneath you. You begin to fall. This is bad. Something very bad is happening. (if: $inv contains \"winding-sheet\")[The winding-sheet flaps in the updraft as you plummet. As you land in a pile of straw, it falls across your face. You faint.]\n\n[[i bid my freedom goodbye|Entrance0]]",
      "links": [
        {
          "name": "i bid my freedom goodbye|Entrance0",
          "link": "i bid my freedom goodbye|Entrance0"
        }
      ],
      "name": "Intro12",
      "pid": "35",
      "position": {
        "x": "633",
        "y": "2145"
      }
    },
    {
      "text": "A jagged outcrop of rocks, shafting the sky with daggers that would rend its woollen flesh if they could but reach. The rocks offer a little shelter from the wind and you curl up. Exhaustion overtakes you, and you fall into a fitful sleep. \n\n(if: ($playerTags contains \"drunk\") is false)[You awaken to see a figure standing over you, stoop-shouldered, hooded against the wind. Chains glitter in the moonlight, linking its neck and arms. It shouts something, but you can't hear its voice. It reaches down and clubs you over the head. The world goes black.(set: \"people\" of $knowledge to it + (datamap:\"stooped figures\",\"You were abducted by a figure in a hood with a crooked back and heavy chains threaded between its neck and wrists.\"))]\\\n(else:)[You dream of choppy seas, and pits full of bones, and of a grinning skull many miles high which opens its jaws wide and consumes you.]\n\n(set: $playerTags to it + (a:\"boundhands\"))\\\n[[i bid my freedom goodbye|Entrance0]]",
      "links": [
        {
          "name": "i bid my freedom goodbye|Entrance0",
          "link": "i bid my freedom goodbye|Entrance0"
        }
      ],
      "name": "Intro13",
      "pid": "36",
      "position": {
        "x": "788",
        "y": "2098"
      }
    },
    {
      "text": "You carry on around the skull, scanning the horizon for the mountain that is your destination, black on navy blue. (if: $playerTags contains \"noisy\")[It feels good to sing. Your voice travels far across the plain. The dangers of the road are nothing to you as you bawl the story of the harlot and the reeve at the top of your lungs.](else:)[Before long, you realise that your footsteps are not the only ones you can hear. And then, a voice, whispering not quietly enough - \n'Yes, we'll take this one in now, and leave it in the usual place.' You cast about for a rock, a branch, some kind of weapon, but too late. You risk a glance behind you, and see a hunched silhouette, with metal glinting on its shoulders. It looks like it is wearing chains.(set: \"people\" of $knowledge to it + (datamap:\"stooped figures\",\"You were abducted by a figure in a hood with a crooked back and heavy chains threaded between its neck and wrists.\"))]\n\nA net erupts from the sand beneath your feet and raises you into the air. A rope creaks above you. You sway backwards and forwards, wishing that you had a knife. \n'Oh yes, this one will make good repast for what's below,' yells a voice nearby. \n'Its hunger will be well-sated, I've no doubt.'(set: \"places\" of $knowledge to it + (datamap:\"something below\",\"Your abuductors mentioned something dwelling down below, which they intended to feed you to.\")) The net goes slack, and you drop towards the ground, hard. A rock meets the back of your neck, and you go limp.\n\n(set: $playerTags to it + (a:\"boundhands\"))\\\n[[i bid my freedom goodbye|Entrance0]]",
      "links": [
        {
          "name": "i bid my freedom goodbye|Entrance0",
          "link": "i bid my freedom goodbye|Entrance0"
        }
      ],
      "name": "Intro14",
      "pid": "37",
      "position": {
        "x": "920",
        "y": "1997"
      }
    },
    {
      "text": "You awaken to the sharp touch of icy water, stinging your forehead in fat drops. Light comes in through a rectangular opening in the ceiling above you, slanting down through the chamber where you lie in a pile of straw.\n(if: $playerTags contains \"boundhands\")[Your hands are bound.]\n\n[[Pull yourself together->Entrance2]]",
      "links": [
        {
          "name": "Pull yourself together",
          "link": "Entrance2",
          "pid": "76"
        }
      ],
      "name": "Entrance1",
      "pid": "38",
      "position": {
        "x": "1243",
        "y": "2343"
      }
    },
    {
      "text": "ask about (print: (datanames: \"people\" of $knowledge).join(\"\nask about \"))\nask about (print: (datanames: \"places\" of $knowledge).join(\"\nask about \"))\nask about (print: (datanames: \"history\" of $knowledge).join(\"\nask about \"))\n(linkgoto: \"say farewell\",\"playerExit\" of $interlocutor)\n{\n(set: $peopleNumber to (datanames: (\"people\" of $knowledge))'s length)\\\n(set: $i to 0)\\\n[(display: \"PeopleConversationLooper\")]<peopleLoop|\n(set: $placesNumber to (datanames: (\"places\" of $knowledge))'s length)\\\n(set: $i to 0)\\\n[(display: \"PlacesConversationLooper\")]<placesLoop|\n(set: $historyNumber to (datanames: (\"history\" of $knowledge))'s length)\\\n(set: $i to 0)\\\n[(display: \"HistoryConversationLooper\")]<historyLoop|\n}",
      "name": "OldConversationOptions",
      "pid": "39",
      "position": {
        "x": "1936",
        "y": "340"
      }
    },
    {
      "text": "(set: $displayInterjections to true)\\\n(if: $patience > 0)[{\n(set: $topicsDiscussed to it + (a: $query))\n(if: \"opinions\" of $interlocutor contains $query)[\n(set: $patience to it + $query of \"opinions\" of $interlocutor)]\n\n(if: $patience > 3)[\n(set: $tic to (string:\"warm\" + (string:(either: 1, 2))))]\n(elseif: $patience > 1)[\n(set: $tic to (string:\"cool\" + (string:(either: 1, 2))))]\n(else:)[\n(set: $tic to (string:\"cold\" + (string:(either: 1, 2))))]\n\n}(print: $tic of \"attitudes\" of $interlocutor)\n\n(if: \"responses\" of $interlocutor contains $query)[(print: $query of \"responses\" of $interlocutor)]\\\n(else:)[(print: $iDontKnow's 1st)(set: $iDontKnow to (rotated: 1, ...$iDontKnow))(set: $patience to it - 2)]\n\\\n(set: $interjections to (rotated: 1, ...$interjections))\\\n\\\n(display: \"ConversationResponseStage2\")\n]\\\n(else:)[(display: \"exit\" of $interlocutor)]",
      "name": "ConversationResponse",
      "pid": "40",
      "position": {
        "x": "1216",
        "y": "476"
      }
    },
    {
      "text": "(if: $i < $peopleNumber)[\\\n(set: $name to (datanames: \"people\" of $knowledge)'s ($i))\\\n(if: ($topicsDiscussed contains $name) is false)[\n(set: $link to '(click: \"' + $name + '\")[\n(set: $query to \"' + $name + '\")(goto: \"ConversationResponse\")\n]')\\\n(print: $link)\\\n]\n(set: $i to it + 1)\\\n(replace: ?peopleLoop)[(display: \"PeopleConversationLooper\")]\\\n]",
      "name": "PeopleConversationLooper",
      "pid": "41",
      "position": {
        "x": "1504",
        "y": "428"
      }
    },
    {
      "text": "(if: $i < $placesNumber)[\\\n(set: $name to (datanames: \"places\" of $knowledge)'s ($i))\\\n(if: ($topicsDiscussed contains $name) is false)[\n(set: $link to '(click: \"' + $name + '\")[\n(set: $query to \"' + $name + '\")(goto: \"ConversationResponse\")\n]')\\\n(print: $link)\\\n]\n(set: $i to it + 1)\\\n(replace: ?placesLoop)[(display: \"PlacesConversationLooper\")]\\\n]",
      "name": "PlacesConversationLooper",
      "pid": "42",
      "position": {
        "x": "1628",
        "y": "428"
      }
    },
    {
      "text": "(if: $i < $historyNumber)[\\\n(set: $name to (datanames: \"history\" of $knowledge)'s ($i))\\\n(if: ($topicsDiscussed contains $name) is false)[\n(set: $link to '(click: \"' + $name + '\")[\n(set: $query to \"' + $name + '\")(goto: \"ConversationResponse\")\n]')\\\n(print: $link)\\\n]\n(set: $i to it + 1)\\\n(replace: ?historyLoop)[(display: \"HistoryConversationLooper\")]\\\n]\n",
      "name": "HistoryConversationLooper",
      "pid": "43",
      "position": {
        "x": "1752",
        "y": "428"
      }
    },
    {
      "text": "'There is a rhyme about this place. It goes like this:\nAll is known to the maid atop the dome,\nApart from the fate of the maggot in the heart,\nAnd the beast that curls about the feet.\nChildren sing it. It chills my old blood. I dread to get too close.' (set: $knowledge's (\"history\") to it + (datamap: \"Children's Song\", \"It goes like this:\nAll is known to the maid atop the dome,\nApart from the fate of the maggot in the heart,\nAnd the beast that curls about the feet.\"))",
      "name": "skullResponse",
      "pid": "44",
      "position": {
        "x": "386",
        "y": "3718"
      }
    },
    {
      "text": "Now you are alone again, and your journey is far from over. It is nightfall. You find yourself stood at the base of this preposterous fortress, hundreds of miles from anywhere you want to be. Exhaustion dogs you.\n\n(if: $playerTags contains \"spiritual\" and (either: true, false))[\n[[i spot a sagging shelter in the angle between a butress and the wall and move into it\n|Intro11]]]\\\n(if: $inv contains \"winding-sheet\")[\n[[i wrap myself in the sheet the old woman dropped and try to sleep\n|Intro12]]]\\\n(if: $playerJourney is \"wedding\" and (either: true, false))[\n[[i try to distract myself from my present plight by imagining, for the hundredth time, the celebrations i will enjoy on my return\n|Intro12]]]\\\n(if: $playerTags contains \"impetuous\" or (either: true, false))[\n[[i curl up at the bottom of the wall and look up at the stars\n|Intro13]]]\\\n(if: $playerTags contains \"drunk\" and (either: true, false))[\n[[my head aches and my stomach churns, so i rest for a moment on a rock\n|Intro13]]]\\\n(if: $playerTags contains \"noisy\" and (either: true, false))[\n[[i keep myself awake by singing a bawdy song as i stroll on around the parapet\n|Intro14]]]\\\n(if: (either: true, false))[\n[[i feel that exercise will keep exhaustion at bay, so i keep exploring the perimeter of the fortress\n|Intro14]]]\\\n(else:)[\n[[i wander beneath the stars and consider my situation\n|Intro14]]]",
      "name": "Intro10b",
      "pid": "45",
      "position": {
        "x": "636",
        "y": "1985"
      }
    },
    {
      "text": "She nodded at you, and without saying another word she turned and rode back the way you came.\n[[Intro10b]]",
      "links": [
        {
          "name": "Intro10b",
          "link": "Intro10b",
          "pid": "45"
        }
      ],
      "name": "Intro10a",
      "pid": "46",
      "position": {
        "x": "796",
        "y": "1734"
      }
    },
    {
      "text": "She stopped, then, and took a rattling breath. Her body twisted, sinuous, and was wracked with coughs. Red droplets, indistinct, blotted through the sheet that covered her mouth.\n\n[['you are sick. i should stay with you.'|TFCoughsA]]\n[['i hope your illness is not contagious.'|TFCoughsB]]",
      "links": [
        {
          "name": "'you are sick. i should stay with you.'|TFCoughsA",
          "link": "'you are sick. i should stay with you.'|TFCoughsA"
        },
        {
          "name": "'i hope your illness is not contagious.'|TFCoughsB",
          "link": "'i hope your illness is not contagious.'|TFCoughsB"
        }
      ],
      "name": "TFCoughs",
      "pid": "47",
      "position": {
        "x": "515",
        "y": "3991"
      }
    },
    {
      "text": "As she shrank into the distance, a length of sheet came away from her figure and drifted towards you in the wind. \n\n(link: \"you caught it\")[(set: $inv to it + (a:\"winding sheet\"))(goto:\"Intro10b\")]\n[[you let it blow away|Intro10b]]",
      "links": [
        {
          "name": "you let it blow away|Intro10b",
          "link": "you let it blow away|Intro10b"
        }
      ],
      "name": "ConversationTutorialExit",
      "pid": "48",
      "position": {
        "x": "415",
        "y": "1877"
      }
    },
    {
      "text": "She turned sharply in her saddle and looked directly at you. A rare gesture.\n\n'No,' she said. 'Foolishness. How dare you? After the miles we have walked together, you would squander my goodwill on the ministrations of a nursemaid? Pah. I would not brook it.' (set: $patience to it - 2)\n\n(display:\"ConversationOptions\")",
      "name": "TFCoughsA",
      "pid": "49",
      "position": {
        "x": "450",
        "y": "4116"
      }
    },
    {
      "text": "She laughed, and you heard blood gargling in her mouth.\n\n'Fear not, child. You will do just fine. Yes, you will do very well.' (set: $patience to it + 2)\n\n(display: \"ConversationOptions\")",
      "name": "TFCoughsB",
      "pid": "50",
      "position": {
        "x": "586",
        "y": "4116"
      }
    },
    {
      "text": "A silence fell between you.\n\n'Did you have aught else to say? I detest prolonged farewells.'\n\n(display: \"ConversationOptions\")",
      "name": "TFBrushOff",
      "pid": "51",
      "position": {
        "x": "370",
        "y": "3991"
      }
    },
    {
      "text": "Her stick-thin arm reached across and she touched your shoulder.\n\n'Enough,' she said. 'Here is where our paths diverge. Perhaps we will see one another again, but I think it is unlikely. I would wish you luck, but those who need recourse to luck in a world such as this are lost already. So I will say only farewell.'\n\n(display: \"ConversationExit\")\\\n(display: \"ConversationTutorialExit\")",
      "name": "TFExit",
      "pid": "52",
      "position": {
        "x": "316",
        "y": "3858"
      }
    },
    {
      "text": "'It is the time,' she says. 'Your fate is now yours to direct. Your destination is known to you.'\n\nHer fingers tightened on the reins.\n\n'Until the next life, then.'\n\n(display: \"ConversationExit\")\\\n(display: \"ConversationTutorialExit\")",
      "name": "TFExitPlayer",
      "pid": "53",
      "position": {
        "x": "461",
        "y": "3858"
      }
    },
    {
      "text": "She scratched her lower back with a bony finger.\n\n'Now, let me ask you something. Is there anyone in this world that you care about, truly? If the worn tapestry of this tattered world were one day rent asunder, would your final thought be of yourself, or of some other person?'\n\n[['i would regret only the wine i left undrunk.'|TFQuestionA]]\n[['truly, there is another who is often in my thoughts.'|TFQuestionB]]",
      "links": [
        {
          "name": "'i would regret only the wine i left undrunk.'|TFQuestionA",
          "link": "'i would regret only the wine i left undrunk.'|TFQuestionA"
        },
        {
          "name": "'truly, there is another who is often in my thoughts.'|TFQuestionB",
          "link": "'truly, there is another who is often in my thoughts.'|TFQuestionB"
        }
      ],
      "name": "TFQuestion",
      "pid": "54",
      "position": {
        "x": "241",
        "y": "3988"
      }
    },
    {
      "text": "The woman's laugh is brief and sharp.\n\n'I am glad I saved you, stranger. Truly I am. So many lonely travellers disappoint me.'\n\n[['what is it in these people that disappoints you so?'|TFQuestionC]]\n(display: \"ConversationOptions\")",
      "links": [
        {
          "name": "'what is it in these people that disappoints you so?'|TFQuestionC",
          "link": "'what is it in these people that disappoints you so?'|TFQuestionC"
        }
      ],
      "name": "TFQuestionA",
      "pid": "55",
      "position": {
        "x": "175",
        "y": "4128"
      }
    },
    {
      "text": "'Hm,' she said. 'Then I will think on your beloved in my reveries.' You thought you heard something malign in her tone, but you couldn't be sure.\n\n(display: \"ConversationOptions\")",
      "name": "TFQuestionB",
      "pid": "56",
      "position": {
        "x": "315",
        "y": "4121"
      }
    },
    {
      "text": "'They often fail to devliver my expectations. I ask for so little in return for my friendship.'\n\n[['what kind of charity is this, that comes with such conditions?'|TFQuestionD]]\n[['is there something you would have of me?|TFQuestionE]]\n(display: \"ConversationOptions\")",
      "links": [
        {
          "name": "'what kind of charity is this, that comes with such conditions?'|TFQuestionD",
          "link": "'what kind of charity is this, that comes with such conditions?'|TFQuestionD"
        },
        {
          "name": "'is there something you would have of me?|TFQuestionE",
          "link": "'is there something you would have of me?|TFQuestionE"
        }
      ],
      "name": "TFQuestionC",
      "pid": "57",
      "position": {
        "x": "140",
        "y": "4271"
      }
    },
    {
      "text": "'Whoever said my intentions were charitable?'\n\n(display: \"TFExit\")",
      "name": "TFQuestionD",
      "pid": "58",
      "position": {
        "x": "220",
        "y": "4406"
      }
    },
    {
      "text": "'We will probably never cross paths again. However, if we do, I will ask something small of you. Only something small. Better not to think of it.'\n\n(display: \"ConversationOptions\")",
      "name": "TFQuestionE",
      "pid": "59",
      "position": {
        "x": "81",
        "y": "4398"
      }
    },
    {
      "text": "{(set: $topicsDiscussed to (a:))\n(set: $interjections to \"interjections\" of $interlocutor)\n(set: $interjections to (shuffled: ...$interjections))\n(set: $iDontKnow to \"iDontKnow\" of $interlocutor)\n(set: $iDontKnow to (shuffled: ...$iDontKnow))\n\n(if: $timeindungeon>(\"timelastmet\" of $interlocutor))[\n(set: \"patience\" of $interlocutor to it+($timeindungeon-(\"timelastmet\" of $interlocutor)))]\n\n<!-- could maybe do something here with modifying patience based on items of clothing, etc -->\n\n(if: (\"patience\" of $interlocutor)>(\"maxpatience\" of $interlocutor))[(set: (\"patience\" of $interlocutor) to (\"maxpatience\" of $interlocutor))]\n\n(if: (datanames: $interlocutor) contains \"specialPatienceLevel\")[(display:\"specialPatienceLevel\" of $interlocutor)]\n\n(set: $patience to \"patience\" of $interlocutor)\n\n}",
      "name": "ConversationInitialise",
      "pid": "60",
      "position": {
        "x": "1091",
        "y": "348"
      }
    },
    {
      "text": "{(set: $interlocutor's \"topicsDiscussed\" to (a:) + $topicsDiscussed)\n(set: $interlocutor's \"timelastmet\" to $timeindungeon)\n(set: $interlocutor to (datamap:))\n}",
      "name": "ConversationExit",
      "pid": "61",
      "position": {
        "x": "1091",
        "y": "473"
      }
    },
    {
      "text": "(set: $inv to it - (a: \"\"))\n(print: $inv.join(\"\n\"))\\\n(set: $invNumber to $inv's length)\\\n(set: $i to 0)\\\n[(display: \"ItemsLooper\")]<itemsLoop|\n\n(link: \"Done\")[(goto: (history:)'s last)]",
      "name": "InventoryExplorer",
      "pid": "62",
      "position": {
        "x": "1076",
        "y": "740"
      }
    },
    {
      "text": "(if: $i < $invNumber)[\\\n(set: $name to (string:$inv's ($i)))\\\n(set: $link to '(click: \"' + $name + '\")[(goto: \"' + $name + '\")]')\\\n(print: $link)\\\n\\\n(set: $i to it + 1)\\\n(replace: ?itemsLoop)[(display: \"ItemsLooper\")]\\\n]",
      "name": "ItemsLooper",
      "pid": "63",
      "position": {
        "x": "1211",
        "y": "736"
      }
    },
    {
      "text": "The waterskin is empty.\n\n(link: \"Done\")[(goto: (history:)'s 2ndlast)]",
      "name": "waterskin",
      "pid": "64",
      "position": {
        "x": "71",
        "y": "1016"
      }
    },
    {
      "text": "Some notes on the main systems in the game. Note - to keep the code here from firing (and messing up the actual game, possibly) I'm nesting it in little `` markers that basically neuter it and stop it from having magic code power.\n\n//Tags and Variables//\nNB - if you want to change a tag or variable, do it in a silent passage where possible. Doing it in a passage which has the generic actions means it runs every time you go back to it, which causes all kinds of problems\n\n//Relevant strings//\nThere's a passage called relevant strings under this one where I'm keeping a record of every string that we use for items, tags, knowledge datanames, etc. I think this is important because all these `(if:)` comparisons are case-sensitive and having the wrong capitalisation or punctuation can throw them off, so the version of a string in the relevant strings passage should be what you refer to when you're putting checks in the game. Update it whenever you add a new tag or whatever. Given that Twine doesn't have the concept of a Enum, this is the best way to keep the code nice and sanitary.\n\n//Knowledge//\nThis is a datamap that contains three sub-datamaps for people, places and history. To add to it, use a set macro like this:\n\n`(set: \"history\" of $knowledge to it + (datamap:\"The Great Schism\",\"Whatever this is.\"))`\n\nYou can also check if something is known or not using something like this:\n\n`(if: (datanames: \"history\" of $knowledge) contains \"The Great Schism\")[You recognise the depiction of the Great Schism on the wall.]\n(else:)[It's not clear what this mural depicts, but it involves people burning books and scholars wailing. A shadowy figure presides over all.]`\n\nSometimes a bit of knowledge might make a previous entry irrelevant or obsolete. For example, in Intro11, if you know about the Whispering Keepers, you recognise their mark and get a knowledge entry about The Bitten Tongue. Otherwise, you get a placeholder enrty called 'strange symbol of teeth' that might be updated later on if you talk to someone, or some such thing.\n\n//Conversation//\nNOTE: The Traveller's Friend dialogue is in the past tense but the rest ought to be in the present.\n\nTo create a person who can be talked to, do the following:\n\n1) First, add an entry for them to the InitialiseConversations passage. The datamap contains values for \"patience\", \"maxpatience\", \"timelastmet\", \"responses\", \"opinions\", \"attitudes\", \"interjections\", \"iDontKnow\", \"playerExit\", \"exit\" and \"topicsDiscussed\".\n\nHere's what those things are:\n\npatience - number - the 'HP' of the conversation. When it gets to zero, the NPC ends the conversation. If we want characters who are going to recur or be visitable more than once, we'll need to work out how to top it back up after sufficient time is passed (SEE BELOW). It gets stored in a variable called $patience during the conversation itself so you don't have to keep typing (set: \"patience\" of $interlocutor to it - 1).\n\nmaxpatience - the maximum value of patience for this character\n\ntimelastmet - this is a record of the player variable $timeindungeon. it's set in the ConversationExit passage to whatever $timeindungeon was at that point. When a conversation happens, the conversation intialise passage checks if $timeindungeon is higher than timelastmet. If so, it tops up \"patience\" accordingly, but won't go above maxpatience (so meeting new characters will always be at their maxpatience). Should be set to 0 in intialisation \n\nresponses - datamap of either strings or macros - The main feature of this whole system. This is the list of their responses to things you might ask them about. The datanames in this datamap must be spelled and capitalised exatctly the same as their counterparts the datanames in the \"knowledge\" datamap. The value that comes afterwards can be one of two things - either a string, if you want their response to just be text, or else a `(display:)` macro referring to a passage if you want their response to trigger some code (for example, to add an entry to the knowledge datamap). See the \"skullResponse\" passage for an example of this. If you want the response to exit the conversation entirely (for example, if someone takes you somewhere, or pushes you down a hole) then make sure you put a `(display: \"ConversationExit\")` macro in there somewhere. Also, this doesn't need to contain an entry for every single thing in the knowledge datamap. If you ask an NPC about something that they don't know about, they'll display something from the \"iDontKnow\" entry instead. \nNEW CHANGE HERE**********************\nIf you want a passage-response to display ONLY itself and not the interjection or options underneath, you're advised to add this line (for example if you want the passage to lead OUT of the conversation and you don't want a mid-page link with some irrelevant stuff under it:\n(set: $displayInterjections to false)\\\nSee jailerLedgerResponse for example usage.\n*********************************\n\nopinions - datamap of numbers - This contains a list of numbers that tell you how the patience value should change in response to what you ask them about. So, everything in the 'responses' section should also be represented here. In the tutorial conversation, the woman likes talking about the Skull and the Children's Song, but hates talking about the Arbiters. \n\nattitudes - datamap of strings - This contains a bunch of flavourtext that indicates how the person feels at a given moment (attitudes in the sense of 'she struck a diffident attitude' - not very well-named probably). They are divided into warm1, warm2, cool1, cool2, cold1, cold2.\n\ninterjections - array of passage names - I wanted the conversations to be a bit more organic than just 'ask them lots of questions until they say go away' so this was my solution to that problem. Each character can have any number of passages (must be at least one) that get displayed after they answer your question. For the Traveller's Friend these are TFBrushOff, TFQuestions and TFCoughs. These let the characters talk about something they want to talk about, by asking you questions or whatever. The brushoff one is just some flavourtext but the other two conversations affect the Friend's patience with you and also offer some insight into her character. The nice thing about this way of arranging the conversations is we can have little mini-flowchart-trees that let the dialogue go off in a direction. The only consideration here is that each branch of conversation needs to end with (display: \"ConversationOptions\") or else the game will get stuck.\n\niDontKnow - array of strings - Just a couple of options for stuff the NPC says if you ask them something they don't know about (can be any length).\n\nplayerExit - string (passage title) - If the player terminates the conversation by saying farewell, what happens? For example, see TFExitPlayer. This passage should either (display:) or else have a link to somewhere on the main story tree. It must also contain (display: \"ConversationExit\").\n\nexit - string (passage title) - The passage that gets displayed if they become impatient with you and end the dialogue. Simillar to above. Example is TFExit. It must also contain (display: \"ConversationExit\") and link back to the main story tree.\n\ntopicsDiscussed - an empty array - Just needs to be there to keep track of what you've said to whom.\n\nspecialPatienceLevel - passage name string - if you want to have the patience of the person set by some special means other than the normal system, include this field and put a passage name in it. The passage named here should set `\"patience\" of $interlocutor` using whatever criteria (such as what clothes you're wearing or how hard you've been working in the mine that day). Can also use it to stack the interjections deck, if you want (see Shad).\n\n2) So by the time you've put all that stuff together, you've pretty much written the NPC. All that remains is to put the section into the main game tree that links into the conversation. To start a conversation, all you do is the following:\n\n`(set: $interlocutor to $friend)\\\n(display: \"ConversationInitialise\")\\\n(display: \"ConversationOptions\")`\n\nThe first bit loads the right datamap into the $interlocutor variable, the second bit sets up some other code that helps it all to hang together, and the third bit displays the initial list of conversation options.\n\nThat's all! Simple.\n\n//Items//\nRemember to make a note of all items in the relevant strings passage. Each item has a passage associated with it (with the same name as the inventory string). That passage contains relevant bits and bobs. The important thing about these is that leaving their page, you want to (goto: (history:)'s 2ndlast) as that'll correspond to wherever you were on the main tree ((history:)'s last would take you to the inventory menu itself, but this should be avoided as it'll mean that any other page you visit from the inventory will send you to the wrong place).\n\nThe inventory is an array of strings, and the $clothing datamap contains slots for various body parts that could have clothes on them. Clothes you're wearing aren't in the inventory because that's conventional. We need an option for removing clothes. When you put a piece of clothing in, it is removed from the inventory and whatever was in its slot is put into the inventory. Each body part is assosciated with a variable that contains a string, such as $feetDescription or $headDescription, and these variables should be updated when you put a piece of clothing on so that the 'How I Look' thing reads accurately. This system isn't ideal (because it won't play well with filth) but I'm loathe to complicate it further at this stage.\n\n//feelings//\nany variable that's a number that stores information about the player, such as $health or $timeindungeon can be exploited for a sliding scale or feelings, as well as making use of the $playerTags section. \n\nIn the InitialiseFeelings passage are arrays containing strings that describe each stage as the variable progresses. It's important that these are in a progressive order, and that the order matches the way the number for the associated value changes (eg. in the $healthfeeling array higher is better, but in the $timeindungeonfeeling array lower is better). the Feelings passage then calls e.g. `$healthfeeling's $health` to show the string that corresponds to the current health variable. Any more variables then simply need to be added to the playerinit, a corresponding array of progressive descriptions added to the FeelingsInit passage, and print: macro added to the Feelings passage.\nNB: for this to work, variables must not go into numbers that couldn't relate to an array length. therefore, $filth can't go below 1, for example (and we'll have to have system t keep health within a certain range that's matched by the array). this is good practice anyway though. \n\nTo make use of playertags, simply use an if:contains inside the Feelings passage\n\n\n//knowledge appender//\n\nThis is for when you want to add a new dimension to some knowledge without replacing the entire category (for example, when you get some more information about something but not enough to warrant creating a whole new entry in that table). The kind of block I was having to write can be seen in Ghosts1, and a sample of this new system can be seen in Ghosts2. This system replaces that horrid mess with something like the following:\n\n`\n(set: $knowledgeCategory to \"history\")\n(set: $knowledgeName to \"what's below\")\n(set: $appendedKnowledge to \"whatever you want added\")\n(set: $newKnowledge to \"whatever you want the entry to say if this is the first part of it\")\n(display: \"KnowledgeAppender\")\n`\n\nThe script thus called first checks if \"what's below\" is already in the knowledge database, and then either appends something new to it or makes a new entry if there isn't one there already.\nNote: currently not working for some reason.\n\n\n//environmental actions//\n\na list in relevant strings of variables that can be true or false. use these when a change in the environment matters, so that changes are recorded. really simple. REMEMBER TO SET HOW YOU WANT A THING TO BE IN THE INITIALISE DUNGEON PASSAGE\n\n//endgame//\n\nAny time you change the $ health value, make sure you account for what happens if $ health drops to 0 (or below). If that leads to a death screen (which should probably be relevant to the environment) make sure the death screen contains the text ENDGAME, so we can update all these passages later with something that takes all the end game screens to the final page of credits, play again etc. Same applies to non-death endgame screens",
      "name": "SYSTEMS!",
      "pid": "65",
      "position": {
        "x": "25",
        "y": "291"
      }
    },
    {
      "text": "This was a fine pair of sandals, once. You wouldn't think so to look at them now.\n\n(link: \"put them on\")[\\\n(set: $inv to it + (a:\"feet\" of $clothing))\\\n(set: $inv to it - (a:\"sandals\"))\n(set: \"feet\" of $clothing to \"sandals\")\\\n(set: $feetDescription to \"Ragged sandals adorn your feet.\")\\\n(goto: (history:)'s 2ndlast)]\n(link: \"done\")[(goto: (history:)'s 2ndlast)]",
      "name": "sandals",
      "pid": "66",
      "position": {
        "x": "66",
        "y": "1151"
      }
    },
    {
      "text": "This robe has seen far better days. The unrelenting sun has turned it pale. Dust falls out of every crease in the fabric.\n\n(link: \"put it on\")[\\\n(set: $inv to it + (a:\"torso\" of $clothing))\\\n(set: $inv to it - (a:\"dusty robe\"))\n(set: \"torso\" of $clothing to \"dusty robe\")\\\n(set: $torsoDescription to \"Your robe is tattered and bleached from months on the road.\")\\\n(goto: (history:)'s 2ndlast)]\n(link: \"done\")[(goto: (history:)'s 2ndlast)]",
      "name": "dusty robe",
      "pid": "67",
      "position": {
        "x": "71",
        "y": "1296"
      }
    },
    {
      "text": "You gathered these seeds carefully from reedbeds and verges and from the dirt beneath the stalls of fruit-sellers during your weeks on the road. There are many different types. If even one in twenty of them grow to maturity, you will never be hungry again.\n\n(link: \"Done\")[(goto: (history:)'s 2ndlast)]",
      "name": "seed-bag",
      "pid": "68",
      "position": {
        "x": "68",
        "y": "1436"
      }
    },
    {
      "text": "This person was once significant to you: In your betrothal, you guaranteed yourself good social standing and full complicity with breeding regulations. Now, the face in the locket is as a stranger. You barely recognise it.\n\n(link: \"close the locket\")[(goto: (history:)'s 2ndlast)]",
      "name": "locket",
      "pid": "69",
      "position": {
        "x": "66",
        "y": "1571"
      }
    },
    {
      "text": "The Traveller's Friend dropped this length of sheet when she left your company. When you hold it close to your face, the smell of tombs is unignorable.\n\n(link: \"use it to cover your head\")[\\\n(set: $inv to it + (a:\"head\" of $clothing))\\\n(set: $inv to it - (a:\"winding sheet\"))\n(set: \"head\" of $clothing to \"winding sheet\")\\\n(set: $headDescription to \"Your face is obscured by a stinking cloth.\")\\\n(goto: (history:)'s 2ndlast)]\n(link: \"done\")[(goto: (history:)'s 2ndlast)]",
      "name": "winding sheet",
      "pid": "70",
      "position": {
        "x": "66",
        "y": "1701"
      }
    },
    {
      "text": "This is a pair of stylish Examples.\n\n(link: \"put them on\")[\\\n(set: $inv to it + (a:\"feet\" of $clothing))\\\n(set: $inv to it - (a:\"example\"))\n(set: \"feet\" of $clothing to \"example\")\\\n(set: $feetDescription to \"Your feet are encased in some nice Examples.\")\\\n(goto: (history:)'s 2ndlast)]\n(link: \"done\")[(goto: (history:)'s 2ndlast)]",
      "name": "example",
      "pid": "71",
      "position": {
        "x": "61",
        "y": "1841"
      }
    },
    {
      "text": "(print: $headDescription) (print: $torsoDescription) (print: $feetDescription) (print: $handsDescription) (if: $playerTags contains \"boundhands\")[Your hands are roughly bound with course rope.] (if: $playerTags contains \"manacles\")[Manacles bind your feet, attached to a length of chain.] (if: $playerTags contains \"shoulderchains\")[Loops of chain go from your neck to your arms, weighing you down but affording you some freedom.]\n\n(link: \"done\")[(goto: (history:)'s last)]",
      "name": "Appearance",
      "pid": "72",
      "position": {
        "x": "1448",
        "y": "708"
      }
    },
    {
      "text": "(print: $healthfeeling's $health)\n(if: $filth>$filthfeeling's length)[(print: $hfilthfeeling's last)](else:)[(print: $filthfeeling's $filth)]\n(if: $timeindungeon>$timeindungeonfeeling's length)[(print: $timeindungeonfeelings's last)](else:)[(print: $timeindungeonfeeling's $timeindungeon)]\n\n(if: $playerTags contains \"drunk\")[I am bouyed by the spirits of the bottle. ]\\\n(if: $playerTags contains \"thirsty\")[I am desperately thirsty. ]\\\n(if: $playerTags contains \"boundhands\")[Ropes chafe my wrists. ]\n\n(link: \"done\")[(goto: (history:)'s last)]",
      "name": "Feelings",
      "pid": "73",
      "position": {
        "x": "1573",
        "y": "708"
      }
    },
    {
      "text": "(set: $healthfeeling to (a: \n\"My exertions have left me near death\",\n\"I am exhausted by my travails\",\n\"I am weary, but can continue\",\n\"I am beginning to feel the strain my endeavours\",\n\"I have energy enough to continue\",\n))\n\n(set: $healthfeeling2 to (a: \n\"You are close to collapse, close to death.\",\n\"Your trials have left you exhausted.\",\n\"Your muscles ache but you have some small strength left.\",\n\"Your hardships are wearing you down, gradually.\",\n\"You have as much strength as you could hope for.\",\n))\n\n(set: $filthfeeling to (a:\n\"I am clean as can be hoped for\",\n\"I should wash soon\",\n\"I dislike being dirty\",\n\"I am filthy and must soon wash away my sins\",\n\"I am distressed by my appearance. I must look like a sewer-dwelling troglodyte\",\n))\n\n(set: $timeindungeonfeeling to (a:\n\"I find this place intriguing\",\n\"My time in this place has begun to change me\",\n\"I feel the atmosphere of this place seep into my bones\",\n\"I can hardly keep the dry death of this place from breaking my spirit\",\n\"I fear I shall soon become another dry corpse, trapped in this frightful charnal-house for all eternity\",\n))\n\n(set: $healthlosstexts to (a:\n\"You don't feel good\",\n\"You feel like you might be sick\",\n\"You feel the life ebbing from you\",\n\"Your body shakes with weakness\",))\n\n\n(goto: \"InitialiseGhosts\")",
      "name": "InitialiseFeelings",
      "pid": "74",
      "position": {
        "x": "316",
        "y": "396"
      }
    },
    {
      "text": "(if: $playerTags contains \"drunk\")[(set: $playerTags to it - (a:\"drunk\"))(set: $playerTags to it+(a:\"thirsty\"))]\n(set: $tallymarks to 0)\n(set: \"places\" of $knowledge to it + (datamap: \"the cell\", \"A stinking room where you awoke. The walls are scored with tally-marks.\"))\n(set: $songStorylet to false)\n(goto: \"Entrance1\")\n\n///when going through places, a silent passage to change tags and variables is necessary otherwise they change when you go back to a passage from the inventory passage///",
      "name": "Entrance0",
      "pid": "75",
      "position": {
        "x": "1101",
        "y": "2315"
      }
    },
    {
      "text": "(if: not ((history:)'s (range:1,((history:)'s length-1)) contains \"Entrance2\"))[By the time you've realised where you are, and checked yourself and your possessions, the icy water has stopped. The last faint traces of moisture in the air offer scant relief against the dry and acrid smell of the cell. The straw you're lying on has its own musty animal odour that doesn't help much either. Or is it a human odour? Perhaps you aren't the first to be trapped in this place.](else:)[The straw still reeks. The walls are still oppressive.]\n\nThe studded wooden door opposite you has a small barred window. The black, domed outline of a balding human head blocks the wan light. \n\n[[investigate the straw->Entrance2a]]\n[[investigate the cell->Entrance2b]]\n[[approach the door->Entrance3]]\n(if: not ($playerTags contains \"released\"))[\\\n(if: $tallymarks>0)[[[make a tally mark in the cell wall->Entrance2d]]\n]\\\n(if: ($playerTags contains \"noisy\" or $playerTags contains \"impetuous\") and $songStorylet is false)[[[sing a song|Entrance5]]\n]]\\\n(else:)[(goto:\"Entrance2Alt\")\n]\\\n\n(display: \"GenericActions\")",
      "links": [
        {
          "name": "investigate the straw",
          "link": "Entrance2a",
          "pid": "77"
        },
        {
          "name": "investigate the cell",
          "link": "Entrance2b",
          "pid": "78"
        },
        {
          "name": "approach the door",
          "link": "Entrance3",
          "pid": "79"
        },
        {
          "name": "[make a tally mark in the cell wall",
          "link": "Entrance2d",
          "pid": "94"
        },
        {
          "name": "[sing a song|Entrance5",
          "link": "[sing a song|Entrance5"
        }
      ],
      "name": "Entrance2",
      "pid": "76",
      "position": {
        "x": "1485",
        "y": "2343"
      }
    },
    {
      "text": "(if: $playerTags contains \"boundhands\")[You make an attempt to rummage through the straw, but it's too difficult with your hands tied like this. The smell of human sweat and fear that emanates from the disturbed bedding is palpable.]\n(else-if: ($inv contains \"bone brooch\") is false)[You scrabble through the bedding, desperate for any sign of another life. A small brooch, carved from bone, drops from a dry and musty handful of straw. (set: $broochonfloor to true)]\n(else:)[You dig through the straw, but now you find nothing but disappointment]\n\n{\n(if: $broochonfloor is true)[\n(link: \"pick up the brooch\")[You pick it up(set: $broochonfloor to false)(set: $inv to it+(a:\"bone brooch\"))]\n]}\n[[sit back|Entrance2]]",
      "links": [
        {
          "name": "sit back|Entrance2",
          "link": "sit back|Entrance2"
        }
      ],
      "name": "Entrance2a",
      "pid": "77",
      "position": {
        "x": "1643",
        "y": "2023"
      }
    },
    {
      "text": "The floor of the cell is dry and dusty, with round spots where the water splashed into the dirt. Where did that water come from?\n\nNB THIS IS THE PANEL TO PUT ANOTHER ESCAPE OPTION IN\n\nThe walls of the cell bare the signs of a long and desperate occupation. Or, a series of short ones. In several places, scratch marks make a tally, but what are they counting? Days? Hours? Meals? A red-rust stain in each groove of one set of tallies looks like blood. A poor wretch, marking their time with the tarnish of their humanity. \n\nNone of the tally marks reach above six. \n\n[[Make a tally mark in the cell wall->Entrance2d]]\n[[sit back down|Entrance2]]",
      "links": [
        {
          "name": "Make a tally mark in the cell wall",
          "link": "Entrance2d",
          "pid": "94"
        },
        {
          "name": "sit back down|Entrance2",
          "link": "sit back down|Entrance2"
        }
      ],
      "name": "Entrance2b",
      "pid": "78",
      "position": {
        "x": "1288",
        "y": "2676"
      }
    },
    {
      "text": "As you approach the door, you can hear the laboured breathing of a tired man. Perhaps he has spent too long in this place.\n\n(set: $interlocutor to $jailer)\\\n(display: \"ConversationInitialise\")\\\n(display: \"ConversationOptions\")\n(if: $playerTags contains \"released\")[[[nothing keeps you here|Hallway 1]]]",
      "links": [
        {
          "name": "[nothing keeps you here|Hallway 1",
          "link": "[nothing keeps you here|Hallway 1"
        }
      ],
      "name": "Entrance3",
      "pid": "79",
      "position": {
        "x": "1951",
        "y": "2656"
      }
    },
    {
      "text": "The brooch is carved from a single piece of bone. The round face has the image of two quills, crossed over a single scroll. On the other side, a spar of bone juts out and tapers to a point. \n(if: $playerJourney is \"wedding\")[You recognise it as a wedding gift, worn by a woman betrothed. Who was held had lain on the straw before you? (set: \"people\" of $knowledge to it+(datamap: \"the betrothed woman\", \"Someone has lost their engagement brooch when they lay in the straw in the cell. Perhaps I should return it\"))]\n(else:)[I wonder who it could have belonged to?]\n\n(link: \"done\")[(goto: (history:)'s 2ndlast)]",
      "name": "bone brooch",
      "pid": "80",
      "position": {
        "x": "66",
        "y": "1976"
      }
    },
    {
      "text": "'Listen sunshine, I didn't have my name spoken at the Birth Ceremony yesterday so don't treat me like I did. Every one of you hand-scrawling outsiders comes in here pretending you were at the Cranial Temple by accident, and of course you don't know about the hidebound ledger, and I won't fall for it. Not again, at any rate.'\\\n\\\n(set: $knowledge's (\"history\") to it + (datamap: \"the ledger\", \"the jailer mentioned this, but I don't know what it is.\"))",
      "name": "jailerSkullResponse",
      "pid": "81",
      "position": {
        "x": "205",
        "y": "2931"
      }
    },
    {
      "text": "'Oh. You really don't know, do you? Well here's a sight for my sore and fading eyes. A true-to-life accidental captive. Let's see what we can do here.' (set: $displayInterjections to false)\n\n(link-goto: \"A rusty key scrapes in the lock\", \"JExitPlayer\")",
      "name": "jailerLedgerResponse",
      "pid": "82",
      "position": {
        "x": "348",
        "y": "2931"
      }
    },
    {
      "text": "The cell that was yours is one of several, clustered together behind a high partition of weathered sandstone. The echoes of your footsteps reveal this area to be part of a much larger room. The jail cells are part of the original construction, but the architecture has been contrived to render them invisible from the main chamber. \n\nNear the cells, some stones have subsided under the weight of eons to produce a crack, just wide enough for a person to contort between. (if: $ropeinhallway is true)[A rope lolls out of the shadows like the tongue of an idle beast.\\]\n(if: $playerTags contains \"released\")[\n\nThe jailer is nowhere to be seen.\n\n[[follow the rope into the wall->hallway 2]]]\n(else:)[\n(link:\"wait for the jailer to fall asleep, then sneak past him to the crack in the wall\")[(set: $timeindungeon to it + 1)(goto:\"hallway 2\")]]\n[[step into the airy chamber->hallway 3]]\n\n(display: \"GenericActions\")",
      "links": [
        {
          "name": "follow the rope into the wall",
          "link": "hallway 2",
          "pid": "87"
        },
        {
          "name": "step into the airy chamber",
          "link": "hallway 3",
          "pid": "88"
        }
      ],
      "name": "Hallway 1",
      "pid": "83",
      "position": {
        "x": "2285",
        "y": "2630"
      }
    },
    {
      "text": "The jailer bangs against the door.\n\n'That's enough out of you.'\n\n(display: \"ConversationExit\")\\\n(if: $playerTags contains \"released\")[(display: \"Hallway 1\")]\\\n(else:)[(display: \"Entrance2c\")]",
      "name": "JExit",
      "pid": "84",
      "position": {
        "x": "200",
        "y": "3085"
      }
    },
    {
      "text": "The door swings open and the jailer stands aside. \n\n'No,' he says, 'I'll not have another like you on my conscience. I will tell them that you hanged yourself, and that I sent your body down the corpse chute. But know this: There's little succour here. I release you only into a larger cell. You'll not leave here. No-one does. Now go, and quick, before I regret my decision. I'll speak no more to you. By scrip they'd have my tongue if they heard such talk from me.'\n\nHe pauses.\n\n'Head for somewhere high up,' he said. 'The pit crew seldom trouble to go up there. Do not get comfortable. I'm not giving you your freedom. I doubt you'll live out the week in either case.'\n\nHe spits on the ground.\n\n(display: \"ConversationExit\")\\\n(set: $playerTags to it + (a: \"released\"))\\\n(display: \"Hallway 1\")",
      "name": "JExitPlayer",
      "pid": "85",
      "position": {
        "x": "359",
        "y": "3086"
      }
    },
    {
      "text": "(set: $timeindungeon to it+1)Time passes. The jail cell is cold and dank. Water condenses on the wall as the evening draws in, and you sip a little. The jailer shoves a heel of mossy bread through the bars. You eat it.\n\n[[nothing happens|Entrance2]]",
      "links": [
        {
          "name": "nothing happens|Entrance2",
          "link": "nothing happens|Entrance2"
        }
      ],
      "name": "Entrance2c",
      "pid": "86",
      "position": {
        "x": "1686",
        "y": "2670"
      }
    },
    {
      "text": "(if: $playerTags contains \"released\")[The jailer raises an eye as you squeeze between the large blocks, but says nothing.]\nThe passage ahead is dark and narrow. In the distance you can hear an echoing noise. The sound of voices?\n\n[[push into darkness->hallway 2a]]\n[[turn back->Hallway 1]]\n\n",
      "links": [
        {
          "name": "push into darkness",
          "link": "hallway 2a",
          "pid": "208"
        },
        {
          "name": "turn back",
          "link": "Hallway 1",
          "pid": "83"
        }
      ],
      "name": "hallway 2",
      "pid": "87",
      "position": {
        "x": "2576",
        "y": "2740"
      }
    },
    {
      "text": "A smell of dusty incense is baked into the stones of this vast atrium. Light comes down in narrow shafts through small windows high overhead. The walls are tawny sandstone. The layout is regulation, orderly. The room is bisected by a row of polished lecterns, behind which are a great many small doors, most of which have collapsed. A large doorway at the opposite end of the room has been assiduously sealed with large rocks, and something is painted on to them.\n\nThe cells are in a corner behind you, concealed from view and yet near-at-hand.\n\n[[examine the lecterns|Hallway3a]]\n[[investigate the sealed door|Hallway3b]]\n\n[[through the small doors|Hallway5]]\n[[a partition conceals the cells|Hallway 1]]\n\n(display: \"GenericActions\")",
      "links": [
        {
          "name": "examine the lecterns|Hallway3a",
          "link": "examine the lecterns|Hallway3a"
        },
        {
          "name": "investigate the sealed door|Hallway3b",
          "link": "investigate the sealed door|Hallway3b"
        },
        {
          "name": "through the small doors|Hallway5",
          "link": "through the small doors|Hallway5"
        },
        {
          "name": "a partition conceals the cells|Hallway 1",
          "link": "a partition conceals the cells|Hallway 1"
        }
      ],
      "name": "hallway 3",
      "pid": "88",
      "position": {
        "x": "2510",
        "y": "2133"
      }
    },
    {
      "text": "The jailer's eyelids droop over his eyes as he considers you for a moment.\n\n'I'll tell you what. Waste my time and tell me why you're here. I might be a little more disposed to  treat you favourably if you did.'\n\n[['I'm afraid I'd rather not'->JQuestionA]]\n[['If it will pass the time'->JQuestion2]]",
      "links": [
        {
          "name": "'I'm afraid I'd rather not'",
          "link": "JQuestionA",
          "pid": "90"
        },
        {
          "name": "'If it will pass the time'",
          "link": "JQuestion2",
          "pid": "91"
        }
      ],
      "name": "JQuestion",
      "pid": "89",
      "position": {
        "x": "146",
        "y": "3233"
      }
    },
    {
      "text": "(set: $patience to it - 1)'Useless runt! Ah well, so much the better I suppose really. Not knowing makes it easier keeping you here, after all.'\n\n(display: \"ConversationOptions\")",
      "name": "JQuestionA",
      "pid": "90",
      "position": {
        "x": "88",
        "y": "3380"
      }
    },
    {
      "text": "The jailer eyes you with some interest.\n\n(if: $playerJourney is \"wedding\")[[[My friends are to be betrothed, some distance from here->JQuestion2A]] ]\n(if: $playerJourney is \"exile\")[[[The country is still bad past the unmarked gate. I have travelled some miles in search of a fresh start->JQuestion2A]] ]\n(if: $playerJourney is \"census\")[[[The census has been called, and I must make my way to my Registered birth-town->JQuestion2B]] ]",
      "links": [
        {
          "name": "[My friends are to be betrothed, some distance from here",
          "link": "JQuestion2A",
          "pid": "92"
        },
        {
          "name": "[The country is still bad past the unmarked gate. I have travelled some miles in search of a fresh start",
          "link": "JQuestion2A",
          "pid": "92"
        },
        {
          "name": "[The census has been called, and I must make my way to my Registered birth-town",
          "link": "JQuestion2B",
          "pid": "101"
        }
      ],
      "name": "JQuestion2",
      "pid": "91",
      "position": {
        "x": "238",
        "y": "3380"
      }
    },
    {
      "text": "(set: \"patience\" of $jailer to it+1)\n\n'What a boring life you lead, and the world outside has changed little. Still, the time passes and we all become closer to death with a story like that, eh?'\n\n(display: \"ConversationOptions\")",
      "name": "JQuestion2A",
      "pid": "92",
      "position": {
        "x": "286",
        "y": "3530"
      }
    },
    {
      "text": "'Your yapping gums wear thin my patience. Is there anything else?'\n\n(display: \"ConversationOptions\")",
      "name": "JBrushOff",
      "pid": "93",
      "position": {
        "x": "295",
        "y": "3230"
      }
    },
    {
      "text": "(set: $tallymarks to it+1)\nYour fingernail rasps across the dry stone, and you repeat the motion until the blood draws from underneath.\n\n\n(if:$tallymarks<5)[\nThere are $tallymarks marks in the wall, in the spot you have chosen. A hopeless reminder of your captivity.\n\n[[Try to sleep|Entrance2c]]\n]\n\n(else:)[As you forlornly blacken your latest furrow with blood and dirt, you hear the scraping of the cell door. You glimpse a gaunt face you don't recognise, before a hood is thrust over your face. \n\n(link-goto: \"the jailer laughs as you are dragged away\", \"DescentToPit\")]\n",
      "links": [
        {
          "name": "Try to sleep|Entrance2c",
          "link": "Try to sleep|Entrance2c"
        }
      ],
      "name": "Entrance2d",
      "pid": "94",
      "position": {
        "x": "1488",
        "y": "2761"
      }
    },
    {
      "text": "///NB you can get here straight from the cell///\n\n--Text here relating to the way the Pit looks if you arrive on foot from elsewhere (toiling slaves down below, or if you've had the revolution then it's deserted).\n\n\n(if: $playerTags contains \"unchained\" and $playerTags contains \"revolution\")[CASE: Croach is dead, Shad is here, the Pit is open to you. People mill about, unsure what to do.]\\\n(if: $playerTags contains \"unchained\")[CASE: Croach is alive, so is Shad, you've been allowed out to do Croach business. Shad probably inacessable to you at this point (would resent you in any case).]\\\n(else:)[Neither thing has happened, and you've come here on foot by process of exploration. Possibility of getting caught.{\n(if: not (\"history\" of $knowledge contains \"skull burial site\"))[\n(set: $knowledgeCategory to \"history\")\n(set: $knowledgeName to \"skull burial site\")\n(set: $appendedKnowledge to \"From where they're digging, it seems like the Pit Crew are working on this site.\")\n(set: $newKnowledge to \"The area under the Skull where the Pit Crew have made their operation is rich with skulls. Strangely, no other bones seem to be down there. How did they get down there? What forgotten people did they belong to?\")\n(display: \"KnowledgeAppender\")]\n}\n]\n\nRelevant playerTags:\nunchained //for if you've escaped the chain gang//\nrevolution //for if Croach has been overthrown//\n\nSO: if you're here but without the unchained or revolution tags, that means you've arrived at the pit on foot from some other bit of the skull and there should be appropriate hazard for being here.\n\nIf you're here unchained but without revolution, that means you've been promoted to Pit Crew and you've done their maggot mission (chance to tell them they're digging in the wrong place and reach the ledger) NB Clue might be to do with burial places for specific body parts (you're always digging up skulls, but the ledger is beneath the place where pelvises were buried)\n\nIf you're here unchained and with the revolution tag, that means the captors have been overthrown (check Shad's health to know if Shad is here or not)\n\n\n\n[[Depths1]] ",
      "links": [
        {
          "name": "Depths1",
          "link": "Depths1",
          "pid": "113"
        }
      ],
      "name": "ThePit1",
      "pid": "95",
      "position": {
        "x": "3976",
        "y": "3756"
      }
    },
    {
      "text": "The glass is cloudy with imperfections. The stopper is gone. It contains nothing but the acid reek of wine like piss.\n\n(link: \"Smash it\")[(set: $inv to it - (a: \"empty wine bottle\"))(set: $inv to it + (a:\"shard of green glass\"))(goto: (history:)'s 2ndlast)]\n(link: \"Done\")[(goto: (history:)'s 2ndlast)]",
      "name": "empty wine bottle",
      "pid": "96",
      "position": {
        "x": "63",
        "y": "2101"
      }
    },
    {
      "text": "The Jailer rubs his leather skullcap. 'You wonder after my manner,' sneers the Jailer. 'Your look betrays you. You ask yourself 'whatever have I done to this man, to deserve such short treatement'. Well, let me ask you - where do you think I'll lay my head tonight, hm?'\n\n[['somewhere softer than this hole, I've no doubt'|JSneer1]]\n[['somewhere foul cranny near at hand'|JSneer2]]",
      "links": [
        {
          "name": "'somewhere softer than this hole, I've no doubt'|JSneer1",
          "link": "'somewhere softer than this hole, I've no doubt'|JSneer1"
        },
        {
          "name": "'somewhere foul cranny near at hand'|JSneer2",
          "link": "'somewhere foul cranny near at hand'|JSneer2"
        }
      ],
      "name": "JSneer",
      "pid": "97",
      "position": {
        "x": "430",
        "y": "3238"
      }
    },
    {
      "text": "(set: $patience to it - 2)'No,' he says. 'You are wrong, loathesomely wrong. I will lodge here tonight, scant meters from your reeking accomodation.I do not relish the charge. Whenever a fool such as you happens to fall into our compass, I must pass five days away from all the comforts of my station, until they come for you. And for this disruption, I blame you.'\n\n(display: \"ConversationOptions\")",
      "name": "JSneer1",
      "pid": "98",
      "position": {
        "x": "430",
        "y": "3390"
      }
    },
    {
      "text": "'Yes,' he says, 'and here I'll stay, until they come for you. The lot of the jailer. It's a pile of shit. I'm as much a prisoner of these bars as you, although I'm on the airier side. Oh, but we're all prisoners up here in the skull in any case. None can leave and live.' His lip curls. (set: $patience to it +1)\n\n(display: \"ConversationOptions\")",
      "name": "JSneer2",
      "pid": "99",
      "position": {
        "x": "580",
        "y": "3390"
      }
    },
    {
      "text": "A large piece of curved green glass, wickedly sharp.\n\n(if: (history:)'s 2ndlast is \"hallway 3\" or (history:)'s 2ndlast is \"Hallway3a\" or (history:)'s 2ndlast is \"Hallway3b\")[(link: \"peer through the glass\")[(goto: \"Hallway5a\")]\n\n](else:)[The light glints dimly off the shard's jagged edge.\n\n](if: $playerTags contains \"boundhands\")[(link: \"cut your bonds\")[(set: $playerTags to it - (a:\"boundhands\"))(goto: (history:)'s 2ndlast)]]\n(link: \"Done\")[(goto: (history:)'s 2ndlast)]",
      "name": "shard of green glass",
      "pid": "100",
      "position": {
        "x": "66",
        "y": "2228"
      }
    },
    {
      "text": "(set: \"patience\" of $jailer to it+1)'Ha!' says the jailer. 'Displeased them, did you? What was your crime, so heinous that you were sent a-wandering? Hm? Wore the wrong coloured hat on festival day? Lost a receipt for a bread roll? Hm? Forgot a detail on some symbol on a scrap of vellum? Such stuff is smothering to life. Me, I've spent the last fifty years inside this same foul citadel, with maggots and slavers for neighbours, but which of us lived more freely? Hm?;\n\n(display: \"ConversationOptions\")",
      "name": "JQuestion2B",
      "pid": "101",
      "position": {
        "x": "148",
        "y": "3533"
      }
    },
    {
      "text": "Devcon: (link:\"display\")[(display: \"Devcon\")]\n\nInventory: (print: $inv)\n\nPlayertags: (print: $playerTags)\n\nHealth: (print: $health)\n\nFilth: $filth\n\nTime in dungeon: $timeindungeon\n\nClothing: (print: $clothing)\n\n\nGeneric actions: (link: \"show\")[(display:\"GenericActions\")]\n\nInterolcutor: (print: $interlocutor)\n",
      "name": "log",
      "pid": "102",
      "position": {
        "x": "30",
        "y": "548"
      }
    },
    {
      "text": "- a woman lives up here\n- she messes with the religion in the Vaults by yelling stuff down at them through this tall well-like opening\n- huge birds circle outside that carry you off somewhere if you try to climb down and out\n- some process lets you escape but before you can take it you hear about the ledger and what it does so decision to leave is more interesting (perhaps you are given a task involving making it all the way across the dungeon in a certain number of days?)\n\n\ndragon-ish thing with stag beetle head\nit brings her scraps\nin return she picks parasites off it (bloodmites)\n\nledge to jump off (if you have her favour substantially, it will carry you down)\nBUT she always lies to people\n\n\n[[Skull1]]\n[[Chute1]]\n[[Vaults1]]",
      "links": [
        {
          "name": "Skull1",
          "link": "Skull1",
          "pid": "104"
        },
        {
          "name": "Chute1",
          "link": "Chute1",
          "pid": "105"
        },
        {
          "name": "Vaults1",
          "link": "Vaults1",
          "pid": "106"
        }
      ],
      "name": "Rooftop1",
      "pid": "103",
      "position": {
        "x": "3563",
        "y": "213"
      }
    },
    {
      "text": "[[Chute1]] \n\nSomething in this area should be the ear-bones (maybe the anvil is actually being used as an anvil!)\n\n- whispering keepers live in its ears\n- they know a way to leave but before you can take it you hear about the ledger and what it does so decision to leave is more interesting\n- The person up here won't want to talk to you unless you're clean",
      "links": [
        {
          "name": "Chute1",
          "link": "Chute1",
          "pid": "105"
        }
      ],
      "name": "Skull1",
      "pid": "104",
      "position": {
        "x": "4895",
        "y": "313"
      }
    },
    {
      "text": "- inside the spinal coloumn, takes you down past the vaults (which are between the ribs, partially)\n\n- can abseil down on rope and arrive who-knows-where\n\n- can get stuff from a bird's nest on a narrow ledge (push-your-luck)\n\n[[Underbelly1]]",
      "links": [
        {
          "name": "Underbelly1",
          "link": "Underbelly1",
          "pid": "110"
        }
      ],
      "name": "Chute1",
      "pid": "105",
      "position": {
        "x": "4998",
        "y": "1060"
      }
    },
    {
      "text": "- in sections that are below ground level, huge lateral arches of bones turn out to be ribs, commensurate in size with the skull above\n- can see down into the chest cavity from places: mostly hollow, heart dangles in centre, pit visible way down below (where diaphragm would be)\n- older than library and entrance hall\n- darker stone, not local stone\n- murals on walls (cataclysms, ledgers)\n- some kind of arena, where people fought with blindfolds\n- some sort of organised religion happens somewhere here, tolerated by pit crew, left to own devices\n\n[[Underbelly1]] \n[[Heart1]]",
      "links": [
        {
          "name": "Underbelly1",
          "link": "Underbelly1",
          "pid": "110"
        },
        {
          "name": "Heart1",
          "link": "Heart1",
          "pid": "111"
        }
      ],
      "name": "Vaults1",
      "pid": "106",
      "position": {
        "x": "2328",
        "y": "980"
      }
    },
    {
      "text": "- full of rot\n- books mostly ruined\n- very tall, lit from above\n- one wall is skull-exterior\n\n[[UpperLibrary1]]\n[[Chute1]] \n[[Underbelly1]] ",
      "links": [
        {
          "name": "UpperLibrary1",
          "link": "UpperLibrary1",
          "pid": "109"
        },
        {
          "name": "Chute1",
          "link": "Chute1",
          "pid": "105"
        },
        {
          "name": "Underbelly1",
          "link": "Underbelly1",
          "pid": "110"
        }
      ],
      "name": "LowerLibrary1",
      "pid": "107",
      "position": {
        "x": "3998",
        "y": "1881"
      }
    },
    {
      "text": "(if:(history:)'s last is \"Hallway-Middens\")[The latch on the rotting wooden door clanks uselessly as the door swings open]\n\nAhead of you the passage fractures into several alleys, seperated by shards of a jagged white rock, bone-like in the way it's splintered. The alleys have sound and light spilling into them from alcoves and fissures in the rock, the noise of drink and life. (if: \"places\" of $knowledge contains \"The Middens\")[](else:)[Are there people living in this hellish place?]\n\n(if: $sawbodydrop is false)[A ragged woman stops in front of you, dropping a heavy and foul-smelling sack at your feet. \n\"Mind out the way, stranger!\" she snaps.\n\n(link: \"talk to her\")[(set: $MiddensOldWomanSwitch to \"talk\")(goto: \"MiddensOldWoman\")]\n(link: \"let her pass\")[(set: $MiddensOldWomanSwitch to \"pass\")(goto: \"MiddensOldWoman\")]]\n(else:)[\n[[a quiet and dark alley ->Middens2]] \n[[the noisome passage->Middens3]] \n[[the smell of food->Middens4]] \n[[back through the door->hallway 2d]] \n\n(display: \"GenericActions\")]",
      "links": [
        {
          "name": "a quiet and dark alley ",
          "link": "Middens2",
          "pid": "234"
        },
        {
          "name": "the noisome passage",
          "link": "Middens3",
          "pid": "216"
        },
        {
          "name": "the smell of food",
          "link": "Middens4",
          "pid": "217"
        },
        {
          "name": "back through the door",
          "link": "hallway 2d",
          "pid": "235"
        }
      ],
      "name": "Middens1",
      "pid": "108",
      "position": {
        "x": "3083",
        "y": "2685"
      }
    },
    {
      "text": "- not damp as below\n- books are in strange languages but some stuff can be gleaned\n- large sections have all books torn out\n\n(print: $librarystuff)\n\n(display: \"GenericActions\")\n\n[[investigate the library|libraryoptions]]\n[[Rooftop1]]",
      "links": [
        {
          "name": "investigate the library|libraryoptions",
          "link": "investigate the library|libraryoptions"
        },
        {
          "name": "Rooftop1",
          "link": "Rooftop1",
          "pid": "103"
        }
      ],
      "name": "UpperLibrary1",
      "pid": "109",
      "position": {
        "x": "3733",
        "y": "1000"
      }
    },
    {
      "text": "- the base of the ribcage, below the chest cavity\n- you must avoid wherever the rumbling is coming from\n\n[[Heart1]] \n[[ThePit1]] \n[[Comb1]]",
      "links": [
        {
          "name": "Heart1",
          "link": "Heart1",
          "pid": "111"
        },
        {
          "name": "ThePit1",
          "link": "ThePit1",
          "pid": "95"
        },
        {
          "name": "Comb1",
          "link": "Comb1",
          "pid": "112"
        }
      ],
      "name": "Underbelly1",
      "pid": "110",
      "position": {
        "x": "4266",
        "y": "2800"
      }
    },
    {
      "text": "- a horrific creature lives inside this tattered leather tent-looking thing in the centre of the chest-cavity",
      "name": "Heart1",
      "pid": "111",
      "position": {
        "x": "3671",
        "y": "2003"
      }
    },
    {
      "text": "- a labyrinth of porous rocks with a beast inside who must be avoided in darkness. Nobody in living memory has made it past the beast alive, hence why the pit crew are digging: trying to find a way around it. However, they're digging in the wrong direction.\n\nWhat was once a town square with shopfronts\n[[Depths1]] ",
      "links": [
        {
          "name": "Depths1",
          "link": "Depths1",
          "pid": "113"
        }
      ],
      "name": "Comb1",
      "pid": "112",
      "position": {
        "x": "3571",
        "y": "3715"
      }
    },
    {
      "text": "[[Crucible]] ",
      "links": [
        {
          "name": "Crucible",
          "link": "Crucible",
          "pid": "114"
        }
      ],
      "name": "Depths1",
      "pid": "113",
      "position": {
        "x": "3791",
        "y": "4369"
      }
    },
    {
      "text": "",
      "name": "Crucible",
      "pid": "114",
      "position": {
        "x": "3332",
        "y": "4832"
      }
    },
    {
      "text": "(move: \"stooped figures\" of \"people\" of $knowledge into $trash)\n(set: \"people\" of $knowledge to it + (datamap: \"Pit Crew\", \"Indentured labourers toil below the earth to some unknown purpose, swelling their ranks with isolated travellers such as yourself.\")) 'The Pit Crew. Sorry bastards, really. Even when they let them out to hunt, they leave them in chains so as to make sure that they'd die if they tried to cross the desert. Digging, constantly, the rest of your days, towards who-knows. But you'll find out all you want to know, soon enough. Just (print: 6-$tallmarks) days to go.'",
      "name": "jailerFiguresResponse",
      "pid": "115",
      "position": {
        "x": "478",
        "y": "2935"
      }
    },
    {
      "text": "- damp floor\n- corridors stink\n- evidence of people moving about\n\n[[LowerLibrary1]]",
      "links": [
        {
          "name": "LowerLibrary1",
          "link": "LowerLibrary1",
          "pid": "107"
        }
      ],
      "name": "Hallway4",
      "pid": "116",
      "position": {
        "x": "2652",
        "y": "1856"
      }
    },
    {
      "text": "Notches and scraps of wood indicate that there were once wooden turnstiles between these pedestals, although the wood has long-since been scavenged. You realise that this is a recieving chamber, not unlike the entrance halls of most civic buildings. Visitors would enter through the now-sealed archway and hold discourse with an official at one of these lecterns before being admitted into the building via the small doors behind you. But visitors from where? There is nowhere else for miles around. And to what purpose? (if: (history:)'s (range:1,((history:)'s length-1)) contains \"Hallway3a\")[](else:)[(set: \"the skull\" of \"places\" of $knowledge to (string: \"the skull\" of \"places\" of $knowledge + \" People once travelled here from far away. Some areas have an architecture that recalls the place of your birth.\"))]\n\n[[the room|hallway 3]]",
      "links": [
        {
          "name": "the room|hallway 3",
          "link": "the room|hallway 3"
        }
      ],
      "name": "Hallway3a",
      "pid": "117",
      "position": {
        "x": "2665",
        "y": "2235"
      }
    },
    {
      "text": "(if: not ((datanames: \"history\" of $knowledge) contains \"sign of linked circles\"))[(set: \"history\" of $knowledge to it + (datamap: \"sign of linked circles\", \"A symbol made of several overlapping circles has been rudely painted on a collapsed doorway in the Recieving Hall.\"))]A sign of linked circles, painted on the rockface.\n\n[[the room|hallway 3]]",
      "links": [
        {
          "name": "the room|hallway 3",
          "link": "the room|hallway 3"
        }
      ],
      "name": "Hallway3b",
      "pid": "118",
      "position": {
        "x": "2670",
        "y": "2106"
      }
    },
    {
      "text": "\n\n[[towards the library|Hallway4]]\n[[towards the vaults|Vaults1]]",
      "links": [
        {
          "name": "towards the library|Hallway4",
          "link": "towards the library|Hallway4"
        },
        {
          "name": "towards the vaults|Vaults1",
          "link": "towards the vaults|Vaults1"
        }
      ],
      "name": "Hallway5",
      "pid": "119",
      "position": {
        "x": "2395",
        "y": "1945"
      }
    },
    {
      "text": "(if: $displayInterjections is true)[\\\n\t(display: $interjections's 1st)]",
      "name": "ConversationResponseStage2",
      "pid": "120",
      "position": {
        "x": "1344",
        "y": "480"
      }
    },
    {
      "text": "(if: $totalGhostVisits is $ghostConvos's length)[The ghosts continue to walk in their pensive rows, but there is nothing else for you to learn from them.]\\\n(elseif: $lastGhostVisit is -1)[Through the green glass, you see a parade of spectres, dressed in clothing that recalls the Ceremoninal Attire of your homeland, but with one particular difference: Every one of these people wears a silver mirror prominently on their breast. You've never seen anything quite like it. (set: \"history\" of $knowledge to it + (datamap:\"strange spectral attire\",\"The spectres that you saw through the glass wore clothes very simillar to your own, but with the curious addition of a mirrored amulet.\"))\n\n\t(display: $ghostConvos's 1st)\\\n\t(set: $ghostConvos to (rotated: 1, ...$ghostConvos))\\\n\t(set: $totalGhostVisits to it + 1)\\\n](elseif: $lastGhostVisit < $timeindungeon)[\\\n\t(display: $ghostConvos's 1st)\\\n\t(set: $ghostConvos to (rotated: 1, ...$ghostConvos))\\\n\t(set: $totalGhostVisits to it + 1)\\\n](elseif: $lastGhostVisit is $timeindungeon)[The ghosts look much as they did when last you looked. Time trickles slowly by.]\n\n(set: $lastGhostVisit to $timeindungeon)\\\n[[put the glass away|hallway 3]]",
      "links": [
        {
          "name": "put the glass away|hallway 3",
          "link": "put the glass away|hallway 3"
        }
      ],
      "name": "Hallway5a",
      "pid": "121",
      "position": {
        "x": "2596",
        "y": "2363"
      }
    },
    {
      "text": "(set: $lastGhostVisit to -1)\n(set: $ghostConvos to (a:\"Ghosts1\", \"Ghosts2\", \"Ghosts3\"))\n(set: $ghostConvos to (shuffled: ...$ghostConvos))\n(set: $totalGhostVisits to 0)\n(goto: \"InitialiseSwitches\")",
      "name": "InitialiseGhosts",
      "pid": "122",
      "position": {
        "x": "316",
        "y": "523"
      }
    },
    {
      "text": "As they stand in an unmoving queue before a lectern, one figure turns and speaks to the figure behind it. As you peer through the glass, you make out their words.\n\n'If he survives the arena, then I believe this cycle's applicant will be the one to fell the beast. In my heart, I believe it is possible.'\n\n'You place too much hope in him. The arena's function is to find the strongest among us. Whether this person will be strong enough to contend with the beast is quite another issue. It is illogical to assume that one follows the other.'\n\n'But if not him, then who? For surely it is our right as a people to fell the beast?'\n\nSomeone shushes them. Silence resumes. (if: (datanames: \"places\" of $knowledge) contains \"what's below\")[(set: \"what's below\" of \"places\" of $knowledge to (string: \"what's below\" of \"places\" of $knowledge +  \" At some point in the past, people would compete for the right to contend with it.\"))](else:)[(set: \"places\" of $knowledge to it + (datamap:\"what's below\",\"At some point in the past, people would compete for the right to contend with some foul thing that lives below the structure.\"))]",
      "name": "Ghosts1",
      "pid": "123",
      "position": {
        "x": "598",
        "y": "2402"
      }
    },
    {
      "text": "At the lectern sits a functionary dressed in the flamboyant robes of her caste. She pours thick scorn onto a supplicant who has had his petition notarised by an official of inferior rank. Her lips move:\n\n'This form does not qualify you to access the library. It is  poorly-done. The quality of your penmanship is likewise inferior. You would do well to return to your station and do not trouble us again until you can find a notary not drunk on pigswill.'\n\nThe man departs, shame-faced.{\n(set: $knowledgeCategory to \"places\")\n(set: $knowledgeName to \"the library\")\n(set: $appendedKnowledge to \"The library was somewhere that only certain people were permitted to enter, with correct authorisation.\")\n(set: $newKnowledge to \"There is a library somewhere inside the skull, but the people that built it would only allow particular visitors access to it.\")\n(display: \"KnowledgeAppender\")\n}",
      "name": "Ghosts2",
      "pid": "124",
      "position": {
        "x": "593",
        "y": "2527"
      }
    },
    {
      "text": "In one corner of the room, a man in the reinforced leathers of an Enforcer scans the assembled lines. He wears an expression of concern.\n\nAs they stand in their neat columns, the spectres look suddenly uneasy. The ground below them seems to shake, and they look about, uncertain if they are permitted to flee. Then there is some kind of noise - many of them cover their ears and drop to their knees. Their faces betray intense pain. Abruptly, the room is still again. Some stand up, and one runs towards the now-blocked doorway.\n\n'Faith preserve us,' he says, his words echoing across time. 'It's gone. The city - the palace - everything - it's all disappeared - nothing remains but naked earth -'\n\nThe ghosts begin to panic. The glass clears.{\n(set: $knowledgeCategory to \"places\")\n(set: $knowledgeName to \"the bone-bare plain\")\n(set: $appendedKnowledge to \" Impossible as it seems, there was once a sprawling city atop the plain. It vanished suddenly at some indeterminate point in the past.\")\n(set: $newKnowledge to \"FOOBAR.\")\n(display: \"KnowledgeAppender\")\n}",
      "name": "Ghosts3",
      "pid": "125",
      "position": {
        "x": "597",
        "y": "2655"
      }
    },
    {
      "text": "The figure of the jailer shifts around outside. (set: $songStorylet to true)\n\n'Stop that,' he yells.\n\n[[stop singing|Entrance2]]\n[[keep singing|Entrance5a]]",
      "links": [
        {
          "name": "stop singing|Entrance2",
          "link": "stop singing|Entrance2"
        },
        {
          "name": "keep singing|Entrance5a",
          "link": "keep singing|Entrance5a"
        }
      ],
      "name": "Entrance5",
      "pid": "126",
      "position": {
        "x": "1830",
        "y": "2035"
      }
    },
    {
      "text": "(set: \"patience\" of $jailer to it - 1) 'I said stop that, you maggot filth, or I'll have you!' \n\n[[keep singing|Entrance5b]]\n[[stop singing|Entrance2]]",
      "links": [
        {
          "name": "keep singing|Entrance5b",
          "link": "keep singing|Entrance5b"
        },
        {
          "name": "stop singing|Entrance2",
          "link": "stop singing|Entrance2"
        }
      ],
      "name": "Entrance5a",
      "pid": "127",
      "position": {
        "x": "1830",
        "y": "2261"
      }
    },
    {
      "text": "(set: \"patience\" of $jailer to it - 1)The jailer bangs on the door with something heavy. 'Listen, runt. I'm serious. You stop that right now or you'll regret it.'(if: $playerTags contains \"boundhands\")[ Your hands are still bound. If he's armed, you're not sure if you could overpower him.]\n\n[[keep singing|Entrance5c]]\n[[stop singing|Entrance2]]",
      "links": [
        {
          "name": "keep singing|Entrance5c",
          "link": "keep singing|Entrance5c"
        },
        {
          "name": "stop singing|Entrance2",
          "link": "stop singing|Entrance2"
        }
      ],
      "name": "Entrance5b",
      "pid": "128",
      "position": {
        "x": "1973",
        "y": "2090"
      }
    },
    {
      "text": "The door bursts open. The jailer's low-slung bulk is silhouetted against the opening. (if: $playerTags contains \"boundhands\")['Right,' he says. 'I warned you. I won't have you putting me in danger, caterwauling for all to hear.' He advances. 'Yeah, that's right,' he says. 'Danger. It's a rough establishment, out there in the Cranium. Not wise to make too much noise. Not at all.' He carries a large chunk of stone. It swings towards your head, knocks you to the ground. 'It's no big loss to me,' he says. 'I won't get my extra rations but I won't be eviscerated by some foul creature drawn by your singing, neither. I'll just tell the Boss that you died.' \n\n[[thrash about|Entrance5d]]\n[[plead|Entrance5d]]](else:)[ He is carrying a huge piece of rock in one hand, and a short, wicked knife in the other. The muscles on his arms are rounded and glossy. Light glints off a gold tooth.\n\n[[rush him|Entrance5d]]\n[[cower|Entrance5e]]\n(if: $inv contains \"shard of green glass\" or $inv contains \"empty wine bottle\")[[brandish your glass weapon|Entrance5f]]]",
      "links": [
        {
          "name": "thrash about|Entrance5d",
          "link": "thrash about|Entrance5d"
        },
        {
          "name": "plead|Entrance5d",
          "link": "plead|Entrance5d"
        },
        {
          "name": "rush him|Entrance5d",
          "link": "rush him|Entrance5d"
        },
        {
          "name": "cower|Entrance5e",
          "link": "cower|Entrance5e"
        },
        {
          "name": "brandish your glass weapon|Entrance5f",
          "link": "brandish your glass weapon|Entrance5f"
        }
      ],
      "name": "Entrance5c",
      "pid": "129",
      "position": {
        "x": "1976",
        "y": "2263"
      }
    },
    {
      "text": "He grabs your legs. You thrash about, but he's stronger. He drags you out of the cell, through a crack in a wall. Your shoulders are grazed and bloody as you're pulled down a flight of stairs. He heaves you off the ground, and you feel yourself shoved into a narrow opening in the wall. (set: $playerTags to it + (a: \"released\"))\n\n[[you begin to fall|CorpseChute0]]",
      "links": [
        {
          "name": "you begin to fall|CorpseChute0",
          "link": "you begin to fall|CorpseChute0"
        }
      ],
      "name": "Entrance5d",
      "pid": "130",
      "position": {
        "x": "2150",
        "y": "2228"
      }
    },
    {
      "text": "//if you slide down the chute from the hallway//\n(set: $filth to it + 5)(set: $health to it-1)\nThe chute is dark, narrow, and slick with blood. Unable to manoeuvre, you feel your head crack on a jagged rock on the way down.\n\n{(if: $health<1)[[[You fall into darkness->the body cellar transition]]]\n(else:)[Suddenly, the chute disappears from underneath you and you're falling.]}\n\n[[you land with a thud->the body cellar]]]",
      "links": [
        {
          "name": "[You fall into darkness",
          "link": "the body cellar transition",
          "pid": "283"
        },
        {
          "name": "you land with a thud",
          "link": "the body cellar",
          "pid": "255"
        }
      ],
      "name": "CorpseChute0",
      "pid": "131",
      "position": {
        "x": "2778",
        "y": "3527"
      }
    },
    {
      "text": "'You bloody idiot,' he says, and punches you in the ear. 'Let that be a lesson.'\n\nThe door closes again behind him.\n\n[[back to square one|Entrance2]]",
      "links": [
        {
          "name": "back to square one|Entrance2",
          "link": "back to square one|Entrance2"
        }
      ],
      "name": "Entrance5e",
      "pid": "132",
      "position": {
        "x": "1971",
        "y": "2403"
      }
    },
    {
      "text": "A smile flickers in the corner of his mouth. 'Oh, hark at this one,' he says. 'Gonna stick me with that little fragment, are you? Hm?' he spits. 'Got some fight in him, this one. Perhaps that's why...' but he stops himself, and then lets out a laugh. 'Oh, go on then,' he says. 'My back aches bad enough. You'll only give me more trouble, I can tell. And they don't pay me barely a pittance. I've little loyalty. Get gone.'\n\n(link: \"he releases you\")[(goto:\"JExitPlayer\")]",
      "name": "Entrance5f",
      "pid": "133",
      "position": {
        "x": "2140",
        "y": "2401"
      }
    },
    {
      "text": "talk about a person (clickreplace: \"talk about a person\")[ask about (print: (datanames: \"people\" of $knowledge).join(\"\nask about \")){\n(set: $peopleNumber to (datanames: (\"people\" of $knowledge))'s length)\\\n(set: $i to 0)\\\n[(display: \"PeopleConversationLooper\")]<peopleLoop|\n}]\\\n\ntalk about a place (clickreplace: \"talk about a place\")[ask about (print: (datanames: \"places\" of $knowledge).join(\"\nask about \")){\n(set: $placesNumber to (datanames: (\"places\" of $knowledge))'s length)\\\n(set: $i to 0)\\\n[(display: \"PlacesConversationLooper\")]<placesLoop|\n}]\\\n\ntalk about a thing (clickreplace: \"talk about a thing\")[ask about (print: (datanames: \"history\" of $knowledge).join(\"\nask about \")){\n(set: $historyNumber to (datanames: (\"history\" of $knowledge))'s length)\\\n(set: $i to 0)\\\n[(display: \"HistoryConversationLooper\")]<historyLoop|\n}]\\\n\nlisten (click: \"listen\")[(goto: \"ConversationInterjectionOnly\")]\\\n\n(linkgoto: \"say farewell\",\"playerExit\" of $interlocutor)",
      "name": "ConversationOptions",
      "pid": "134",
      "position": {
        "x": "1216",
        "y": "350"
      }
    },
    {
      "text": "The cell is tiny and squalid. The door hangs open. There is little to maintain your attention.\n\n[[nothing keeps you here|Hallway 1]]",
      "links": [
        {
          "name": "nothing keeps you here|Hallway 1",
          "link": "nothing keeps you here|Hallway 1"
        }
      ],
      "name": "Entrance2Alt",
      "pid": "135",
      "position": {
        "x": "1510",
        "y": "3001"
      }
    },
    {
      "text": "get (link: \"bottle\")[(set: $inv to it + (a:\"empty wine bottle\", \"pipe\", \"box of matches\", \"pouch of herbs\", \"fortune-teller's scrap\"))]\nadvance (link: \"time\")[(set: $timeindungeon to it + 1)]\nskip to (link: \"cell\")[(set:  $playerJourney to \"wedding\")(goto:\"Entrance0\")]\nskip to (link: \"hallway\")[(goto:\"Hallway 1\")]\nskip to (link: \"pub group\")[(set: $inv to it + (a:\"empty wine bottle\",\"rope\",\"bone brooch\",\"locket\"))(goto: \"Pubgroup1\")]\nskip to (link:\"enslavement\")[(set: $timeindungeon to 3)(goto:\"DescentToPit\")]\nskip to (link: \"library\")[(goto: \"UpperLibrary1\")]",
      "name": "Devcon",
      "pid": "136",
      "position": {
        "x": "33",
        "y": "681"
      }
    },
    {
      "text": "{\n(if: (datanames: $knowledgeCategory of $knowledge) contains $knowledgeName)[\n(set: (string:$knowledgeName) of $knowledgeCategory of $knowledge to (string: $knowledgeName of $knowledgeCategory of $knowledge + \" \" + $appendedKnowledge))]\n(else:)[(set: (string:$knowledgeCategory) of $knowledge to it + (datamap: (string:$knowledgeName), (string:$newKnowledge)))]\n}",
      "name": "KnowledgeAppender",
      "pid": "137",
      "position": {
        "x": "1248",
        "y": "25"
      }
    },
    {
      "text": "(set: $dayofarrival to $timeindungeon)\n\n(set: $croachOpinion to 1)\\\n(set: $daylastspoketoCroach to 0)\\\n\\\n(set: $shadOpinion to 2)\\\n(set: $shadHealth to 5)\\\n(set: $daylastspoketoShad to 0)\\\n\\\n(set: $impoundedGoods to $inv)\\\n(set: $inv to (a:))\\\n\\\n(set: $resistanceStarted to false)\\\n(set: $resistance to 0)\\\n\\\n(set: $shadHealthArray to (a:\"Shad looks to be lingering on death's doorstep.\",\"Shad looks like another day of hard work could kill them.\",\"Shad is clearly exhausted.\",\"Shad looks like someone hanging to their last scrap of strength.\",\"Shad looks thin and unsteady.\"))\n\n(set: $shadOpinionArray to (a:\"They mutter obscene words when you are near them.\",\"They refuse to meet your eye.\",\"They appraise you with a flat expression.\",\"They give you a small nod of solidarity.\",\"They look at you like you are their only hope.\"))\n\n(set: $croachOpinionArray to (a:\"Croach glares ar you with undisguised malice.\",\"Croach's sneering gaze singles you out. He leers at you.\",\"Croach doesn't even seem to see you during his morning inspection.\",\"Croach nods when you fall under his gaze.\",\"Croach points his gap-toothed grin at you, his favourite slave.\"))\n\n(set: $slaveryEventCards to (a: \"CroachDrunkDay\", \"MaggotAttack\", \"CroachRandomSearch\", \"SlaveViciousness\", \"QuietEvening\",\"QuietEvening\"))\n(set: $slaveryEventDeck to (shuffled: ...$slaveryEventCards))\n\n(set: $resistanceArray to (a:\"If you were to attempt the uprising now, you would certainly fail. More preparations are needed.\",\"You don't judge that the time is yet ripe for the uprising. Attacking the captors today would be a desperate thing.\",\"Your preparations for the uprising thus far may not prove adequate\",\"The time for the attack is near. There is little more you could do to prepare. One more day might make all the difference, or you could try to attack now.\",\"You have prepared all you can. Weapons are hidden, your manacles are weakened, and you have worked out which guard has the keys. You are ready for the uprising.\"))\n\nWin states: \nGet Croach respect up to five to escape to Maggotzone\nGet Resistance up to five (by getting Shad up) to get in control\nGet Croach respect up high enough to tell him he's digging in the wrong place\n\nUnfavourable exit states:\nYour health gets too low: placed as bait for maggot? Resistance is set back? Given to the Cultists as a sacrifice?\nShad can die, which is a pain, but you're still trapped\n\n(goto:\"Slavery0A\")",
      "name": "Slavery0",
      "pid": "138",
      "position": {
        "x": "4948",
        "y": "3104"
      }
    },
    {
      "text": "(set: $friend to (datamap:))\n\n(set: \"maxpatience\" of $friend to 5)\n(set: \"patience\" of $friend to 5)\n(set: \"timelastmet\" of $friend to 0)\n\n(set: \"responses\" of $friend to (datamap:\n\"Arbiters\",\n\"'Fools, confusing rigour with righteousness. You do well to fear the tyranny of the trivial. They disgust me.'\",\n\n\"Traveller's Friend\",\n\"'I've told you all I will about myself. I am here to help, as is my perogative. If you will travel across this plain, then I will come no further with you. My time with you is over.'\",\n\n\"the bone-bare plain\",\n\"'You asked to come this way, not I. I merely helped. We are here now. It is a bad place, and I will go no further with you.'\",\n\n\"the skull\",\n(display: \"skullResponse\"),\n\n\"the Administration\",\n\"'It would be right for their archives to burn to the ground. Such talk would have my tongue cut out, no doubt. A blood-notary would daub his affadavit with the stump. Ha! They think that this would mean they owned me. You would do well to leave that world behind for good.'\",\n\n\"Children's Song\", \n\"'My own daughter used to sing it, many years ago, before I stopped her.'\",\n\n\"my destination\",\n\"'It is as we have discussed. Across this plain, to the East. There, you can see it even now. At the base of that mountain is a trail used by goatherds. It leads to the Gold Road. From there, the way is simple, although you have a great many miles left to walk.'\",\n))\n\n(set: \"opinions\" of $friend to (datamap:\n\"Arbiters\",-3,\n\"Traveller's Friend\",-2,\n\"the bone-bare plain\",-1,\n\"the skull\",-1,\n\"the Administration\",-4,\n\"Children's Song\", 1,\n\"my destination\", -1\n))\n\n(set: \"attitudes\" of $friend to (datamap:\n\"warm1\",\"She turned to face you, and you see the black pinpricks of her eyes peered out at you from behind scraps of cloth.\",\n\"warm2\",\"She seemed to sag in her saddle for a moment, and looked up at the sky.\",\n\"cool1\",\"Her fingers tightened on the reins.\",\n\"cool2\",\"She shifted around in her saddle, as if suddenly uncomfortable.\",\n\"cold1\",\"Her horse snorted as she dug her feet into its gaunt sides.\",\n\"cold2\",\"She straightened her back, and pointed her horse back the way you came.\",\n))\n\n(set: \"interjections\" of $friend to (a:\"TFQuestion\",\"TFBrushOff\",\"TFCoughs\"))\n\n(set: \"iDontKnow\" of $friend to\n(a:\"'I don't know anything about that.'\", \"'I'm not interested in this.'\"))\n\n(set: \"playerExit\" of $friend to \"TFExitPlayer\")\n\n(set: \"exit\" of $friend to \"TFExit\")\n\n(set: \"topicsDiscussed\" of $friend to (a:))\n",
      "name": "InitialiseFriend",
      "pid": "139",
      "position": {
        "x": "236",
        "y": "3724"
      }
    },
    {
      "text": "(set: $jailer to (datamap:))\n\n(set: \"maxpatience\" of $jailer to 5)\n(set: \"patience\" of $jailer to 5)\n(set: \"timelastmet\" of $jailer to 0)\n\n(set: \"responses\" of $jailer to (datamap:\n\"the cell\",\n\"'This is where we keep fools who think they can sneak into our fortress. Like you. You ain't the first, and you won't be the last.'\",\n\n\"Traveller's Friend\",\n\"'That old bitch lured you in eh? If you didn't already learn your lesson from your current predicament, don't know that what I can say will help you much'\",\n\n\"the skull\",\n(display: \"jailerSkullResponse\"),\n\n\"the ledger\",\n(display: \"jailerLedgerResponse\"),\n\n\"stooped figures\",\n(display: \"jailerFiguresResponse\"),\n\n\"something below\",\n\"'Your labour will be good or you'll find out soon enough, sunshine.'\",\n\n\"The Black Ledger\",\n\"'You deserve to be in this cell, scum'\",\n\n\"Children's Song\",\n\"'It chills my blood to hear those words. You stay silent or I'll have to whip you. She'd hate to be called a maid! I daresay she wouldn't let the child live who sung that song.'\"\n))\n\n(set: \"opinions\" of $jailer to (datamap:\n\"the cell\",-1,\n\"Traveller's Friend\",-1,\n\"the skull\",0,\n\"the ledger\",0,\n\"The Black Ledger\", -5,\n\"Children's Song\", -1,\n\"stooped figures\", 1,\n\"something below\", 1,\n))\n\n(set: \"attitudes\" of $jailer to (datamap:\n\"warm1\",\"The black outline of his face cracks to reveal shards of yellow. A gap-toothed smile.\",\n\"warm2\",\"He wheezes, and exhales slowly but calmly\",\n\"cool1\",\"He breathes in, his features narrowing.\",\n\"cool2\",\"You notice the shape change, as the jailer turns away.\",\n\"cold1\",\"You hear the unmistakable sound of a knife drawing from a sheath.\",\n\"cold2\",\"The jailer turns away, his large frame blocking the light almost completely.\",\n))\n\n(set: \"interjections\" of $jailer to (a:\"JQuestion\",\"JBrushOff\", \"JSneer\"))\n\n(set: \"iDontKnow\" of $jailer to\n(a:\"'I don't know anything about that.'\", \"'I'm not paid to stand here and chat.'\"))\n\n(set: \"playerExit\" of $jailer to \"JExit\")\n\n(set: \"exit\" of $jailer to \"JExit\")\n\n(set: \"topicsDiscussed\" of $jailer to (a:))\n",
      "name": "InitialiseJailer",
      "pid": "140",
      "position": {
        "x": "51",
        "y": "2930"
      }
    },
    {
      "text": "The day begins. (print: $healthfeeling2's $health)\n\n(if: $shadHealth>0)[(print: $shadHealthArray's $shadHealth)  (print: $shadOpinionArray's $shadOpinion)\n\n]\\\n(print: $croachOpinionArray's $croachOpinion)(if: $resistanceStarted)[\n\n(print: $resistanceArray's $resistance)\n\n]\n \nWith no time wasted, a shovel is thrust into your hand. The gang lines up on the rough-dug floor of the pit. The person at the front calls out a chant, and you all begin to dig in unison.\n\n[[put your back into it|slaveryHard]]\n[[work slowly to conserve your strength|slaveryEasy]]\n(if: $shadHealth>0)[[[take some of Shad's burden|slaveryHelp]]]\n(if: $resistanceStarted)[[[hide tools for the resistance|slaveryResistance]]]\n(if: $resistance>3)[[[smash your shackles with a shovel and launch the attack|slaveryUprising]]]\n\n(display: \"GenericActions\")",
      "links": [
        {
          "name": "put your back into it|slaveryHard",
          "link": "put your back into it|slaveryHard"
        },
        {
          "name": "work slowly to conserve your strength|slaveryEasy",
          "link": "work slowly to conserve your strength|slaveryEasy"
        },
        {
          "name": "[take some of Shad's burden|slaveryHelp",
          "link": "[take some of Shad's burden|slaveryHelp"
        },
        {
          "name": "[hide tools for the resistance|slaveryResistance",
          "link": "[hide tools for the resistance|slaveryResistance"
        },
        {
          "name": "[smash your shackles with a shovel and launch the attack|slaveryUprising",
          "link": "[smash your shackles with a shovel and launch the attack|slaveryUprising"
        }
      ],
      "name": "SlaveryDaytime",
      "pid": "141",
      "position": {
        "x": "5239",
        "y": "3952"
      }
    },
    {
      "text": "(if: $shadHealth  is 0)[(set: $shadHealth to -1)(display: \"ShadDeath\")]\\\n(else:)[\\\n(display: $slaveryEventDeck's 1st)\\\n(set: $slaveryEventDeck to (rotated: 1, ...$slaveryEventDeck))]",
      "name": "SlaveryEvent",
      "pid": "142",
      "position": {
        "x": "6106",
        "y": "3943"
      }
    },
    {
      "text": "A small amound of time remains yours, to dispose of how you will.\n\n(if: ($timeindungeon-1 > $daylastspoketoCroach) and (either: true, true, false))[(link:\"approach Croach as he makes his rounds and speak to him\")[(set: $daylastspoketoCroach to $timeindungeon)(goto:\"CroachConv\")]](else:)[Croach does not appear this night, so you have little chance to approach him.]\n\n(if: $shadHealth>0 and ($timeindungeon-1 > $daylastspoketoShad) and (either: true, true, false))[(link:\"talk to Shad\")[(set: $daylastspoketoShad to $timeindungeon)(goto:\"ShadConv\")]](elseif: $shadHealth>0)[Shad seems to be fast asleep.]\n\n(link: \"try to rest\")[(goto: \"SlaveryNightEnd\")]\n\n(if: $resistanceStarted)[(link: \"discreetly weaken your shackles instead of sleeping\")[(set: $health to it - 1)(set: $resistance to it + 1)(goto: \"SlaveryDaytime\")]]{\n\n(if: $health < 1)[(goto:\"SlaveryDeath\")]\n(if: $shadHealth < 5)[(set: $shadHealth to 5)]\n(if: $shadOpinion < 5)[(set: $shadOpinion to 5)]\n(if: $croachOpinion < 5)[(set: $croachOpinion to 5)]}\n\n(display: \"GenericActions\")",
      "name": "SlaveryNight",
      "pid": "143",
      "position": {
        "x": "5438",
        "y": "4710"
      }
    },
    {
      "text": "(set:$health to it - 1)\\\n(set: $shadHealth to it - 1)\\\n(set: $croachOpinion to it + 1)\\\n(set: $filth to it + 2)\\\n\\\n(if: $dayofarrival is $timeindungeon)[(display: \"SkullsInMineDiscovery\")\n\n]\\\n\\\n(either: \"The day wears by with agonising slowness. Blisters form and burst on your hands from the handle of the shovel.\",\"Another gang is charged with operating wheelbarrows and a winching mechanism to clear away the dirt you shovel up. Today, they are barely able to keep pace with you.\", \"You are like a machine, pawing huge clods of dirt out of the ground.\")\n\nThe other miners don't like to see you working so hard, as your exertions raise the standard of the group and make them appear idle by comparison. This puts them in a dangerous position. As such, nobody will speak to you all day. Croach takes notice, however.\n\n(either: \"There is no way to tell the position of the sun down here, so you mark your time by observing how often the lanterns need refilling. Eventually, Croach appears at the lip of the pit, far above you, and yells something indistinct. The chain gang downs tools.\", \"You shovel countless skulls out of the soggy earth. You wonder, for the thousandth time, how the ground came to be so deeply seeded with skulls.\")\n\n[[you collapse, exhausted|SlaveryEvent]]",
      "links": [
        {
          "name": "you collapse, exhausted|SlaveryEvent",
          "link": "you collapse, exhausted|SlaveryEvent"
        }
      ],
      "name": "slaveryHard",
      "pid": "144",
      "position": {
        "x": "5648",
        "y": "3776"
      }
    },
    {
      "text": "(set:$health to it + 1)\\\n(set: $filth to it + 1)\\\n\\\n(if: $dayofarrival is $timeindungeon)[(display: \"SkullsInMineDiscovery\")\n\n]\\\n\\\n(either: \"The others in the chain clearly do not work hard enough for Croach, who beats them savagely at the end of the day as an example to the rest of you. It is unclear how much more of this treatment Shad could survive.\",\"Croach makes occasional appearances and doles out beatings at random, but you avoid the worst of it by seeming to dig harder when he is nearby. He notices the deception, however, when he sees your barrow lying half-empty. He blackens your eye, but it's a small price for a day that doesn't leave your back feeling broken.\",\"You spend the day digging slowly, maintaining a steady pace. The calluses on your hands begin to toughen up. Croach is displeased, however. It's not clear how much more of this pace he'd accept.\") (if: (either: true, false))[Croach has definitely noticed the slowness of your work.(set:$croachOpinion to it - 1)]\n\n[[the call to down tools arrives at last|SlaveryEvent]]",
      "links": [
        {
          "name": "the call to down tools arrives at last|SlaveryEvent",
          "link": "the call to down tools arrives at last|SlaveryEvent"
        }
      ],
      "name": "slaveryEasy",
      "pid": "145",
      "position": {
        "x": "5650",
        "y": "3903"
      }
    },
    {
      "text": "(set:$shadOpinion to it + 1)\\\n(set:$shadHealth to it + 1)\\\n(set: $health to it - 1)\\\n(set: $filth to it + 1)\\\n\\\n(if: $dayofarrival is $timeindungeon)[(display: \"SkullsInMineDiscovery\")\n\n]\\\n(either: \"Shad soon realises what you are doing as you attempt to fill their barrow as well as your own. A look of gratitude crosses their face. Croach is disappointed with your meagre output and makes it known as he knocks you to the ground repeatedly.\",\"Shad can barely carry their shovel, so you spend some time shovelling the area next to them to make it seem as though they've dug farther than they have.\") (if: (either: true, false))[Croach has definitely noticed the slowness of your work.(set:$croachOpinion to it - 1)]\n\n[[evening arrives|SlaveryEvent]]",
      "links": [
        {
          "name": "evening arrives|SlaveryEvent",
          "link": "evening arrives|SlaveryEvent"
        }
      ],
      "name": "slaveryHelp",
      "pid": "146",
      "position": {
        "x": "5655",
        "y": "4035"
      }
    },
    {
      "text": "(set: $shadOpinion to it + 1)\\\n(set: $shadHealth to it - 1)\\\n(set: $filth to it + 1)\\\n\\\n(if: (either: true, true, false))[(set:$resistance to it + 1)(either:\"During your day, you take opportunities to steal anything not locked down and hide these useful objects in the walls of the pit behind loose rocks. A small trowel, a bit of wood, sharp rocks: All these objects can be made into impromptu weapons.\",\"Today, by keeping a close eye on the Pit Crew, you are able to discern which of the guards has the keys to the locks on your chain and at what times the shifts change. There is one guard in particular who is smaller than the others and often does his shift drunk. You could easily overpower him.\",\"Today, your shovel strikes the chain around your ankles more often than it strikes the dirt. You keep yourself up to your knees in mud to conceal the sparks. By the end of the day, the chain is significantly weaker, but so is the blade of the shovel, so you stop before the damage becomes too obvious.\")]\\\n(else:)[(either:\"The Pit Crew seem to be particularly vigilant today, and you don't manage to make any meaningful preparation for fear of drawing attention to the plans already laid.\",\"As you toil, something happens. Two guards notice something glinting in the dirt near where you just stashed the bone shiv you spent all morning discreetly assembling. You didn't hide it well enough. They come so close to discovering it that you dare not hide anything else all day.\",\"Croach spends most of today lurking around in your general vicinity, telling lush tales of drunken exploits in towns you've never heard of. You try to steal some time to work on your plans, but find little opportunity.\")]\n\n(if: (either: true, false))[Croach has definitely noticed the slowness of your work.(set:$croachOpinion to it - 1)]\n\n[[the day passes slowly|SlaveryEvent]]",
      "links": [
        {
          "name": "the day passes slowly|SlaveryEvent",
          "link": "the day passes slowly|SlaveryEvent"
        }
      ],
      "name": "slaveryResistance",
      "pid": "147",
      "position": {
        "x": "5656",
        "y": "4166"
      }
    },
    {
      "text": "This evening, Croach has drunk more than usual, and some trivial thing provokes him into a rage.(set: $daylastspoketoCroach to $timeindungeon-1) Nobody is spared his wrath. The guards eye him fearfully as he stamps about the pit, kicking and frothing at the mouth.\n\n(if: $shadHealth>5)[[[i try to keep Shad safe|CroachDrunkDay1]]\n]\\\n[[i keep out of the way|CroachDrunkDay2]]\n[[i try to calm him down|CroachDrunkDay3]]",
      "links": [
        {
          "name": "[i try to keep Shad safe|CroachDrunkDay1",
          "link": "[i try to keep Shad safe|CroachDrunkDay1"
        },
        {
          "name": "i keep out of the way|CroachDrunkDay2",
          "link": "i keep out of the way|CroachDrunkDay2"
        },
        {
          "name": "i try to calm him down|CroachDrunkDay3",
          "link": "i try to calm him down|CroachDrunkDay3"
        }
      ],
      "name": "CroachDrunkDay",
      "pid": "148",
      "position": {
        "x": "6391",
        "y": "4318"
      }
    },
    {
      "text": "Suddenly, there comes a yelling from the top of the pit. Clods of earth fall from the above, and then a something long and white and wriggling squeezes itself through a narrow gap in the ceiling-stones and drops to the bottom of the pit near you.\n\n'The maggot!' roars Croach. 'The maggot cometh!'\n\nIt rears up, squirming as it is pelted by rocks and stones from the people around you. Mud streaks its translucent skin. A small ring of cruel hooked teeth flex, and it lunges towards one of the Crew. Its chest opens revealing an interior of polyps and fangs and half-digested bodies, and it slams down on this hapless crewman. It lands atop him, thrashes around, and then rears up again. He is gone. It twists about, searching for its next target. You still hold your shovel, but nobody else is still armed.\n{\n(set: $knowledgeCategory to \"people\")\n(set: $knowledgeName to \"the maggot\")\n(set: $appendedKnowledge to \"It attacks the denizens of the Pit periodically. They are powerless to prevent its raids, but would love to see it dead.\")\n(set: $newKnowledge to \"The maggot is a creature of senseless cruelty. It hangs pendulous in the heart of the fortress, making a feast of any denizen who enters its domain. The denizens of the Pit would love to see it dead, but they are powerless to overcome its speed and ferocity.\")\n(display: \"KnowledgeAppender\")\n}[[attack it|MaggotAttackA]]\n[[flee|MaggotAttackB]]",
      "links": [
        {
          "name": "attack it|MaggotAttackA",
          "link": "attack it|MaggotAttackA"
        },
        {
          "name": "flee|MaggotAttackB",
          "link": "flee|MaggotAttackB"
        }
      ],
      "name": "MaggotAttack",
      "pid": "149",
      "position": {
        "x": "6065",
        "y": "5328"
      }
    },
    {
      "text": "Just as you're about to climb the ladder out of the pit, a horn sounds. Croach yells for everybody to stop and lie down. The denizens of the pit obey. He descends the ladder, which bows under his bulk. He sinks up to his shins in filth and grime as he lands.\n\n'Inspection!' he says. 'I shall size thee up, my muddy compatriots.'\n\nHe moves along the chain-bound rows, prodding the supplicant figures before him. (if: $resistanceStarted)[You realise with a start that he's about to put his stick into a patch of mud where you have stashed several sharpened bones wrapped in sackcloth, to use as blades for the uprising. \n\n[[do nothing and hope for the best|CroachRandomSearchA]]\n[[attempt a distraction|CroachRandomSearchB]]\n](else:)[(if:$croachOpinion>3)['And thee!' he says as he stands above you. 'Such busywork! Daily I see thou diggest most arduously, as if thou lovest the cool squelch of mud!'(set: $croachOpinion to it + 1)(set:$shadOpinion to it - 1)](else:)['Thou art a worm like all the rest, and must do better if you're not to perish by my hand or one of my boys. This is no way to gain my preferment.' (if: $playerTags contains \"impetuous\")[As he departs, you make an obscene hand gesture at him. The others in the chain notice, approvingly.(set:$shadOpinion to it + 1)]]]\n\n[[another wretched day comes to an end|SlaveryNight]]\n",
      "links": [
        {
          "name": "do nothing and hope for the best|CroachRandomSearchA",
          "link": "do nothing and hope for the best|CroachRandomSearchA"
        },
        {
          "name": "attempt a distraction|CroachRandomSearchB",
          "link": "attempt a distraction|CroachRandomSearchB"
        },
        {
          "name": "another wretched day comes to an end|SlaveryNight",
          "link": "another wretched day comes to an end|SlaveryNight"
        }
      ],
      "name": "CroachRandomSearch",
      "pid": "150",
      "position": {
        "x": "6450",
        "y": "4750"
      }
    },
    {
      "text": "(if: $croachOpinion>3)[As you rest before the evening bowl of slop is handed round, some members of your gang from further up the chain surround you. 'Croach's little friend,' one of them mutters, 'his special little lad, his plaything.' Suddenly, they are upon you. You resist these pale forms as best you can but you still emerge bloody and stinging.(set: $health to it - 1)(set: $filth to it + 1)](else:)[The other slaves are in a nasty mood tonight, and prowl around, rattling their chains and decrying one another for laziness, avarice, heathen beliefs. They seem to come from all manner of different nations and systems of belief, but here they are united in theirsuffering, and in their spite for the human race.](if: $shadHeath>0)[ Shad keeps their head down throughout.]\n\n[[another wretched day comes to an end|SlaveryNight]]",
      "links": [
        {
          "name": "another wretched day comes to an end|SlaveryNight",
          "link": "another wretched day comes to an end|SlaveryNight"
        }
      ],
      "name": "SlaveViciousness",
      "pid": "151",
      "position": {
        "x": "5646",
        "y": "5465"
      }
    },
    {
      "text": "//check if slavery escaped in case you're talking to Shad afterwards, as their exit page redirects here//\n//THIS IS THE BOUNCEOUT PAGE for if you're promoted//\n\n\n(either: \"You bed down on the chilly floor and look at towards the little square of light that is the window of Croach's shack. You envy him his food and his rich ale, but most of all you envy him the warmth of his fire.\",\"You bed down in a huddle with the other members of the chain gang, careless of personal space and of the reeking smell, seeking only warmth.\",\"You doze fitfully, having dreams of pits and shovelling that you can scarce distinguish from your daily travails. A plague on this accursed place.\", \"Another day comes to its desolate end with you searching for a patch of ground to sleep on devoid of water, filth, or other sleepers.\")\n\n(set: $timeindungeon to it + 1)\n[[get what little sleep you can|SlaveryDaytime]]\n\n(if: $croachOpinion>5)[(goto:\"SlaveryPromotion\")]",
      "links": [
        {
          "name": "get what little sleep you can|SlaveryDaytime",
          "link": "get what little sleep you can|SlaveryDaytime"
        }
      ],
      "name": "SlaveryNightEnd",
      "pid": "152",
      "position": {
        "x": "5038",
        "y": "4705"
      }
    },
    {
      "text": "(set: $Croach to (datamap:))\n\n(set: \"maxpatience\" of $Croach to 5)\n(set: \"patience\" of $Croach to 5)\n(set: \"timelastmet\" of $Croach to 0)\n\n(set: \"responses\" of $Croach to (datamap:\n\"Arbiters\",\n\"'Fools, confusing rigour with righteousness. You do well to fear the tyranny of the trivial. They disgust me.'\",\n))\n\n(set: \"opinions\" of $Croach to (datamap:\n\"Arbiters\",-3,\n\n))\n\n(set: \"attitudes\" of $Croach to (datamap:\n\"warm1\",\"Croach gurgles and looks at you.\",\n\"warm2\",\"He pulls a crust of bread from a pocket and offers it to you.\",\n\"cool1\",\"Croach stares at you down his snout.\",\n\"cool2\",\"Croach eyes you narrowly, before a noise across the floor takes his attention for a moment.\",\n\"cold1\",\"Croach yawns and turns away from you, drinking deeply from a flask.\",\n\"cold2\",\"Croach's eyes droop shut and his head lolls for a moment, before he snaps awake again.\",\n))\n\n(set: \"interjections\" of $Croach to (a:\"CroachVomit\",\"CroachYell\",\"CroachSnort\",\"CroachQuiet\", \"CroachQuiet\"))\n\n(set: \"iDontKnow\" of $Croach to\n(a:))\n\n(set: \"playerExit\" of $Croach to \"CroachExit\")\n\n(set: \"exit\" of $Croach to \"CroachExit\")\n\n(set: \"topicsDiscussed\" of $Croach to (a:))\n\n(set: \"specialPatienceLevel\" of $Croach to \"CroachPatienceSet\")",
      "name": "InitialiseCroach",
      "pid": "153",
      "position": {
        "x": "90",
        "y": "4625"
      }
    },
    {
      "text": "(set: $Shad to (datamap:))\n\n(set: \"maxpatience\" of $Shad to 5)\n(set: \"patience\" of $Shad to 5)\n(set: \"timelastmet\" of $Shad to 0)\n\n(set: \"responses\" of $Shad to (datamap:\n\"Arbiters\",\n\"'I came here trying to escape their scrutiny, but I would give anything now to return to that life.'\",\n\"the Administration\",\n\"'They had such a capacity for cruelty, back in the old country, but the cruelty was of a different sort to this. Distant and indifferent. Here, it seems like every part of life is bent towards the ends of our discomfort.'\",\n\"Traveller's Friend\",\n\"'I too was escorted here by such a person, many years ago. I realise now that her intention must have been malign, but strangely I bare her no ill will.'\",\n\"Pit Crew\",\n\"'Spineless freaks. I despise them too. They have liberty enough - why do they not overpower Croach and leave him to rot?'\",\n\"Croach\",\n\"'I flinch at his every move. Please, I don't want to talk about him now. I spend every day fearful of him. That is horror enough. Let us keep his spectre at bay at night.'\",\n\"Shad\",\n\"'You know what this place does to you? It makes you forget who you are. I used to think a lot about freedom, of escaping from this chain, from this horrid building. Now, a good dream is one where I have a dry bit of sacking to sleep under, and where Croach is placid and not in a rage. Perhaps the world outside has vanished. Perhaps it isn't even there anymore.'\",\n\"the maggot\",\n\"'It lives in a chamber at the heart of the fortress. Sometimes it comes to feed on us. Once, Croach sent some boys to hunt it, but they never returned. I believe he leaves the corpses out for it, too. To placate it. Figures that'll keep it at bay, if it's well fed. I heard the guard talking...'\",\n\"the bone-bare plain\",\n\"'I was travelling North on the Gold Road when I became ill. For fear of contagion, my travelling companions threw off the wagon. For days I lay in the sun, crawling towards a creek that I thought I heard in the distance. I passed out at the edge of the bone-bare plain, and awoke down here.'\",\n\"the skull\",\n\"'The skull is the world, now. No sense thinking about the place outside.'\",\n\"what's below\",\n(display: \"ShadWhatsBelow\"),\n\"skull burial site\",\n\"'What, we spend all day knee-deep in loamy skull-filled earth and you would sully our few hours of rest by recollecting it?'\",\n\"hips burial site\",\n\"'Another pit, somewhere else, just waiting to be dug... It makes no odds to me. The world outside this room, this pit, is as a vapour.'\",\n\"the ledger\",\n(display: \"ShadLedger\"),\n\"location of the Ledger\",\n\"'I don't know why you'd say such a thing. Never, never mention that again. Say not a word to Croach, nor to me neither. Why, if you're wrong, then you'd condemn us to another lifetime's digging. And if you're right, then Croach might get what he wants. And how would you have come by such heretic knowledge? Be silent.'\",\n))\n\n(set: \"opinions\" of $Shad to (datamap:\n\"Arbiters\",-1,\n\"the Administration\",-2,\n\"Traveller's Friend\",-1,\n\"Pit Crew\", -2,\n\"Croach\", -2,\n\"Shad\", 0,\n\"the maggot\", -2,\n\"the bone-bare plain\", -2,\n\"the skull\", -2,\n\"what's below\", -2,\n\"skull burial site\", -3,\n\"hips burial site\", -2,\n\"the ledger\", -2,\n\"location of the Ledger\", -4,\n))\n\n(set: \"attitudes\" of $Shad to (datamap:\n\"warm1\",\"Shad shuffles a little closer to you.\",\n\"warm2\",\"You feel the warmth of Shad's body as they rest against you.\",\n\"cool1\",\"Shad stretches and tries to get comfortable.\",\n\"cool2\",\"They look distracted as you talk.\",\n\"cold1\",\"Shad moves away from you and settles down into the ground.\",\n\"cold2\",\"Shad yawns.\",\n))\n\n(set: \"interjections\" of $Shad to (a:\"ShadApples\", \"ShadQuestions\",\"ShadRumour\", \"ShadQuiet\", \"ShadQuiet\", \"ShadQuiet\"))\n\n(set: \"iDontKnow\" of $Shad to\n(a:\"'You tell me. I've never heard anything about that.'\", \"'What? Sorry, I wasn't listening.'\", \"'Forgive me, I'm very tired. I don't understand what you mean.'\"))\n\n(set: \"playerExit\" of $Shad to \"ShadExit\")\n\n(set: \"exit\" of $Shad to \"ShadExit\")\n\n(set: \"topicsDiscussed\" of $Shad to (a:))\n\n(set: \"specialPatienceLevel\" of $Shad to \"ShadPatienceSet\")",
      "name": "InitialiseShad",
      "pid": "154",
      "position": {
        "x": "100",
        "y": "5245"
      }
    },
    {
      "text": "//NB COPYPASTE THIS SOMEWHERE ELSE, DON'T JUST TYPE YOUR SHIT INTO IT, YOU DIV, OR YOU'LL HAVE TO WRITE THE WHOLE FUCKING THING OUT AGAIN//\n\n(set: $XXX to (datamap:))\n\n(set: \"maxpatience\" of $XXX to 5)\n(set: \"patience\" of $XXX to 5)\n(set: \"timelastmet\" of $XXX to 0)\n\n(set: \"responses\" of $XXX to (datamap:\n\"Arbiters\",\n\"'Fools, confusing rigour with righteousness. You do well to fear the tyranny of the trivial. They disgust me.'\",\n))\n\n(set: \"opinions\" of $XXX to (datamap:\n\"Arbiters\",-3,\n\n))\n\n(set: \"attitudes\" of $XXX to (datamap:\n\"warm1\",\"\",\n\"warm2\",\"\",\n\"cool1\",\"\",\n\"cool2\",\"\",\n\"cold1\",\"\",\n\"cold2\",\"\",\n))\n\n(set: \"interjections\" of $XXX to (a:))\n\n(set: \"iDontKnow\" of $XXX to\n(a:))\n\n(set: \"playerExit\" of $XXX to \"\")\n\n(set: \"exit\" of $XXX to \"\")\n\n(set: \"topicsDiscussed\" of $XXX to (a:))\n\n(set: \"specialPatienceLevel\" of $XXX to \"\") //Delete this if not doing anything unusual with patience.//",
      "name": "Template for conversations",
      "pid": "155",
      "position": {
        "x": "33",
        "y": "813"
      }
    },
    {
      "text": "'I tire of talking to you, little wormling. Scurry off now.'\n\n(set: $daylastspoketoCroach to $timeindungeon)\\\n(display: \"ConversationExit\")\\\n(if: $playerTags contains \"unchained\")[(display: \"ThePit1\")]\n(else:)[(display: \"SlaveryNightEnd\")]",
      "name": "CroachExit",
      "pid": "156",
      "position": {
        "x": "93",
        "y": "4760"
      }
    },
    {
      "text": "'You should get some sleep,' says Shad. 'That's enough talking for today.'\n\n(set: $daylastspoketoShad to $timeindungeon)\n(display: \"ConversationExit\")\\\n(display: \"SlaveryNightEnd\")",
      "name": "ShadExit",
      "pid": "157",
      "position": {
        "x": "100",
        "y": "5370"
      }
    },
    {
      "text": "(set: \"patience\" of $interlocutor to $croachOpinion)\n(if: $croachOpinion > 4)[(set: $interjections to it +(a:\"CroachPromotion\"))]",
      "name": "CroachPatienceSet",
      "pid": "158",
      "position": {
        "x": "236",
        "y": "4624"
      }
    },
    {
      "text": "(set: \"patience\" of $interlocutor to $shadOpinion)\n(if: $shadOpinion > 4)[(set: $interjections to it +(a:\"ShadResistance\"))]",
      "name": "ShadPatienceSet",
      "pid": "159",
      "position": {
        "x": "229",
        "y": "5243"
      }
    },
    {
      "text": "The air is rich with the sound of clinking chains and groaning. The bag is pulled roughly off your head and you stare into the eyes of a face like a pig. Grey whiskers sprout unevenly from his sagging jowls. He reeks of distilled spirits and piss. \n\n'Croach,' he says. 'Thou wilt call me Croach. Thou art property of Croach.' His voice is deep and drawling.\n\nHe swings a greasy paw towards your mouth, and when you flinch someone trips you from behind. You sprawl onto the floor. (if: not($playerTags contains \"boundhands\"))[(set: $playerTags to it + (a:\"boundhands\"))Your hands are bound with coarse hempen rope. ]Manacles are fitted to your feet. Your meagre possessions are taken away from you.\n{\n(set: $knowledgeCategory to \"people\")\n(set: $knowledgeName to \"Croach\")\n(set: $appendedKnowledge to \"Having met him, you can confirm his ill reputation.\")\n(set: $newKnowledge to \"Muscular and swine-faced, Croach is the master of the Pit, commanding the chain-gangs there with lazy cruelty.\")\n(display: \"KnowledgeAppender\")\n}\n[['why have you brought me here?'|Slavery0B]]\n[[say nothing|Slavery0C]]",
      "links": [
        {
          "name": "'why have you brought me here?'|Slavery0B",
          "link": "'why have you brought me here?'|Slavery0B"
        },
        {
          "name": "say nothing|Slavery0C",
          "link": "say nothing|Slavery0C"
        }
      ],
      "name": "Slavery0A",
      "pid": "160",
      "position": {
        "x": "4948",
        "y": "3244"
      }
    },
    {
      "text": "'You know what I miss? Applejack.'\n\n[['what's applejack?'|ShadApplesA]]\n[['trouble me not with the agony of reminiscence.'|ShadAppledB]]",
      "links": [
        {
          "name": "'what's applejack?'|ShadApplesA",
          "link": "'what's applejack?'|ShadApplesA"
        },
        {
          "name": "'trouble me not with the agony of reminiscence.'|ShadAppledB",
          "link": "'trouble me not with the agony of reminiscence.'|ShadAppledB"
        }
      ],
      "name": "ShadApples",
      "pid": "161",
      "position": {
        "x": "107",
        "y": "5552"
      }
    },
    {
      "text": "Shad's face clounds over, briefly, with a look of contentment. 'It's strong liquor. Real strong. Peasants make it where I'm from, upcountry. They take some of the season's cider, any that's too sour to drink or that's spoiled, and they leave it outside in a barrel until the ice forms, which doesn't take long, and every morning they break the ice and pull it out and throw it away, and they do that all winter until they're left with applejack. And when it's finished, let me tell you... You can barely see afterward.' (set: $patience to it + 1)(set: $shadOpinion to it + 1)\n\n(display: \"ConversationOptions\")",
      "name": "ShadApplesA",
      "pid": "162",
      "position": {
        "x": "108",
        "y": "5702"
      }
    },
    {
      "text": "Shad looks down at their chains. 'You're right, of course,' they say. 'It only makes it worse.'\n\n(display: \"ConversationOptions\")",
      "name": "ShadAppledB",
      "pid": "163",
      "position": {
        "x": "258",
        "y": "5702"
      }
    },
    {
      "text": "'So where are you from, stranger?'\n\n[[answer vaguely|ShadQuestionsA]]\n(if: $playerJourney is \"wedding\")[[['i hail from a city far to the west. i'd be there still, had i not been called away for an accursed wedding.'|ShadQuestionsB]]]\\\n(if: $playerJourney is \"census\")[[['i hail from a city far to the west, but i was forced to travel for a census. misfortune befell me on that pointless journey.'|ShadQuestionsB]]]\\\n(if: $playerJourney is \"exile\")[[['i was exiled from my home because of a foolish altercation with an alderman. now i do not have a home.'|ShadQuestionsB]]]\n[['there was some purpose to my journey, but it seems to strange and remote in light of current circumstances that i can barely recall it'|ShadQuestionsC]]",
      "links": [
        {
          "name": "answer vaguely|ShadQuestionsA",
          "link": "answer vaguely|ShadQuestionsA"
        },
        {
          "name": "['i hail from a city far to the west. i'd be there still, had i not been called away for an accursed wedding.'|ShadQuestionsB",
          "link": "['i hail from a city far to the west. i'd be there still, had i not been called away for an accursed wedding.'|ShadQuestionsB"
        },
        {
          "name": "['i hail from a city far to the west, but i was forced to travel for a census. misfortune befell me on that pointless journey.'|ShadQuestionsB",
          "link": "['i hail from a city far to the west, but i was forced to travel for a census. misfortune befell me on that pointless journey.'|ShadQuestionsB"
        },
        {
          "name": "['i was exiled from my home because of a foolish altercation with an alderman. now i do not have a home.'|ShadQuestionsB",
          "link": "['i was exiled from my home because of a foolish altercation with an alderman. now i do not have a home.'|ShadQuestionsB"
        },
        {
          "name": "'there was some purpose to my journey, but it seems to strange and remote in light of current circumstances that i can barely recall it'|ShadQuestionsC",
          "link": "'there was some purpose to my journey, but it seems to strange and remote in light of current circumstances that i can barely recall it'|ShadQuestionsC"
        }
      ],
      "name": "ShadQuestions",
      "pid": "164",
      "position": {
        "x": "548",
        "y": "5556"
      }
    },
    {
      "text": "(set: $patience to it - 1)\\\n(if: $patience > 0)[\\\n{(if: $patience > 3)[\n(set: $tic to (string:\"warm\" + (string:(either: 1, 2))))]\n(elseif: $patience > 1)[\n(set: $tic to (string:\"cool\" + (string:(either: 1, 2))))]\n(else:)[\n(set: $tic to (string:\"cold\" + (string:(either: 1, 2))))]\n}(print: $tic of \"attitudes\" of $interlocutor) (set: $interjections to (rotated: 1, ...$interjections))\\\n\\\n(display: $interjections's 1st)\n]\\\n(else:)[(display: \"exit\" of $interlocutor)]",
      "name": "ConversationInterjectionOnly",
      "pid": "165",
      "position": {
        "x": "1348",
        "y": "348"
      }
    },
    {
      "text": "Your captor leads you by a rope tied around your neck as you descend down unknown passages. You try to keep your bearings and remember any turnings you make but this soon becomes impossible. The air becomes colder and damper as the journey carries on, and several times you slip and fall when the figure leading you neglects to draw your attention to a sudden drop.\n\n[[little choice but to submit|Slavery0]]\n[[make a break for it|DescentToPitA]]",
      "links": [
        {
          "name": "little choice but to submit|Slavery0",
          "link": "little choice but to submit|Slavery0"
        },
        {
          "name": "make a break for it|DescentToPitA",
          "link": "make a break for it|DescentToPitA"
        }
      ],
      "name": "DescentToPit",
      "pid": "166",
      "position": {
        "x": "4900",
        "y": "2956"
      }
    },
    {
      "text": "(set: $croachOpinion to it - 1)'Shut thine mouth, filth,' he says. 'You speak when Croach speaks to you. Understood? Don't say anything. Worm.'\n\n[[say nothing|Slavery0C]]\n[['i'll not listen to you, vile crap-hound'|Slavery0D]]",
      "links": [
        {
          "name": "say nothing|Slavery0C",
          "link": "say nothing|Slavery0C"
        },
        {
          "name": "'i'll not listen to you, vile crap-hound'|Slavery0D",
          "link": "'i'll not listen to you, vile crap-hound'|Slavery0D"
        }
      ],
      "name": "Slavery0B",
      "pid": "167",
      "position": {
        "x": "4844",
        "y": "3452"
      }
    },
    {
      "text": "'This is the pit,' says Croach, pulling you across the muddy floor to a precipice. From the dim light of torches, you can see you are in a vast stone cellar. The floor here is composed of slabs of white granite, but in the centre of the floor a great many of these have been removed, revealing the coarse earth below. You find yourself staring vertiginously down into a deep shaft. The sound of shovelling comes from below. A mechanism hoists debris to the surface, which is piled up in one corner. Bits of white show in the dirt.\n\n'A simple job is thine. Daily you shall descend. You will dig until we find that which we seek, or until you die. If thou shouldst see fit to disobey, one of my boys will whip thine haunches 'til they run bloody. If thou art a good worker, we might find better uses for thee.' He gestures at a looming man, hunched low, who stands nearby. Chains connect his shoulder to his neck. He carries a bludgeon. Some kind of enforcer. {(if: (datanames:\"people\" of $knowledge) contains \"stooped figures\")[(move: \"stooped figures\" of \"people\" of $knowledge into $trash)]\n\n(set: $knowledgeCategory to \"people\")\n(set: $knowledgeName to \"Pit Crew\")\n(set: $appendedKnowledge to \"They guard the labourers in the Pit, their backs rounded off by the weight of chains. They are led by a foul man named Croach.\")\n(set: $newKnowledge to \"Cruel souls, twisted by years of darkness. They command a cohort of chain-gangs deep beneath the Skull, digging down for some unknown purpose. They are led by a foul man named Croach.\")\n(display: \"KnowledgeAppender\")\n\n}(set: $playerTags to it + (a:\"manacles\"))\n\n[[a length of chain is affixed to your ankles|Slavery0E]]",
      "links": [
        {
          "name": "a length of chain is affixed to your ankles|Slavery0E",
          "link": "a length of chain is affixed to your ankles|Slavery0E"
        }
      ],
      "name": "Slavery0C",
      "pid": "168",
      "position": {
        "x": "4980",
        "y": "3752"
      }
    },
    {
      "text": "(set: $croachOpinion to it - 2)(set: $health to it - 1)'Then you and Croach shall have a problem, thou boot-grime, thou streak o' my piss.' He kicks you in the head. He's strong.\n\nYou catch sight of a figure at the edge of the lamplight,  with ankles chained like yours. You see a sliver of admiration on its face. (set: $shadOpinion to it + 1)\n\n[[i curse croach inwardly|Slavery0C]]",
      "links": [
        {
          "name": "i curse croach inwardly|Slavery0C",
          "link": "i curse croach inwardly|Slavery0C"
        }
      ],
      "name": "Slavery0D",
      "pid": "169",
      "position": {
        "x": "4820",
        "y": "3624"
      }
    },
    {
      "text": "(chance to escape to another zone?)",
      "name": "DescentToPitA",
      "pid": "170",
      "position": {
        "x": "4816",
        "y": "3104"
      }
    },
    {
      "text": "Croach gurgles as he trudges heavily away, and someone yanks the chain tied round your ankles.\n\n'Come away,' says a figure off in the shadows. 'Come away with us now or he'll strike you for idleness, or one of his boys will. Look - hold your head low, like this.' The figure stoops, endeavours to look pitiful, a simple feat. You realise that your chain leads to this person's manacled feet, and then snakes away towards a small cluster of figures. All are dressed in rags, smeared in grime.\n\n'My name is Shad,' says the figure. 'I used to be the back of the chain, but I suppose now it's you.'\n\nIf Shad's condition is testament to the trials of life in the pit, then you are right to be fearful. As you move off, en-masse, down the rickety ladder to the pit floor, Shad moves with agonised slowness. Their arms are thin and wasted, and their face hidden beneath grime and bruises. They strain to lift the shovel handed to them by the foreman. Shad won't live much longer under these conditions. (if: $health < 2)[(set: $health to 2)]\n{\n(set: $knowledgeCategory to \"people\")\n(set: $knowledgeName to \"Shad\")\n(set: $appendedKnowledge to \"Shad labours in the depths of the pit. You do not know how Shad came to be here, or if they did anything to deserve this fate.\")\n(set: $newKnowledge to \"Shad labours in the depths of the pit. You do not know how Shad came to be here, or if they did anything to deserve this fate.\")\n(display: \"KnowledgeAppender\")}\n[[and so my time as indentured labour begins|SlaveryDaytime]]",
      "links": [
        {
          "name": "and so my time as indentured labour begins|SlaveryDaytime",
          "link": "and so my time as indentured labour begins|SlaveryDaytime"
        }
      ],
      "name": "Slavery0E",
      "pid": "171",
      "position": {
        "x": "4988",
        "y": "3904"
      }
    },
    {
      "text": "After only a few moments of digging, your shovel collides with something hard. It seems to be a large rock. You pry it out of the ground. You are about to throw it onto the wagon when you notice teeth protruding from the earth that clings to it. You clean it up a little and realise that this is not a rock, but a human skull. You cry out in alarm, but Shad just looks at you with resignation.\n\n'The ground here's full of them. Never any other part - just skulls. It doesn't matter. Throw it on the wheelbarrow.'\n\nYou do so. Shad isn't lying: Over the coming days, you turn up hundreds of skulls like this. They go into the wheelbarrow with the excavated earth and another chain gang wheels them away to be disposed of.{\n(set: $knowledgeCategory to \"history\")\n(set: $knowledgeName to \"skull burial site\")\n(set: $appendedKnowledge to \"The pit of skulls seems to correspond to the site where the Pit Crew are digging. The ground where they dig is rich with skulls, but no other body parts.\")\n(set: $newKnowledge to \"The area under the Skull where the Pit Crew have made their operation is rich with skulls. Strangely, no other bones seem to be down there. How did they get down there? What forgotten people did they belong to?\")\n(display: \"KnowledgeAppender\")\n}",
      "name": "SkullsInMineDiscovery",
      "pid": "172",
      "position": {
        "x": "5645",
        "y": "3651"
      }
    },
    {
      "text": "In the evening, as usual, the guards pass down small bowls of thin mushroom gruel for you to eat. A few slimy lengths of boiled fungus floating in dank water. The bowls are passed from hand to hand down the chains, and the hands are watched avariciously for signs of spillage, and to ensure that nobody takes more than their meagre share. As you are at the back of the chain, Shad is always the one to pass you your bowl. You stare at their hands intently, waiting for them to pass you your dinner. As your bowl approaches, Shad makes no move to take it. The person beyond Shad in the chain nudges them, but Shad does not respond. You look up at Shad's face. Their eyes are vacant, misty. Shad is dead.\n\nAfter some time, the guards come and remove the body.\n{\n(set: $knowledgeCategory to \"people\")\n(set: $knowledgeName to \"Shad\")\n(set: $appendedKnowledge to \"Shad died quietly one evening. Life carried on much as before.\")\n(set: $newKnowledge to \"Shad is one of the slaves who labours in the pit.\")\n(display: \"KnowledgeAppender\")}\n[[another wretched day comes to an end|SlaveryNight]]",
      "links": [
        {
          "name": "another wretched day comes to an end|SlaveryNight",
          "link": "another wretched day comes to an end|SlaveryNight"
        }
      ],
      "name": "ShadDeath",
      "pid": "173",
      "position": {
        "x": "5920",
        "y": "4188"
      }
    },
    {
      "text": "WOAH HERE WE GO NOW\n\n\n(set: $playerTags to it + (a:\"revolution\"))\n(set: $playerTags to it + (a:\"unchained\"))\n(set: $inv to $impoundedGoods)",
      "name": "slaveryUprising",
      "pid": "174",
      "position": {
        "x": "5241",
        "y": "3711"
      }
    },
    {
      "text": "(set: $resistanceStarted to true)Shad comes close to you, whispers something quietly in your ear. 'There's a plan, you know... Some of the others... There are some guards who are sympathetic... Who resent Croach... Some are preparing for an uprising. Hiding bits of useful weapon, weakening their chains... They wait for the right moment to strike. Perhaps you should lay in some preparations...'\n\n(display: \"ConversationOptions\")",
      "name": "ShadResistance",
      "pid": "175",
      "position": {
        "x": "360",
        "y": "5248"
      }
    },
    {
      "text": "(either:\"Something moves in the depths of the gruel you're given for dinner. You make sure to chew it thoroughly.\",\"A slave in another gang drops dead. The guards become suddenly worried that you're all dying too often, so they give you a larger portion of mushroom stew this evening. You thank the dead person, quietly, and someone near you utters a pagan prayer in their honour.\",\"You are able to rest for almost an hour before anyone disturbs you, massaging your aching limbs.\")\n\n[[another wretched day comes to an end|SlaveryNight]]",
      "links": [
        {
          "name": "another wretched day comes to an end|SlaveryNight",
          "link": "another wretched day comes to an end|SlaveryNight"
        }
      ],
      "name": "QuietEvening",
      "pid": "176",
      "position": {
        "x": "5513",
        "y": "5465"
      }
    },
    {
      "text": "(set: $shadOpinion to it + 2)\\\n(set: $shadHealth to it + 1)\\\n(set: $health to it - 1)\\\n(set: $filth to it + 1)\\\nAs Croach raises his hammy fist to strike Shad, you leap up and clip his haunches with the slack of your chain. He turns, wide-eyed, yelling, and bites you hard. He attempts to knock you down, but only falls in the mud himself. He drags you down with him, and delivers a devestating blow to your gut. You pull yourself free. The others - guard and slave alike - marvel at your boldness. Mercifully, Croach seems to remember nothing of the spectacle in the morning.\n\n[[another wretched day comes to an end|SlaveryNight]]",
      "links": [
        {
          "name": "another wretched day comes to an end|SlaveryNight",
          "link": "another wretched day comes to an end|SlaveryNight"
        }
      ],
      "name": "CroachDrunkDay1",
      "pid": "177",
      "position": {
        "x": "6140",
        "y": "4243"
      }
    },
    {
      "text": "(set: $shadOpinion to it - 1)\\\n(set: $filth to it + 3)\\\nYou keep your head low, and attempt to hide as best you can under a pile of dirt. You are so filthy already, you succeed at this, and Croach passes you by. The other slaves note your cowardice.\n\n[[another wretched day comes to an end|SlaveryNight]]",
      "links": [
        {
          "name": "another wretched day comes to an end|SlaveryNight",
          "link": "another wretched day comes to an end|SlaveryNight"
        }
      ],
      "name": "CroachDrunkDay2",
      "pid": "178",
      "position": {
        "x": "6140",
        "y": "4368"
      }
    },
    {
      "text": "Croach sways before you, eyes unfocused. You cast about for some way to placate him, and in a desperate moment you start to sing. (if: $corachOpinion>3)[Somehow, this works. He listens to your voice, and a little smile plays across his lips, and he falls to the ground, fast asleep. Everyone is impressed.(set: $croachOpinion to it + 1)(set: $shadOpinion to it + 1)](else:)[Croach sneers and punches you in the mouth.(set:$health to it - 1)]\n\n[[another wretched day comes to an end|SlaveryNight]]",
      "links": [
        {
          "name": "another wretched day comes to an end|SlaveryNight",
          "link": "another wretched day comes to an end|SlaveryNight"
        }
      ],
      "name": "CroachDrunkDay3",
      "pid": "179",
      "position": {
        "x": "6140",
        "y": "4495"
      }
    },
    {
      "text": "sent to be with other corpses to placate maggot (not quite dead) (found by Keepers?)(set: $playerTags to it - (a:\"manacles\"))",
      "name": "SlaveryDeath",
      "pid": "180",
      "position": {
        "x": "5433",
        "y": "4556"
      }
    },
    {
      "text": "explain that nobody else in the skull will trust you with the chains and that you'll never escape, so you'll come back to croachy if you know what's good for you\n\nafter this point, you're able to return to tell Croach the true location of the Ledger\n\n(set: $inv to $impoundedGoods)(set: $playerTags to it - (a:\"manacles\"))\n(set: $playerTags to it + (a:\"shoulderchains\"))\n(set: $playerTags to it + (a:\"unchained\"))\n\nif you win, do a tag",
      "name": "SlaveryPromotion",
      "pid": "181",
      "position": {
        "x": "5036",
        "y": "4833"
      }
    },
    {
      "text": "(if: (either: true, false, false))[Mercifully, Croach doesn't seem to notice anything as his stick turns up a clod of dirt, revealing your cache of sharpened jawbones. Perhaps the floor of the pit is so thick with bones that he doesn't notice anything out of the ordinary. Once he is gone, you quickly re-hide them unless some guard with more wits about him comes by.](else:)[Your hope is in vain. Croach notices something amiss as he leans on his pole, and quickly uses it to bring what he's found to the surface. He isn't pleased when he discovers the cache of sharpened jawbones. 'Oho well,' he says with glee. 'Who's done this, then? Who here fancies sticking Old Croach with a pointed bone, hm? One of you runts would dearly love to pierce the neck of Old Croach with a tool such as this, and wallow in his blood. Well, who's done it? All will be whipped unless one speaks out.'(set: $resistance to it - 2)\n\n[[own up|CroachRandomSearchC]]\n[[say nothing|CroachRandomSearchD]]\\\n(if: $shadHealth>0)[\n[[blame shad|CroachRandomSearchE]]\n]]",
      "links": [
        {
          "name": "own up|CroachRandomSearchC",
          "link": "own up|CroachRandomSearchC"
        },
        {
          "name": "say nothing|CroachRandomSearchD",
          "link": "say nothing|CroachRandomSearchD"
        },
        {
          "name": "blame shad|CroachRandomSearchE",
          "link": "blame shad|CroachRandomSearchE"
        }
      ],
      "name": "CroachRandomSearchA",
      "pid": "182",
      "position": {
        "x": "6156",
        "y": "4845"
      }
    },
    {
      "text": "(if:$croachOpinion>2)[](else:)[]",
      "name": "CroachRandomSearchB",
      "pid": "183",
      "position": {
        "x": "6146",
        "y": "4631"
      }
    },
    {
      "text": "(set: $croachOpinion to 1)'Well, well, well!' says Croach. 'Our newest runt has done this thing! And we thought so well of him before. Now I shall make you black and blue!' He beats you to within an inch of your life with his walking stick. When he grows tired, you are strung by your manacles above the pit and left to hang there overnight. You lapse in and out of consciousness, head swimming. You don't recall being let down, but you awaken on your back on the ground.(set: $health to 2)\n\nLater, Shad speaks to you. 'That was a brave thing you did,' they say. 'Stupid, but brave.' (set: $shadOpinion to it + 1)\n\n[[another wretched day comes to an end|SlaveryNight]]",
      "links": [
        {
          "name": "another wretched day comes to an end|SlaveryNight",
          "link": "another wretched day comes to an end|SlaveryNight"
        }
      ],
      "name": "CroachRandomSearchC",
      "pid": "184",
      "position": {
        "x": "5950",
        "y": "5100"
      }
    },
    {
      "text": "'Nobody?' says Croach. 'No worm will lay himself out for the goodness of the other worms? Then all shall be punished.' The guards demonstrate efficiency and thoroughness in their treatment of the chain gangs. (set: $shadOpinion to it + 1)(set: $shadHealth to it - 1)(set: $health to it - 1)\n\n[[another wretched day comes to an end|SlaveryNight]]",
      "links": [
        {
          "name": "another wretched day comes to an end|SlaveryNight",
          "link": "another wretched day comes to an end|SlaveryNight"
        }
      ],
      "name": "CroachRandomSearchD",
      "pid": "185",
      "position": {
        "x": "5950",
        "y": "4800"
      }
    },
    {
      "text": "(set: $shadOpinion to 0)\\\n(set: $shadHealth to 1)\\\n(set: $croachOpinion to it - 1)\\\nEven Croach looks momentarily appalled as you point the finger at Shad. Still, Shad is quickly removed from the chain by two guards and taken away to somewhere out of sight. When they reappear, Shad is shivering and bruised all over. Nobody will meet your eye.\n\n[[another wretched day comes to an end|SlaveryNight]]",
      "links": [
        {
          "name": "another wretched day comes to an end|SlaveryNight",
          "link": "another wretched day comes to an end|SlaveryNight"
        }
      ],
      "name": "CroachRandomSearchE",
      "pid": "186",
      "position": {
        "x": "5950",
        "y": "4950"
      }
    },
    {
      "text": "(set: $knowledgeCategory to \"history\")\n(set: $knowledgeName to \"what's below\")\n(set: $appendedKnowledge to \"whatever you want added\")\n(set: $newKnowledge to \"whatever you want the entry to say if this is the first part of it\")\n(display: \"KnowledgeAppender\")",
      "name": "Template for Knowledge Appender",
      "pid": "187",
      "position": {
        "x": "173",
        "y": "806"
      }
    },
    {
      "text": "The creature yells as you strike its side with your shovel.\\\n(set:$croachOpinion to it + 2)\\\n(set:$shadOpinion to it + 1)\\\n(if: (either: true, false))[(set:$health to it - 2) It rears around, lacerating your side with its teeth. ](else:)[(set:$health to it - 1)You catch it by surprise, the flat of your shovel splatting into its muscular haunch. It whips around and attempts to smother you, but with strength afforded you by terror you are able to push it off you. ]You've alarmed it, though. It makes a shrill noise and with alarming speed it burrows into the floor and is gone.\n\n'Such bravery!' Croach yells. 'Thou art as much a fool as a warrior, and thou shalt recieve extra slop on account of it.' He is pleased. Shad smiles at you as you sit down, after Croach leaves. People treat you with a certain respect that evening.\n\n[[another wretched day comes to an end|SlaveryNight]]",
      "links": [
        {
          "name": "another wretched day comes to an end|SlaveryNight",
          "link": "another wretched day comes to an end|SlaveryNight"
        }
      ],
      "name": "MaggotAttackA",
      "pid": "188",
      "position": {
        "x": "5800",
        "y": "5200"
      }
    },
    {
      "text": "Croach yells at the guards to confront it, and they nervously form a ring around it. Two more perish before the beast makes its exit, burrowing into the floor with its muscles pulsating furiously. The camp is quiet until Croach breaks the silence with a yell of rage.\n\n[[another wretched day comes to an end|SlaveryNight]]",
      "links": [
        {
          "name": "another wretched day comes to an end|SlaveryNight",
          "link": "another wretched day comes to an end|SlaveryNight"
        }
      ],
      "name": "MaggotAttackB",
      "pid": "189",
      "position": {
        "x": "5753",
        "y": "5336"
      }
    },
    {
      "text": "You curl up close to Shad, for warmth. The two of you talk quietly, in whispers, so as not to wake the others.\n\n(set: $interlocutor to $Shad)\\\n(display: \"ConversationInitialise\")\\\n(display: \"ConversationOptions\")",
      "name": "ShadConv",
      "pid": "190",
      "position": {
        "x": "5305",
        "y": "4645"
      }
    },
    {
      "text": "Croach looms out of the darkness, cup in hand, as you tentatively approach him. (either: \"'What is it, worm?'\", \"'Approach, thou swine.'\")\n\n(set: $interlocutor to $Croach)\\\n(display: \"ConversationInitialise\")\\\n(display: \"ConversationOptions\")",
      "name": "CroachConv",
      "pid": "191",
      "position": {
        "x": "5306",
        "y": "4773"
      }
    },
    {
      "text": "//PLACEHOLDER//\n\n(display: \"ConversationOptions\")",
      "name": "ShadRumour",
      "pid": "192",
      "position": {
        "x": "404",
        "y": "5551"
      }
    },
    {
      "text": "'Somewhere below the skull, it lurks, grinning, in its maze. None know what it looks like for none have seen it and lived. It guards the ledger that is this place's cosmic sin. Hah! It's why we dig, you know. Because none can pass by what's below, yet Croach would have this ancient ledger, whose import is so vast that none will talk of it directly. That's what we dig for - some way to the heart of this place, where the ledger dwells, to get around the hidden beast that guards it. There's the secret, gleaned by careful listening.'{\n\n(set: $knowledgeCategory to \"history\")\n(set: $knowledgeName to \"what's below\")\n(set: $appendedKnowledge to \"Croach is so afraid of it that he is attempting to dig around it using scores of indentured slaves.\")\n(set: $newKnowledge to \"A beast so deadly that none survive to recollect its appearance. It dwells below the skull in a labyrinth, guarding the ledger.\")\n(display: \"KnowledgeAppender\")\n\n(set: $knowledgeCategory to \"history\")\n(set: $knowledgeName to \"the ledger\")\n(set: $appendedKnowledge to \"A cosminc sin, desired by the depraved. It is guarded by some appaling fiend, and Croach hopes to avoid obtain it by digging around the labyrinth where the beast dwells.\")\n(set: $newKnowledge to \"An object of cosmic import, whispered about by the denizens of the skull. Its secret. Its original sin. It lies somewhere below the earth, guarded by a creature in a labyrinth.\")\n(display: \"KnowledgeAppender\")\n\n(if: (datanames: of \"history\" of $knowledge contains \"The Black Ledger\"))[\n(set: $knowledgeCategory to \"history\")\n(set: $knowledgeName to \"The Black Ledger\")\n(set: $appendedKnowledge to \"Croach would have it, by digging past the creature in the labyrinth.\")\n(set: $newKnowledge to \"FUBAR\")\n(display: \"KnowledgeAppender\")\n]\n}",
      "name": "ShadWhatsBelow",
      "pid": "193",
      "position": {
        "x": "227",
        "y": "5376"
      }
    },
    {
      "text": "'I know that Croach desires it. It's the whole reason for our being here. At night, I have heard him speak lustfully of power and influence that will be his when we reach the place where this ledger is kept, but I don't know why. The way he spoke of it made me fearful. I do not want him to have anything that he desires so strongly.'{\n(set: $knowledgeCategory to \"people\")\n(set: $knowledgeName to \"Croach\")\n(set: $appendedKnowledge to \"His whole project is bent towards the ends of discovering the ledger, far below the skull.\")\n(set: $newKnowledge to \"FOOBAR\")\n(display: \"KnowledgeAppender\")\n\n(set: $knowledgeCategory to \"history\")\n(set: $knowledgeName to \"the ledger\")\n(set: $appendedKnowledge to \"The nature of its power is uncertain, but Croach desires it, which tells you something about it.\")\n(set: $newKnowledge to \"FOOBAR\")\n(display: \"KnowledgeAppender\")\n}",
      "name": "ShadLedger",
      "pid": "194",
      "position": {
        "x": "356",
        "y": "5376"
      }
    },
    {
      "text": "(set: $shadOpinion to it - 1)(set: $patience to it -1)'Fine, don't tell me. Whatever pleases you.'\n\n(display: \"ConversationOptions\")",
      "name": "ShadQuestionsA",
      "pid": "195",
      "position": {
        "x": "441",
        "y": "5738"
      }
    },
    {
      "text": "(either:\"Shad mumbles something, seeming to doze off for a moment.\",\"They hum a quiet tune whose origin you cannot place.\",\"Shad shapes a pile of mud into a small face, and then flattens it under their palm.\",\"For the next few minutes, Shad is distracted by fixated scratching.\",\"Shad picks absently at the calluses inside their hands.\")\n\n(display: \"ConversationOptions\")",
      "name": "ShadQuiet",
      "pid": "196",
      "position": {
        "x": "256",
        "y": "5556"
      }
    },
    {
      "text": "(if: $playerJourney is \"wedding\")['What wretchedness. The wedding will collapse without you there. Your family will scorn you for your disappearance. And through no fault of your own!'\n\nNot for the last time, the image of ceremonial raiments crosses your mind. The thought of yolk-cakes and almond paste spoiling and being thrown away causes the pit of your chest to ache with regret more profound than that which you feel when you imagine your family, the engravings on the ceremonial blade, or the arms of your beloved.]\\\n(if: $playerJourney is \"census\")['Bah! That your life should be so twisted by foolish procedure! I'm sorry, I mean no disrespect, but I fail to understand what good is wrought by such zealous organisation. Does it make your butter taste better? Does a notarised bottle of wine have better nose? I weep.']\\\n(if: $playerJourney is \"exile\")['Then I suppose you can take small solace in the thought that your family do not expect to see you again, and so your current plight does not pour oil on present misery. As for me, my family must wonder daily what has become of me. I imagine them looking expectantly at the entrance to our tent as they sit for evening meals, setting a place for me, pouring sweet milk into a gourd on my behalf... They await my return. You, at least, leave no uncertainty behind.']\n\n(display: \"ConversationOptions\")",
      "name": "ShadQuestionsB",
      "pid": "197",
      "position": {
        "x": "566",
        "y": "5730"
      }
    },
    {
      "text": "'I understand your plight,' says Shad. 'Something about this place... When I dream about the outside world, the dreams are frail and watery, as if printed on paper. My life before this place seems thin and insubstantial.'\n\n(display: \"ConversationOptions\")",
      "name": "ShadQuestionsC",
      "pid": "198",
      "position": {
        "x": "691",
        "y": "5730"
      }
    },
    {
      "text": "Suddenly, he leans forwards. His eyes lock onto yours, and he makes a pained gasping sound.\n\n[[step towards him|CroachVomitA]]\n[[step away from him|CroachVomitB]]",
      "links": [
        {
          "name": "step towards him|CroachVomitA",
          "link": "step towards him|CroachVomitA"
        },
        {
          "name": "step away from him|CroachVomitB",
          "link": "step away from him|CroachVomitB"
        }
      ],
      "name": "CroachVomit",
      "pid": "199",
      "position": {
        "x": "83",
        "y": "4885"
      }
    },
    {
      "text": "(display: \"ConversationOptions\")",
      "name": "CroachYell",
      "pid": "200",
      "position": {
        "x": "226",
        "y": "4873"
      }
    },
    {
      "text": "(display: \"ConversationOptions\")",
      "name": "CroachSnort",
      "pid": "201",
      "position": {
        "x": "368",
        "y": "4871"
      }
    },
    {
      "text": "",
      "name": "CroachQuiet",
      "pid": "202",
      "position": {
        "x": "511",
        "y": "4878"
      }
    },
    {
      "text": "Croach considers you for a moment, head tilted, as if seeing you in a new light.\n\n'A strong frame hast thou, for a new arrival. A good worker art thou also. If thour't loyal, perhaps Croach can find better use for you than a-digging in the bottom of the pit. Tell me, what dost thou know of our wriggling foe, the mighty maggot?'\n\n(if: \"people\" of $knowledge contains \"the maggot\")[(link: \"'i believe i could defeat it.'\")[(goto:\"SlaveryPromotion\")]\n[['it fills me with horror.'|CroacPromotionB]]]\n[['i know nothing of this thing.'|CroachPromotionC]]",
      "links": [
        {
          "name": "'it fills me with horror.'|CroacPromotionB",
          "link": "'it fills me with horror.'|CroacPromotionB"
        },
        {
          "name": "'i know nothing of this thing.'|CroachPromotionC",
          "link": "'i know nothing of this thing.'|CroachPromotionC"
        }
      ],
      "name": "CroachPromotion",
      "pid": "203",
      "position": {
        "x": "443",
        "y": "4573"
      }
    },
    {
      "text": "'Ha! Afeared, is it? And rightly so, for the maggot is loathely and furious. But Croach has no need of a shrinking pit-violet of lily-white brow. Thou canst leave me now.' (set: $croachOpinion to it - 2)\n\n(display: \"ConversationOptions\")",
      "name": "CroacPromotionB",
      "pid": "204",
      "position": {
        "x": "361",
        "y": "4735"
      }
    },
    {
      "text": "{\n(set: $knowledgeCategory to \"people\")\n(set: $knowledgeName to \"the maggot\")\n(set: $appendedKnowledge to \"Croach wishes dearly to see it dead.\")\n(set: $newKnowledge to \"The maggot is the foe of the Pit Crew, harassing them constantly. The denizens of the Pit would love to see it dead, but they are powerless to overcome its speed and ferocity. Croach searches for someone strong enough to confront it.\")\n(display: \"KnowledgeAppender\")\n}'A monsterous carbuncle is the maggot, dwelling far above us in a chamber of vast granite ribs. He treats Croach's operation as a delicious platter of repast, coming some days to munch my finest slaves. We name him maggot, but I dread to see the blowfly that blew him! Wouldst thou of brawny arm go contend with him? All others have died who have made the attempt, I tell thee, and their screams are most piteous to hear.'\n\n(link: \"'i believe i could defeat it.'\")[(goto:\"SlaveryPromotion\")]\n[['this task is not for me.'|CroacPromotionB]]",
      "links": [
        {
          "name": "'this task is not for me.'|CroacPromotionB",
          "link": "'this task is not for me.'|CroacPromotionB"
        }
      ],
      "name": "CroachPromotionC",
      "pid": "205",
      "position": {
        "x": "530",
        "y": "4721"
      }
    },
    {
      "text": "(display: \"ConversationOptions\")",
      "name": "CroachVomitA",
      "pid": "206",
      "position": {
        "x": "83",
        "y": "5035"
      }
    },
    {
      "text": "(display: \"ConversationOptions\")",
      "name": "CroachVomitB",
      "pid": "207",
      "position": {
        "x": "235",
        "y": "5035"
      }
    },
    {
      "text": "The crevice tightens around your chest as you push through into darkness, using the rope to guide your passage. You can feel dry dust beneath your feet, and the wall is rough to the touch. Just as the space between the rocks is becoming too close to breath, you see a chink of light ahead. \n(if: $playertags contains \"drunk\")[\nYou stumble, breathless, into a tall shaft between giant rock faces. Turning to look upwards at what looks like moonlight flashing from on high, your foot slips from under you. You land, hard, and slide down a narrow chute embedded in the floor. Too late, you realise the floor was slick with blood.\n\n[[into darknesss again->CorpseChute0]]]\n(else:)[\nYou stumble, breathless, into a tall shaft between giant rock faces. The space is angled, and a silvery light beams down above you, offering scant illumination. A set of rough-hewn steps leads down to a rotting wooden door, roughly set into the stone on one side. As you turn towards the door, your foot slips. A streak of wet blood leads to a narrow chute in the floor. You saw it just in time. (set: $knowledge's (\"places\") to it + (datamap: \"the bloody chute\", \"I nearly fell in this\"))\n\n[[slide down the chute->CorpseChute0]]\n[[head for the door->Hallway-Middens]]\n[[wait here a while->hallway 2b]]]\n\n(display: \"GenericActions\")",
      "links": [
        {
          "name": "into darknesss again",
          "link": "CorpseChute0",
          "pid": "131"
        },
        {
          "name": "slide down the chute",
          "link": "CorpseChute0",
          "pid": "131"
        },
        {
          "name": "head for the door",
          "link": "Hallway-Middens",
          "pid": "214"
        },
        {
          "name": "wait here a while",
          "link": "hallway 2b",
          "pid": "209"
        }
      ],
      "name": "hallway 2a",
      "pid": "208",
      "position": {
        "x": "2576",
        "y": "2890"
      }
    },
    {
      "text": "You find a spot to sit, and watch the silvery light change overhead. \n(if: (random:1,3)>2)[Suddenly, the wooden door bursts open. (either: \"A ragged woman enters, dragging a what can only be a freshly dead corpse along the dirt behind her. She notices you, but pays you no mind. She heaves the corpse into the wretched hole in the ground, and returns through the doorway.\", \n\"A staunch man, carrying a rough hessian sack over his shoulder. The sack oozes a thick liquid and a pungent stench of decay floods the dry shaft. He drops the sack into the chute, and turns back. He doesn't see you.\")(set: $sawbodydrop to true) (set: $knowledge's (\"places\") to it + (datamap: \"the bloody chute\", \"I've seen carcasses thrown down here. My heart hopes they were animals. The alternative is worse.\"))\n\n[[slide down the chute->CorpseChute0]]\n[[head for the door->Hallway-Middens]]\n[[wait here a while->hallway 2b]]]\n(else:)[(if:$ropeinhallway is true)[\nLooking up, you see the rope you used to guide your passage is tied to a rusting iron hook set into the wall. \n(if: $playertags contains \"boundhands\" or $playertags contains \"manacles\")[If only your hands were free, you might be able to untie it]\n(else:)[[[try to untie the rope->hallway 2c]]]]\n(else:)[(set: $timeindungeon to it+1)\n[[slide down the chute->CorpseChute0]]\n[[head for the door->Hallway-Middens]]\n[[wait here a while->hallway 2b]]]]\n\n\n(display: \"GenericActions\")",
      "links": [
        {
          "name": "slide down the chute",
          "link": "CorpseChute0",
          "pid": "131"
        },
        {
          "name": "head for the door",
          "link": "Hallway-Middens",
          "pid": "214"
        },
        {
          "name": "wait here a while",
          "link": "hallway 2b",
          "pid": "209"
        },
        {
          "name": "[try to untie the rope",
          "link": "hallway 2c",
          "pid": "211"
        },
        {
          "name": "slide down the chute",
          "link": "CorpseChute0",
          "pid": "131"
        },
        {
          "name": "head for the door",
          "link": "Hallway-Middens",
          "pid": "214"
        },
        {
          "name": "wait here a while",
          "link": "hallway 2b",
          "pid": "209"
        }
      ],
      "name": "hallway 2b",
      "pid": "209",
      "position": {
        "x": "2576",
        "y": "3040"
      }
    },
    {
      "text": "(set: $broochonfloor to false)\n(set: $ropeinhallway to true)\n(set: $sawbodydrop to false)\n(set: $boughtdrink to false)\n(set: $metpubgroup to false)\n\n\n(goto: \"InitialiseLibrary\")\n",
      "name": "InitialiseSwitches",
      "pid": "210",
      "position": {
        "x": "318",
        "y": "648"
      }
    },
    {
      "text": "The rope snags under your tired fingers, but eventually comes free. You loop it loosely around your waist. \n(set: $inv to it+(a:\"rope\"))\n(set: $ropeinhallway to false)\n\n[[slide down the chute->CorpseChute0]]\n[[head for the door->Hallway-Middens]]\n[[wait here a while->hallway 2b]]\n\n(display: \"GenericActions\")",
      "links": [
        {
          "name": "slide down the chute",
          "link": "CorpseChute0",
          "pid": "131"
        },
        {
          "name": "head for the door",
          "link": "Hallway-Middens",
          "pid": "214"
        },
        {
          "name": "wait here a while",
          "link": "hallway 2b",
          "pid": "209"
        }
      ],
      "name": "hallway 2c",
      "pid": "211",
      "position": {
        "x": "2576",
        "y": "3190"
      }
    },
    {
      "text": "A length of frayed and dirty rope. Probably useful. I wonder why it was in that passage?\n\n(link: \"done\")[(goto: (history:)'s 2ndlast)]",
      "name": "rope",
      "pid": "212",
      "position": {
        "x": "195",
        "y": "1442"
      }
    },
    {
      "text": "- where some people (including the jailer) make their home\n- ad-hoc structures, reinforcements\n- squeezed under pressure of buildings around it, built in cracks\n- traps and ambushes\n- bettothed woman is round here, or clues are\n- why do they throw bodies in the corpse chute?\n\n- if playertags contains released, the jailer might be here somewhere and you can chat in a way that is less adversereal (maybe)\n\n[[UpperLibrary1]] \n[[LowerLibrary1]] \n[[Vaults1]] ",
      "links": [
        {
          "name": "UpperLibrary1",
          "link": "UpperLibrary1",
          "pid": "109"
        },
        {
          "name": "LowerLibrary1",
          "link": "LowerLibrary1",
          "pid": "107"
        },
        {
          "name": "Vaults1",
          "link": "Vaults1",
          "pid": "106"
        }
      ],
      "name": "Middens Notes",
      "pid": "213",
      "position": {
        "x": "3450",
        "y": "1455"
      }
    },
    {
      "text": "(goto: \"Middens1\")",
      "name": "Hallway-Middens",
      "pid": "214",
      "position": {
        "x": "2919",
        "y": "2678"
      }
    },
    {
      "text": "(if: $MiddensOldWomanSwitch is \"talk\")[\n'Welcome to the Middens, dearie.' she croaks. (set: \"places\" of $knowledge to it + (datamap: \"the Middens\", \"An old woman welcomed me here after I escaped the cell.\"))\n(set: $interlocutor to $MiddensOldWoman)\\\n(display: \"ConversationInitialise\")\\\n(display: \"ConversationOptions\")]\n(if: $MiddensOldWomanSwitch is \"pass\")[\nShe shuffles past you, dragging her sack. Gobs of red leaking from the sack paint fresh blood across dusty path and through the rotting door.\n\n[[a quiet and dark alley ->Middens2]] \n[[the noisome passage->Middens3]] \n[[the smell of food->Middens4]] \n[[back through the door->hallway 2d]] \n\n(display: \"GenericActions\")]",
      "links": [
        {
          "name": "a quiet and dark alley ",
          "link": "Middens2",
          "pid": "234"
        },
        {
          "name": "the noisome passage",
          "link": "Middens3",
          "pid": "216"
        },
        {
          "name": "the smell of food",
          "link": "Middens4",
          "pid": "217"
        },
        {
          "name": "back through the door",
          "link": "hallway 2d",
          "pid": "235"
        }
      ],
      "name": "MiddensOldWoman",
      "pid": "215",
      "position": {
        "x": "3083",
        "y": "2810"
      }
    },
    {
      "text": "The noise of the lighted alcove tumbles and echoes against the white rock. A stale and sour smell billows against your nostrils as you draw nearer. Some kind of grog-den, even in an accursed place such as this? Mankind's vice knows no bounds. \n\n[[duck into the low door->MiddensPub]]\n[[continue down this alley->Middens3b]]",
      "links": [
        {
          "name": "duck into the low door",
          "link": "MiddensPub",
          "pid": "220"
        },
        {
          "name": "continue down this alley",
          "link": "Middens3b",
          "pid": "221"
        }
      ],
      "name": "Middens3",
      "pid": "216",
      "position": {
        "x": "3451",
        "y": "2846"
      }
    },
    {
      "text": "The lights in this passage are dim, and the alcoves hum with the low noise of footsteps and guttural speech. A waft of an acrid smell of burning fat mingles with the taste of food in the air. Could anyone be making a life in this hellpit?\n\n[[knock on the first wooden door->MiddensHouse1]]\n[[knock on the second wooden door->MiddensHouse2]]\n[[continue down the passage->Middens4b]]",
      "links": [
        {
          "name": "knock on the first wooden door",
          "link": "MiddensHouse1",
          "pid": "222"
        },
        {
          "name": "knock on the second wooden door",
          "link": "MiddensHouse2",
          "pid": "223"
        },
        {
          "name": "continue down the passage",
          "link": "Middens4b",
          "pid": "224"
        }
      ],
      "name": "Middens4",
      "pid": "217",
      "position": {
        "x": "3603",
        "y": "2857"
      }
    },
    {
      "text": "You notice the trapdoor that leads to the cellar of the pub and can\n(link-goto: \"open it\", \"MiddensPubCellar\")\nor \n[[carry on->Middens2b]]",
      "links": [
        {
          "name": "carry on",
          "link": "Middens2b",
          "pid": "219"
        }
      ],
      "name": "Middens2a",
      "pid": "218",
      "position": {
        "x": "3256",
        "y": "2703"
      }
    },
    {
      "text": "[[continue->Middens2c]]\n[[turn right->Middens3b]]",
      "links": [
        {
          "name": "continue",
          "link": "Middens2c",
          "pid": "226"
        },
        {
          "name": "turn right",
          "link": "Middens3b",
          "pid": "221"
        }
      ],
      "name": "Middens2b",
      "pid": "219",
      "position": {
        "x": "3247",
        "y": "2551"
      }
    },
    {
      "text": "(set: $timesplayedpubgame to 0)\nYou have to stoop inside a low cave, where torches burn in brackets on the walls. The air smells of sour spirits, and occasionally burning fat as the flames pop and splutter. A scrawny man, bare-chested and scarred, sits at a wooden table at the back of the room. The table is piled with animal skulls on one side, and an assortment of amphoras on the other. In one corner sits a woman alone, in another a group play a raucous game that threatens to spill over into the type of bar-room disagreement settled with flesh. Little succour for tired bones in this inn.\n\n(link-goto: \"approach the publican\", \"Pubman1\")\n(link: \"approach the group\")[(if: $boughtdrink is false)[(goto:\"mustbuydrink\")](else:)[(goto: \"Pubgroup1\")]]\n(link: \"sit by the woman\")[(if: $boughtdrink is false)[(goto:\"mustbuydrink\")](else:)[(goto: \"Pubwoman1\")]]\n(link: \"look around\")[(if: $boughtdrink is false)[(goto:\"mustbuydrink\")](else:)[(goto: \"Pubsearch1\")]]\n",
      "name": "MiddensPub",
      "pid": "220",
      "position": {
        "x": "3448",
        "y": "2995"
      }
    },
    {
      "text": "[[head towards the noise->Middens3]]\n[[continue->Middens3c]]\n[[turn left->Middens2b]]\n[[turn right->Middens4b]]",
      "links": [
        {
          "name": "head towards the noise",
          "link": "Middens3",
          "pid": "216"
        },
        {
          "name": "continue",
          "link": "Middens3c",
          "pid": "227"
        },
        {
          "name": "turn left",
          "link": "Middens2b",
          "pid": "219"
        },
        {
          "name": "turn right",
          "link": "Middens4b",
          "pid": "224"
        }
      ],
      "name": "Middens3b",
      "pid": "221",
      "position": {
        "x": "3463",
        "y": "2550"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": "MiddensHouse1",
      "pid": "222",
      "position": {
        "x": "3603",
        "y": "3003"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": "MiddensHouse2",
      "pid": "223",
      "position": {
        "x": "3802",
        "y": "2847"
      }
    },
    {
      "text": "[[head towards the lit alcoves->Middens4]] \n[[head towards the dark alcoves->Middens4c]]\n[[turn left->Middens3b]]",
      "links": [
        {
          "name": "head towards the lit alcoves",
          "link": "Middens4",
          "pid": "217"
        },
        {
          "name": "head towards the dark alcoves",
          "link": "Middens4c",
          "pid": "228"
        },
        {
          "name": "turn left",
          "link": "Middens3b",
          "pid": "221"
        }
      ],
      "name": "Middens4b",
      "pid": "224",
      "position": {
        "x": "3626",
        "y": "2549"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": "MiddensPubCellar",
      "pid": "225",
      "position": {
        "x": "3449",
        "y": "3283"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": "Middens2c",
      "pid": "226",
      "position": {
        "x": "3249",
        "y": "2410"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": "Middens3c",
      "pid": "227",
      "position": {
        "x": "3463",
        "y": "2408"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": "Middens4c",
      "pid": "228",
      "position": {
        "x": "3629",
        "y": "2406"
      }
    },
    {
      "text": "(set: $MiddensOldWoman to (datamap:))\n\n(set: \"maxpatience\" of $MiddensOldWoman to 5)\n(set: \"patience\" of $MiddensOldWoman to 1)\n(set: \"timelastmet\" of $MiddensOldWoman to 0)\n\n(set: \"responses\" of $MiddensOldWoman to (datamap:\n\"the Middens\",\n(display: \"MiddensOldWomanMiddensResponse\"),\n\n\"the bloody chute\",\n(display: \"MiddensOldWomanBloodyChuteResponse\")\n))\n\n(set: \"opinions\" of $MiddensOldWoman to (datamap:\n\"the Middens\",-1,\n\"the skull\", -1,\n\"the bloody chute\", -1,\n\"the cell\",-1,\n\"Traveller's Friend\",-1,\n\"the ledger\",-1,\n\"The Black Ledger\", -1,\n\"Children's Song\", -1,\n\"stooped figures\", -1,\n\"something below\", -1,\n))\n\n(set: \"attitudes\" of $MiddensOldWoman to (datamap:\n\"warm1\",\"She looks past you, impatiently\",\n\"warm2\",\"She looks past you, impatiently\",\n\"cool1\",\"She looks past you, impatiently\",\n\"cool2\",\"She looks past you, impatiently\",\n\"cold1\",\"She looks past you, impatiently\",\n\"cold2\",\"She looks past you, impatiently\",\n))\n\n(set: \"interjections\" of $MiddensOldWoman to (a: \"MiddensOldWomanBrushOff\", \"MiddensOldWomanBrushOff\"))\n\n(set: \"iDontKnow\" of $MiddensOldWoman to\n(a: \" 'I'm afraid I can't help you, dearie. Why don't you try the drinkery along the way?' \", \" 'I'm afraid I can't help you, dearie. Why don't you try the drinkery along the way?' \"))\n\n(set: \"playerExit\" of $MiddensOldWoman to \"MiddensOldWomanExit\")\n\n(set: \"exit\" of $MiddensOldWoman to \"MiddensOldWomanExit\")\n\n(set: \"topicsDiscussed\" of $MiddensOldWoman to (a:))",
      "name": "InitialiseMOW",
      "pid": "229",
      "position": {
        "x": "110",
        "y": "5905"
      }
    },
    {
      "text": "'I've lived here all my life, dearie. It's not much of a life, but it could be worse I suppose.'\n\n(set: $knowledge's (\"places\") to it + (datamap: \"the Middens\", \"some kind of town, down in this hell-hole. why would people live here?\"))",
      "name": "MiddensOldWomanMiddensResponse",
      "pid": "230",
      "position": {
        "x": "252",
        "y": "5901"
      }
    },
    {
      "text": "'Oh yes, that's where I'm headed now. Got to have somewhere to throw away our gristle don't we. We're not all savages down here I'll have you know.' \n\n(set: $knowledge's (\"places\") to it + (datamap: \"the bloody chute\", \"the people of the Middens dispose of 'gristle' here. I'd best keep away.\"))",
      "name": "MiddensOldWomanBloodyChuteResponse",
      "pid": "231",
      "position": {
        "x": "386",
        "y": "5905"
      }
    },
    {
      "text": "'Won't you mind out the way?' she asks, moving toward the door behind you.\n\n(display: \"ConversationOptions\")",
      "name": "MiddensOldWomanBrushOff",
      "pid": "232",
      "position": {
        "x": "512",
        "y": "5906"
      }
    },
    {
      "text": "(set: $MiddensOldWomanSwitch to \"pass\")\n(display: \"ConversationExit\")\n(link-goto: \"the old woman moves to leave\", \"MiddensOldWoman\")",
      "name": "MiddensOldWomanExit",
      "pid": "233",
      "position": {
        "x": "639",
        "y": "5906"
      }
    },
    {
      "text": "A dim and quiet passage. If you were careful, you could probably slip through here unnoticed. There doesn't seem to be anyone around.\n\n[[advance cautiously->Middens2a]] \n[[walk boldly->Middens2b]] ",
      "links": [
        {
          "name": "advance cautiously",
          "link": "Middens2a",
          "pid": "218"
        },
        {
          "name": "walk boldly",
          "link": "Middens2b",
          "pid": "219"
        }
      ],
      "name": "Middens2",
      "pid": "234",
      "position": {
        "x": "3260",
        "y": "2854"
      }
    },
    {
      "text": "A tall shaft between giant rock faces. The space is angled, and a silvery light beams down above you, offering scant illumination. A set of rough-hewn steps leads down to a rotting wooden door, roughly set into the stone on one side. A chute in the ground descends into darkness. The rim of the chute is smeared with blood. \n\n[[slide down the chute->CorpseChute0]]\n[[head for the door->Hallway-Middens]]\n[[wait here a while->hallway 2b]]]\n\n(display: \"GenericActions\")",
      "links": [
        {
          "name": "slide down the chute",
          "link": "CorpseChute0",
          "pid": "131"
        },
        {
          "name": "head for the door",
          "link": "Hallway-Middens",
          "pid": "214"
        },
        {
          "name": "wait here a while",
          "link": "hallway 2b",
          "pid": "209"
        }
      ],
      "name": "hallway 2d",
      "pid": "235",
      "position": {
        "x": "2579",
        "y": "3340"
      }
    },
    {
      "text": "Random find or random encounter, also\n[[MiddensPubCellar]] ",
      "links": [
        {
          "name": "MiddensPubCellar",
          "link": "MiddensPubCellar",
          "pid": "225"
        }
      ],
      "name": "Pubsearch1",
      "pid": "236",
      "position": {
        "x": "3448",
        "y": "3134"
      }
    },
    {
      "text": "'Oi! You!' the publican behind the table shouts.\n'This isn't a fucking library! Buy a drink if you're going to piss about in here'. \nHe gestures angrily, and as you look you notice the glint of a steel blade beside him.\n\n(link-goto: \"approach the publican\", \"Pubman1\")\n(link-goto: \"leave\", \"Middens3\")\n",
      "name": "mustbuydrink",
      "pid": "237",
      "position": {
        "x": "3310",
        "y": "2992"
      }
    },
    {
      "text": "The aging man was muscular once, and his arms are sinewy. He appraises you with cold blue eyes as you approach.\n'Right then, does you want a drink or will you be fucking off?'\nThe blade makes it clear he's not really asking. \n\n[[i don't think I can pay you->Pubman2]]\n",
      "links": [
        {
          "name": "i don't think I can pay you",
          "link": "Pubman2",
          "pid": "243"
        }
      ],
      "name": "Pubman1",
      "pid": "238",
      "position": {
        "x": "205",
        "y": "6115"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": "Pubwoman1",
      "pid": "239",
      "position": {
        "x": "304",
        "y": "6763"
      }
    },
    {
      "text": "Three men are sitting around a low table, containing an assortment of strange objects. In the centre of the table is a pile of small bones, which one of them is rearranging. They appear to be playing some kind of game. \n(if: $metpubgroup is false)[\n\"Oh-ho!\", one of them shouts. \"Looks like we've got another contender!\"]\n(if: $metpubgroup is true)[\n\"Back again, are you?\" cries one of the men]\n\n(link: \"sit with the men\")[\n(if: $pubinv's length>3)[(goto: \"sit with the men\")]\n(else:)[(goto: \"playedenough\")]]\n(link-goto: \"leave the men alone\", \"MiddensPub\")\n\n(set: $metpubgroup to true)\n\n\n",
      "name": "Pubgroup1",
      "pid": "240",
      "position": {
        "x": "233",
        "y": "6941"
      }
    },
    {
      "text": "(set: $Pubwoman to (datamap:))\n\n(set: \"maxpatience\" of $Pubwoman to 5)\n(set: \"patience\" of $Pubwoman to 5)\n(set: \"timelastmet\" of $Pubwoman to 0)\n\n(set: \"responses\" of $Pubwoman to (datamap:\n\"Arbiters\",\n\"'Fools, confusing rigour with righteousness. You do well to fear the tyranny of the trivial. They disgust me.'\",\n))\n\n(set: \"opinions\" of $Pubwoman to (datamap:\n\"Arbiters\",-3,\n\n))\n\n(set: \"attitudes\" of $Pubwoman to (datamap:\n\"warm1\",\"\",\n\"warm2\",\"\",\n\"cool1\",\"\",\n\"cool2\",\"\",\n\"cold1\",\"\",\n\"cold2\",\"\",\n))\n\n(set: \"interjections\" of $Pubwoman to (a:))\n\n(set: \"iDontKnow\" of $Pubwoman to\n(a:))\n\n(set: \"playerExit\" of $Pubwoman to \"\")\n\n(set: \"exit\" of $Pubwoman to \"\")\n\n(set: \"topicsDiscussed\" of $Pubwoman to (a:))\n",
      "name": "InitialisePubwoman",
      "pid": "241",
      "position": {
        "x": "160",
        "y": "6762"
      }
    },
    {
      "text": "(set: $Pubman to (datamap:))\n\n(set: \"maxpatience\" of $Pubman to 5)\n(set: \"patience\" of $Pubman to 5)\n(set: \"timelastmet\" of $Pubman to 0)\n\n(set: \"responses\" of $Pubman to (datamap:\n\"Arbiters\",\n\"'I left all that behind when I came down here. Better to make a life underground than deal with those fuckers.'\",\n\n\"stooped figures\",\n\" 'They got you, did they? Haha. Thank your lucky stars they didn't press-gang you.' \",\n\n\"Pit Crew\",\n\" 'Don't hold with all that digging myself. Don't know what they're after. Don't care to. Lucky for you that you ain't in with them' \",\n\n\"the betrothed woman\",\n\" 'There's a woman over there, y'see. I don't make a habit of asking people what they're running from if they end up down here though. That might get you more trouble than you wanted' \",\n\n\"the skull\",\n\" 'Big skull, innit. What fucking more do you want? It ain't all it's cracked up to be, I can tell you that.' \",\n\n\"the library\",\n(display: \"Pubmanlibraryresponse\"),\n\n\"the Middens\",\n(display: \"PubmanMiddensresponse\"),\n\n\"the bloody chute\",\n(display: \"Pubmanchuteresponse\"),\n\n\"the ledger\",\n\"I'd leave that well alone, if I were you\",\n\n\"The Black Ledger\",\n\"I'd leave that well alone, if I were you\",\n))\n\n(set: \"opinions\" of $Pubman to (datamap:\n\"Arbiters\",-1,\n\"the ledger\", -5,\n\"The Black Ledger\", -5,\n\"the betrothed woman\", -1,\n\"stooped figures\", -1,\n\"Pit Crew, -1\"\n))\n\n(set: \"attitudes\" of $Pubman to (datamap:\n\"warm1\",\"He eyes you with curiosity, and half grins\",\n\"warm2\",\"His gnarled hand offers you a bowl of what might be salted seeds\",\n\"cool1\",\"He looks you up and down warily\",\n\"cool2\",\"There's a cold tone in his voice\",\n\"cold1\",\"His hand reaches for the dagger on the table\",\n\"cold2\",\"He half rises, baring his teeth slightly. He's seen many conversations turn to blood, you'd wager.\",\n))\n\n(set: \"interjections\" of $Pubman to (a: \"Pubmananotherdrink\", \"Pubmanstory\", \"Pubmanplan\"))\n\n(set: \"iDontKnow\" of $Pubman to\n(a: \" 'folks that ask too many questions don't last long around these parts, chum' \", \"' 'Fraid I can't help you there, pally' \" ))\n\n(set: \"playerExit\" of $Pubman to \"PubmanPEx\")\n\n(set: \"exit\" of $Pubman to \"PubmanEx\")\n\n(set: \"topicsDiscussed\" of $Pubman to (a:))\n",
      "name": "InitialisePubman",
      "pid": "242",
      "position": {
        "x": "59",
        "y": "6114"
      }
    },
    {
      "text": "'Oh that's alright, I expect you'll pay later' he chuckles. He pours a small measure of clear liquid into an upturned animal skull and hands it to you. A trace of blood on the unclean skull swirls a smoke of pink into the translucence. It smells foul. \n(set: $boughtdrink to true)\n\n[[drink it->Pubman3]]\n(link: \"approach the group\")[(if: $boughtdrink is false)[(goto:\"mustbuydrink\")](else:)[(goto: \"Pubgroup1\")]]\n(link: \"sit by the woman\")[(if: $boughtdrink is false)[(goto:\"mustbuydrink\")](else:)[(goto: \"Pubwoman1\")]]\n(link: \"look around\")[(if: $boughtdrink is false)[(goto:\"mustbuydrink\")](else:)[(goto: \"Pubsearch1\")]]\n\n(display: \"GenericActions\")",
      "links": [
        {
          "name": "drink it",
          "link": "Pubman3",
          "pid": "244"
        }
      ],
      "name": "Pubman2",
      "pid": "243",
      "position": {
        "x": "337",
        "y": "6115"
      }
    },
    {
      "text": "It tastes even worse than it smells, and you feel a cloudiness descend over your mind. \n'Down the hatch!' cries the publican with glee.\n(set: $playerTags to it+(a: \"drunk\")) (set: $playerTags to it+(a: \"owespublican\"))\n(set: $interlocutor to $Pubman)\n(display: \"ConversationInitialise\")\\\n(display: \"ConversationOptions\")",
      "name": "Pubman3",
      "pid": "244",
      "position": {
        "x": "481",
        "y": "6114"
      }
    },
    {
      "text": "'Well now, you saw that did you? Well no matter, it's no secret. Every now and then someone comes a cropper in this part of the world; more often than not to tell you the truth. And maybe when they do, we call it a treat. It's not like food and light is easy to come by in this fucking place, I tell you. And if we drop the remains down to thems less fortunate than us, I figure we're doing right by everyone. I'll tell you what, it keeps strangers out of trouble when I tell them that, much as it is.'\n(set: $knowledge's (\"places\") to it + (datamap: \"the bloody chute\", \"the people of the Middens drop bodies down here. Could there truly be those even worse off down below?\"))",
      "name": "Pubmanchuteresponse",
      "pid": "245",
      "position": {
        "x": "475",
        "y": "6239"
      }
    },
    {
      "text": "'We're not in the best shape down here. No-one is really, that ends up living a place like this. Can't blame me for keeping a blade around, can you eh. Still, it's a sight better than anywhere on the outside of this fucking place. No one bothers you, as long as you don't bother no-one. There's meself and a couple other folks down the next path what lives here all the time, and we get our fair share of other wretches and passers-by. Some of course never leave, if you catch my drift.'",
      "name": "PubmanMiddensresponse",
      "pid": "246",
      "position": {
        "x": "337",
        "y": "6240"
      }
    },
    {
      "text": "'Oh yes. I don't got there much meself, too many fucking books for my liking. A little knowledge can be a dangerous thing, if you catch me drift. Especially if it's written down. Still, don't mind pointing you in the right direction, like. The lower part's a little flooded, so you're better off heading to the top level. That's just down the passageway ahead.'\n(set: $knowledge's (\"places\") to it + (datamap: \"the library\", \"Some dangerous knowledge might be stored here. There are two levels. The lower level is flooded, but I can reach the upper by going through the Middens\"))\n",
      "name": "Pubmanlibraryresponse",
      "pid": "247",
      "position": {
        "x": "207",
        "y": "6240"
      }
    },
    {
      "text": "The publican interrupts you. His forked tongue glints against his teeth.\n\n'What are you asking these questions for anyway? What's your plan down 'ere? Actually, don't tell me. The less I know about you, the less I'll miss you when you're dead. Hueh hueh hueh...'\n\n(display: \"ConversationOptions\")\n\n",
      "name": "Pubmanplan",
      "pid": "248",
      "position": {
        "x": "489",
        "y": "6365"
      }
    },
    {
      "text": "As you talk, the publican opens up a little. Perhaps the drink-fumes have loosened his tongue.\n\n'When I first came here, weren't nothing to speak of. Carved out a little niche for meself, so to speak, here in this passage. I haven't seen much of the rest of this place, but what I've seen, I don't like too well. So I keeps here, and fuck the rest of 'em I reckon. I used to be a fighter, you know. You see these scars? I earned every one of 'em. That were a glassing, that were a stabbing, that were... well, you get the picture.'\n\nHe trails off, absent-minded. \n\n(display: \"ConversationOptions\")",
      "name": "Pubmanstory",
      "pid": "249",
      "position": {
        "x": "346",
        "y": "6366"
      }
    },
    {
      "text": "'Enjoyed that liquor did you?' he asks, eyeing your skull.\n'How'd you like another? I make 'em myself'\n\nYou already can feel your body fighting off a heavy drunk from the first. Is this a good idea?\n\n[[yes please->yesdrink]]\n[[no thank you->nodrink]]",
      "links": [
        {
          "name": "yes please",
          "link": "yesdrink",
          "pid": "253"
        },
        {
          "name": "no thank you",
          "link": "nodrink",
          "pid": "254"
        }
      ],
      "name": "Pubmananotherdrink",
      "pid": "250",
      "position": {
        "x": "211",
        "y": "6368"
      }
    },
    {
      "text": "'Be seeing you,' he smiles grimly. \n'Or maybe not.'\n\n(link-goto: \"leave the table\", \"MiddensPub\")",
      "name": "PubmanPEx",
      "pid": "251",
      "position": {
        "x": "335",
        "y": "6609"
      }
    },
    {
      "text": "'You know what?' he snaps,\n'Your face is starting to get on my nerves. Mind out the way won't you, I've got customers to serve.'\n\n(link-goto: \"leave the table\", \"MiddensPub\")",
      "name": "PubmanEx",
      "pid": "252",
      "position": {
        "x": "205",
        "y": "6609"
      }
    },
    {
      "text": "The blackness washes over you almost as quickly as the liquor slips down your throat.\n\n(link-goto: \"sweet relief from suffering\", \"the body cellar transition\")",
      "name": "yesdrink",
      "pid": "253",
      "position": {
        "x": "75",
        "y": "6483"
      }
    },
    {
      "text": "The publican makes a barely concealed wince at your response. (set: \"patience\" of $interlocutor to it-1)\n\n(display: \"ConversationOptions\")",
      "name": "nodrink",
      "pid": "254",
      "position": {
        "x": "223",
        "y": "6484"
      }
    },
    {
      "text": "It's almost too dark to see. As your eyes adjust to the dimness, you recoil in horror. The floor is littered with corpses. You are lying in the filth of dried blood, dirt, and fragments of bone. The only light comes from high above, where a few sullen rays illuminate the chute down to this pit. An oddly regular thudding noise bounces around the dark chamber. (if: (history:)'s last is \"the body cellar transition\")[It isn't your own heart after all]. \n\n[[investigate the corpses]]\n[[look for a way out]]\n[[lie here a while]]\n\n(display: \"GenericActions\")",
      "links": [
        {
          "name": "investigate the corpses",
          "link": "investigate the corpses",
          "pid": "284"
        },
        {
          "name": "look for a way out",
          "link": "look for a way out",
          "pid": "285"
        },
        {
          "name": "lie here a while",
          "link": "lie here a while",
          "pid": "286"
        }
      ],
      "name": "the body cellar",
      "pid": "255",
      "position": {
        "x": "2871",
        "y": "3673"
      }
    },
    {
      "text": "(if: $i < $invNumber)[\\\n(set: $name to (string:$inv's ($i)))\\\n(set: $link to '(click: \"' + $name + '\")[\n\n(set: $inv to it - (a: \"' + $name + '\"))\n(set: $wagereditems to it + (a: \"' + $name + '\"))\n(goto: \"pubgame\")\n]')\\\n\n(print: $link)\\\n\\\n(set: $i to it + 1)\\\n(replace: ?wagerloop)[(display: \"wagerlooper\")]\\\n]\n",
      "name": "wagerlooper",
      "pid": "256",
      "position": {
        "x": "372",
        "y": "7090"
      }
    },
    {
      "text": "The men clear the items on the table into one large sack sitting underneath it and then rummage in the sack, muttering to each other.(display: \"pubgroupwager\")\n(if: $inv's length>0)[\nI wager:\n(set: $inv to it - (a: \"\"))\n(print: $inv.join(\"\n\"))\\\n(set: $invNumber to $inv's length)\\\n(set: $i to 0)\\\n[(display: \"wagerlooper\")]<wagerloop|]\n(else:)[\nThe men smirk as you fumble uselessly in your pockets, and realise you have nothing left\n(link-goto: \"leave the men alone\", \"MiddensPub\")]",
      "name": "wager",
      "pid": "257",
      "position": {
        "x": "231",
        "y": "7093"
      }
    },
    {
      "text": "{\n(set: $pubinv to (shuffled: ... $pubinv))\\\n(set: $wagereditems to (a:))\\\n(set: $wagereditems to it + (a: $pubinv's 1st))\\\n(set: $pubinv to it - (a: $pubinv's 1st))\\\n(set: $wagereditems to it + (a: $pubinv's 1st))\\\n(set: $pubinv to it - (a: $pubinv's 1st))\\\n(set: $wagereditems to it + (a: $pubinv's 1st))\\\n(set: $pubinv to it - (a: $pubinv's 1st))}\n",
      "name": "pubgroupwager",
      "pid": "258",
      "position": {
        "x": "385",
        "y": "6961"
      }
    },
    {
      "text": "In turn, everyone places something on the table. There is a (print: $wagereditems's 1st), a (print: $wagereditems's 2nd), a (print: $wagereditems's 3rd), and a (print: $wagereditems's 4th).\n\n\"Right then,\" one of them speaks up. \"Off you go.\"\n\nThe men wait patiently for you to slam your head into the pile of knuckle-bones on the table. \n\nHow hard will you slam your head?\n\n(link: \"hard\")[(set: $headslamvalue to 3)(goto: \"pubgamedieroll\")]\n(link: \"medium\")[(set: $headslamvalue to 2)(goto: \"pubgamedieroll\")]\n(link: \"soft\")[(set: $headslamvalue to 1)(goto: \"pubgamedieroll\")]\n\n(display: \"GenericActions\")",
      "name": "pubgame",
      "pid": "259",
      "position": {
        "x": "250",
        "y": "7259"
      }
    },
    {
      "text": "(if: $timesplayedpubgame>1)[\n(set: $health to it-$headslamvalue)]\n(if: $health>0)[\n(set: $dieroll to $headslamvalue + (random: 1,7))\n(set: $npcdieroll1 to (random: 2, 8))\n(set: $npcdieroll2 to (random: 2, 8))\n(set: $npcdieroll3 to (random: 2, 8))\n(goto: \"pubgameoutcome\")]\n(else:)[\nYou bring your head down sharply, feeling the impact of the bones, and then back up. You black out.\n\n(link-goto: \"sweet relief from suffering\", \"the body cellar transition\")]",
      "name": "pubgamedieroll",
      "pid": "260",
      "position": {
        "x": "248",
        "y": "7395"
      }
    },
    {
      "text": "You bring your head down sharply, feeling the impact of the bones, and then back up. (if: $timesplayedpubgame is 0)[You immediately feel woozy, and lights flash in front of your eyes.](else:)[(print: $healthlosstexts's (random: 1,4))]\nOne of the men shouts out,\n\"That's a $dieroll!\"\n(set: $timesplayedpubgame to it+1)\nThe man to your left slams his head down, and scores a $npcdieroll1. The man opposite scores a $npcdieroll2. The man to your right scores a $npcdieroll3.\n(if: $dieroll>$npcdieroll1 and $dieroll>$npcdieroll2 and $dieroll>$npcdieroll3 )[You gather the items up, whilst the men at the table mutter angrily under their breath.\n(set: $inv to it+$wagereditems)]\n(else:)[The men smirk, and place all the items back in the sack under the table. (set: $pubinv to it+(a: ...$wagereditems))]\n(set: $wagereditems to (a:))\n\n(link: \"play again\")[\n(if: $pubinv's length>3)[(goto: \"wager\")]\n(else:)[(goto: \"playedenough\")]]\n(link-goto: \"leave the table\", \"MiddensPub\")\n\n",
      "name": "pubgameoutcome",
      "pid": "261",
      "position": {
        "x": "245",
        "y": "7528"
      }
    },
    {
      "text": "(set: $timeinlibrary to it + 1)\n\n(link: \"discreetly browse\")[(set: $searchintensity to 1)(goto:\"librarysearchcalc\")]\n(link: \"furiously search\")[(set: $searchintensity to 2)(goto:\"librarysearchcalc\")]",
      "name": "libraryoptions",
      "pid": "262",
      "position": {
        "x": "3960",
        "y": "1015"
      }
    },
    {
      "text": "(set: $dc to $timeinlibrary + ($searchintensity*2) + (random: 1,6))\n\n(if: $dc > (random: 6,12))[PASS (set: $foundabook to true)]\n(else:)[FAIL (set: $foundabook to false)]\n\n(goto:\"librarysearchoutcome\")",
      "name": "librarysearchcalc",
      "pid": "263",
      "position": {
        "x": "4086",
        "y": "1016"
      }
    },
    {
      "text": "(if: $foundabook)[PASS (display: \"getlibraryknowledge\")\n\n(if: $get is true)[You find a (either: \"ragged old\", \"well-preserved\", \"hide-bound\", \"mouldy\", \"blood-stained\") (either: \"book\", \"ledger\", \"scroll\", \"tome\") about $subject. $content]\n(else:)[You've read them all!]\n\n]\n(else:)[FAIL (either: \"you find a book in a dead language\", \"you are distracted by a bat\", \"all the books are waterlogged\")]\n\n(if: $timeinlibrary + $searchintensity*3 > (random:8,11))[A BAD THING HAPPENS\nchange this -> (link: \"shrug it off\")[(goto: \"UpperLibrary1\")]\n\noptions - a health penalty, falling to lower library, interaction with declaimers (check your general status with them), fall down a hidden shaft to somewhere down low, hear ominious sounds: options for lay low for a day (time penalty) or an interesting encounter with a special monster (something living up here, a silverfish, you track it to its lair where there are several good books)\n]\n(else:)[\n(link: \"search longer\")[(goto: \"libraryoptions\")]\n(link: \"stop searching\")[(goto: \"UpperLibrary1\")]\n]",
      "name": "librarysearchoutcome",
      "pid": "264",
      "position": {
        "x": "4211",
        "y": "1080"
      }
    },
    {
      "text": "{\n(if: $librarystuff's length is not 0)[\n(set: $get to true)\n(set: $prize to $librarystuff's 1st)\n(set: $librarystuff to it - (a: $librarystuff's 1st))\n\n\n(set: $knowledgeCategory to \"knowledgeCategory\" of $prize)\n(set: $knowledgeName to \"knowledgeName\" of $prize)\n(set: $appendedKnowledge to \"appendedKnowledge\" of $prize)\n(set: $newKnowledge to \"newKnowledge\" of $prize)\n(display: \"KnowledgeAppender\")\n\n(set: $subject to $knowledgeName)\n(set: $content to $newKnowledge)\n]\n(else:)[\n(set: $get to false)\n]\n}",
      "name": "getlibraryknowledge",
      "pid": "265",
      "position": {
        "x": "4211",
        "y": "953"
      }
    },
    {
      "text": "(set: $timeinlibrary to 0)\n\n\n\n(set: $librarystuff to (a:\n(datamap: \"knowledgeCategory\", \"history\",\n\"knowledgeName\", \"the declaimers\",\n\"appendedKnowledge\", \"They are remenants of the old dictatorship, living on in a mirror of their old ways.\",\n\"newKnowledge\", \"They are remenants of the old dictatorship, living on in a mirror of their old ways.\",\n),\n(datamap: \"knowledgeCategory\", \"history\",\n\"knowledgeName\", \"whispering keepers\",\n\"appendedKnowledge\", \"They don't scream.\",\n\"newKnowledge\", \"They are an order of monks who don't scream.\",\n)\n))\n\n(set: $librarystuff to (shuffled: ...$librarystuff))\n\n(goto: \"InitialiseRandomItems\")",
      "name": "InitialiseLibrary",
      "pid": "266",
      "position": {
        "x": "330",
        "y": "773"
      }
    },
    {
      "text": "A roughly-made wooden ring. It is not varnished, and seems like it might give you a splinter if you wore it. There is a series of scratch-marks on the inner surface that look like a poor attempt at adornment. \n\n(link: \"put iton\")[\\\n(set: $inv to it + (a:\"hands\" of $clothing))\\\n(set: $inv to it - (a:\"wooden ring\"))\n(set: \"hands\" of $clothing to \"wooden ring\")\\\n(set: $handsDescription to \"You wear a roughly made wooden ring on one finger.\")\\\n(goto: (history:)'s 2ndlast)]\n(link: \"done\")[(goto: (history:)'s 2ndlast)]",
      "name": "wooden ring",
      "pid": "267",
      "position": {
        "x": "207",
        "y": "1142"
      }
    },
    {
      "text": "A hood make of sackcloth and dyed black. \n\n(link: \"put it on\")[\\\n(set: $inv to it + (a:\"head\" of $clothing))\\\n(set: $inv to it - (a:\"black cowl\"))\n(set: \"head\" of $clothing to \"black cowl\")\\\n(set: $headDescription to \"Your head is obscured by a black hood\")\\\n(goto: (history:)'s 2ndlast)]\n(link: \"done\")[(goto: (history:)'s 2ndlast)]",
      "name": "black cowl",
      "pid": "268",
      "position": {
        "x": "208",
        "y": "1823"
      }
    },
    {
      "text": "This is a worn leather jerkin. The arm holes are ragged around their edges, and it is stitched together in an unusual way. There is a stitch running jaggedly across the back, as though the pieces of leather from which it is made were slashed and gouged. There is a mark where a nipple would have been on one shoulder, and what looks like a belly-button on one side. It makes you feel uneasy. What kind of animal was this made from?\n\n(link: \"put it on\")[\\\n(set: $inv to it + (a:\"torso\" of $clothing))\\\n(set: $inv to it - (a:\"suspicious jerkin\"))\n(set: \"torso\" of $clothing to \"suspicious jerkin\")\\\n(set: $torsoDescription to \"You are wearing a ragged jerkin that feels like a second skin.\")\\\n(goto: (history:)'s 2ndlast)]\n(link: \"done\")[(goto: (history:)'s 2ndlast)]",
      "name": "suspicious jerkin",
      "pid": "269",
      "position": {
        "x": "207",
        "y": "1017"
      }
    },
    {
      "text": "A bowl carved from bone, attached to a flat, circular wooden base with a single nail. A functional utensil, just about.\n\n\n(link: \"done\")[(goto: (history:)'s 2ndlast)]",
      "name": "drinking cup",
      "pid": "270",
      "position": {
        "x": "199",
        "y": "1276"
      }
    },
    {
      "text": "A string of yellowing teeth, strung onto a piece of fine thread and knotted together. You recognise some of the teeth as belonging to animals you know. Pig, goat, human. One or two curved fangs, though, don't look familiar. \n\n(link: \"put it on\")[\\\n(set: $inv to it + (a:\"neck\" of $clothing))\\\n(set: $inv to it - (a:\"necklace of teeth\"))\n(set: \"neck\" of $clothing to \"necklace of teeth\")\\\n(set: $neckDescription to \"A necklace of yellowing teeth grins from around your neck\")\\\n(goto: (history:)'s 2ndlast)]\n(link: \"done\")[(goto: (history:)'s 2ndlast)]",
      "name": "necklace of teeth",
      "pid": "271",
      "position": {
        "x": "200",
        "y": "1573"
      }
    },
    {
      "text": "A severed hand, now gnarled and twisted. The flesh has shrunk away from the nails, making the hand seem like a claw. It doesn;t have any obvious use.\n\n(link: \"done\")[(goto: (history:)'s 2ndlast)]",
      "name": "withered hand",
      "pid": "272",
      "position": {
        "x": "203",
        "y": "1698"
      }
    },
    {
      "text": "(set: $randomitems to (a:\"wooden ring\", \"drinking cup\", \"withered hand\", \"black cowl\", \"suspicious jerkin\", \"necklace of teeth\",  \"library book\", \"bag of nails\", \"pipe\", \"blood-stained handkerchief\", \"bunch of keys\", \"fortune-teller's scrap\", \"box of matches\", \"pouch of herbs\")) \n(set: $matches to 10)\n(set: $randomitems to (shuffled: ... $randomitems))\n(set: $pubinv to $randomitems's (range: 1, 12))\n(set: $randomitems to it-$randomitems's (range: 1, 12))\n\n(goto: \"Intro0\")",
      "name": "InitialiseRandomItems",
      "pid": "273",
      "position": {
        "x": "333",
        "y": "898"
      }
    },
    {
      "text": "(if: (datanames: \"history\" of $knowledge) contains \"knucklehead\")[\n\"Well, seems like you know the score here,\" one of them says. \"Let's get down to it. What are you wagerin'?\"]\n(else:)[\nOne of the men begins talking before you've even taken your seat.\n\n\"Nice to meet youse, and all that. No need to tell us your name, they don't mean no much to nobody in this place. This here's a game we call knucklehead. Bet what you've got, and sees what you win. If you can stick more of these knucklebones to your head than one of us, you can have our bits and bobs. If you can't, we'll have yours. If you cheat, we'll cut you up. Sound fair? You plays the game, or you leaves the table.\"\n(set: $knowledgeCategory to \"history\")\n(set: $knowledgeName to \"knucklehead\")\n(set: $appendedKnowledge to \"A gambling game played by the inhabitants of the Middens, where you must compete to stick knuckle-bones to your forehead. Best played by those with dull minds and cruel hearts.\")\n(set: $newKnowledge to \"\")\n(display: \"KnowledgeAppender\")\n]\n\n[[wager]]\n(link-goto: \"leave the table\", \"MiddensPub\")\n\n(display: \"GenericActions\")\n\n",
      "links": [
        {
          "name": "wager",
          "link": "wager",
          "pid": "257"
        }
      ],
      "name": "sit with the men",
      "pid": "274",
      "position": {
        "x": "63",
        "y": "7102"
      }
    },
    {
      "text": "\"Oh no,\" says the man who seems to be the leader of the group. \"You've cleaned us out. We ain't playing with the likes of you anymore. We're too smart to play knucklehead with just anyone, you know.\"\n\n(link-goto: \"leave the table\", \"MiddensPub\")",
      "name": "playedenough",
      "pid": "275",
      "position": {
        "x": "390",
        "y": "7254"
      }
    },
    {
      "text": "A small hessian bag, fastened at the mouth with a leather thong. Inside are several rusty nails of different lengths.\n\n(link: \"Done\")[(goto: (history:)'s 2ndlast)]",
      "name": "bag of nails",
      "pid": "276",
      "position": {
        "x": "211",
        "y": "1948"
      }
    },
    {
      "text": "A pipe carved from briar-wood. Its bowl is choked with tar, and the mouthpiece is grooved with teethmarks.\n\n(if: $inv contains \"pouch of herbs\" and $inv contains \"box of matches\")[(link: \"smoke the pipe\")[it tastes like burnt hair(set: $matches to it-1)]]\n\n(link: \"Done\")[(goto: (history:)'s 2ndlast)]",
      "name": "pipe",
      "pid": "277",
      "position": {
        "x": "219",
        "y": "2086"
      }
    },
    {
      "text": "A metal loop with five rusted keys. I wonder what they are for?",
      "name": "bunch of keys",
      "pid": "278",
      "position": {
        "x": "222",
        "y": "2211"
      }
    },
    {
      "text": "A yellowed handkerchief, with a large red stain spread across the middle.\n\n(link: \"Done\")[(goto: (history:)'s 2ndlast)]",
      "name": "blood-stained handkerchief",
      "pid": "279",
      "position": {
        "x": "228",
        "y": "2336"
      }
    },
    {
      "text": "A small scrap of parchment, rolled up and bound by a thread. You unroll it, and the words written inside seem to shimmer and shift. The message says:\n\n(either: \"'Things could be worse'\"\", \"'The secret of getting ahead is getting started'\", \"'Your ingenuity brings results'\", \"'Tomorrow brings happiness'\", \"'It's ok to talk to strangers'\", \"'Luck is the residue of design'\")\n\n\n(link: \"Done\")[(goto: (history:)'s 2ndlast)]",
      "name": "fortune-teller's scrap",
      "pid": "280",
      "position": {
        "x": "59",
        "y": "2364"
      }
    },
    {
      "text": "A small cloth sack with some dried herbs in. The shards of plant matter are a light green, and slightly damp to the touch. \n\n(link: \"Done\")[(goto: (history:)'s 2ndlast)]",
      "name": "pouch of herbs",
      "pid": "281",
      "position": {
        "x": "229",
        "y": "2461"
      }
    },
    {
      "text": "A small wooden box. Inside are $matches small twigs, coated on one end with a sticky green powder. \n\n(link: \"strike a match\")[light flares from the green tip for a brief second, and then dies. mostly useless (set: $matches to it-1)]\n\n(link: \"Done\")[(goto: (history:)'s 2ndlast)]",
      "name": "box of matches",
      "pid": "282",
      "position": {
        "x": "58",
        "y": "2498"
      }
    },
    {
      "text": "<!-- If you came here because you passed out -->\n(set: $filth to it+5)(if: $health is <=1)[(set: $health to it +3)](set: $timeindungeon to it+1)\nGradually, you come to. You must have been under the darkness for some time. Your head feels like an army of demonoids are scratching at your skull-flesh, and the stench of rotting meat fills your nostrils. What must be your own heartbeat pounds loud in your ears.\n\n[[open your eyes->the body cellar]]",
      "links": [
        {
          "name": "open your eyes",
          "link": "the body cellar",
          "pid": "255"
        }
      ],
      "name": "the body cellar transition",
      "pid": "283",
      "position": {
        "x": "2911",
        "y": "3528"
      }
    },
    {
      "text": "Discover the secret of the betrothed woman, who is down here. If you have the brooch, do something. Able to go back and confront the MiddensPubWoman",
      "name": "investigate the corpses",
      "pid": "284",
      "position": {
        "x": "2653",
        "y": "3673"
      }
    },
    {
      "text": "The only obvious way out is the light of the hatch far above you. You stumble around in the filth and darkness, nearly slipping on wet blood more than once. The cavern is larger than it first seems, and the size is making the thudding noise echo and seem louder than it should. Feeling gradually around the walls, you discover a sconce hidden in shadow, and the bulbous form of an oil lamp bracketed to the wall. It feels like there's a small amount of wick left, but it's long cold.\n\n(if: $inv contains \"matches\" and $matches>0)[[[try and light the lamp->light lamp]]]\n[[try and climb towards the opening above->climb to hatch]]\n[[keep looking->servants approach]]\n[[give up->lie here a while]] \n\n(display: \"GenericActions\")\n\n\n",
      "links": [
        {
          "name": "[try and light the lamp",
          "link": "light lamp",
          "pid": "287"
        },
        {
          "name": "try and climb towards the opening above",
          "link": "climb to hatch",
          "pid": "288"
        },
        {
          "name": "keep looking",
          "link": "servants approach",
          "pid": "290"
        },
        {
          "name": "give up",
          "link": "lie here a while",
          "pid": "286"
        }
      ],
      "name": "look for a way out",
      "pid": "285",
      "position": {
        "x": "3021",
        "y": "3823"
      }
    },
    {
      "text": "You close your eyes, and the let the regular thudding fill your ears. You can feel the weight of this place beginning to drag you down. Wouldn't it be better just to give in to the horror you've seen, and stay here forever? You could wallow in the filth like swine in a slaughterhouse. The blood coating the floor begins to seep through your clothes and coat your skin. You are becoming one of them. Another one of the suffering masses who make their home in the Skull. You are becoming one of them. \n\n[[open your eyes->body cellar encounter]]\n[[the end of the pain->servants approach]] \n\n",
      "links": [
        {
          "name": "open your eyes",
          "link": "body cellar encounter",
          "pid": "291"
        },
        {
          "name": "the end of the pain",
          "link": "servants approach",
          "pid": "290"
        }
      ],
      "name": "lie here a while",
      "pid": "286",
      "position": {
        "x": "2861",
        "y": "3824"
      }
    },
    {
      "text": "(set: $matches to it-1)\nYou fumble for the box of twigs, and graze one against the rough stone wall of the cavern. Quickly applying the brief flame to the wick, the lamp sputters. Long shadows dance as the lamp casts its light over the cavern, and the full horror is revealed. Bodies and their remnants are piled deep into the recessess of the cave. Under the small patch of light from above, the bodies are fresh. Hands and legs, torn and mangled, jut like spars on broken ships from hessian sacks rent as they were launched down from above. On one wall, sacks are hung from hooks and blood drips from them and pools on the ground below. In one far corner, a collection of emaciated corpses all together are a ghoulish reminder of the bureaucracy of the world of the living, their skin-on-bones resembling papyrus scrolls stretched taut across a writing easel. In another corner, a mountain of assorted bones. \n\nPushing yourself to search for a way out of this abject hell, you notice a spot that remains dark even as the light of the lamp dances over it. A tunnel?\n\n[[investigate the tunnel->body cellar tunnel]]\n[[investigate the body bags->servants approach]]\n[[investigate the bones->servants approach]]\n[[try and climb towards the opening above->climb to hatch]]\n[[give up->lie here a while]] \n\n(display: \"GenericActions\")",
      "links": [
        {
          "name": "investigate the tunnel",
          "link": "body cellar tunnel",
          "pid": "289"
        },
        {
          "name": "investigate the body bags",
          "link": "servants approach",
          "pid": "290"
        },
        {
          "name": "investigate the bones",
          "link": "servants approach",
          "pid": "290"
        },
        {
          "name": "try and climb towards the opening above",
          "link": "climb to hatch",
          "pid": "288"
        },
        {
          "name": "give up",
          "link": "lie here a while",
          "pid": "286"
        }
      ],
      "name": "light lamp",
      "pid": "287",
      "position": {
        "x": "3021",
        "y": "3973"
      }
    },
    {
      "text": "You position yourself directly under the hatch, and immediately realise it's going to require all the heart you have left. The square of light illuminates the chute that leads down from the hatch. The chute ends more than a body's length above the ground, and is slick with blood. The blood is fresh, and some drips from the edge of the chute onto your face as you stand there. You could try and make a leap to grab the ledge and scramble up the chute, or perhaps you could stack some corpses and body bags and reach the chute that way. \n\n(if: $inv contains \"rope\")[[[use your rope->use your rope]]]\n[[a running leap->leapcodepage]]\n[[stack up corpses->servants approach]]\n[[give up->lie here a while]] \n\n(display: \"GenericActions\")",
      "links": [
        {
          "name": "[use your rope",
          "link": "use your rope",
          "pid": "295"
        },
        {
          "name": "a running leap",
          "link": "leapcodepage",
          "pid": "297"
        },
        {
          "name": "stack up corpses",
          "link": "servants approach",
          "pid": "290"
        },
        {
          "name": "give up",
          "link": "lie here a while",
          "pid": "286"
        }
      ],
      "name": "climb to hatch",
      "pid": "288",
      "position": {
        "x": "3171",
        "y": "3973"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": "body cellar tunnel",
      "pid": "289",
      "position": {
        "x": "3028",
        "y": "4267"
      }
    },
    {
      "text": "whatever you're doing is interupted because the servants of the heart come to get you.",
      "name": "servants approach",
      "pid": "290",
      "position": {
        "x": "2857",
        "y": "4177"
      }
    },
    {
      "text": "Looking upwards, you notice a shadow pass across the small square of light above you. A rough grunting noise filters down the chute. Could there be someone up there? \n\n[[call out]]\n[[keep quiet]]",
      "links": [
        {
          "name": "call out",
          "link": "call out",
          "pid": "292"
        },
        {
          "name": "keep quiet",
          "link": "keep quiet",
          "pid": "293"
        }
      ],
      "name": "body cellar encounter",
      "pid": "291",
      "position": {
        "x": "2694",
        "y": "3851"
      }
    },
    {
      "text": "Double-click this passage to edit it.",
      "name": "call out",
      "pid": "292",
      "position": {
        "x": "2533",
        "y": "3863"
      }
    },
    {
      "text": "You instinctively hold your breath and try and shrink into the floor, although part of you knows you're already so caked in blood and filth there's no chance anybody at that distance would notice you among all the other abandoned carcasses. \n\nThe grunting stops, and you hear a strange noise as though something is approaching at an incredible speed.(if: $sawbodydrop is true)[you realise another hessian sack is sliding down the chute. You roll to one side just in time, as a bag of flesh and bones lands with a sickening crack just where you were. Gore is forced through the weave of the sack as it lands, and a red mist explodes outwards then sinks to the ground.](else:)[Still weak, you realise what it is too late, and the sack of body parts slams into your torso in a cloud of pink mist. The pain is overwhelming (set: $health to it-1)]\n\n(if: $health<1)[(link-goto: \"the impact is too much for your frail body\", \"body cellar death\")]\n(else:)\n[[stunned, you begin to get up->servants approach]] ",
      "links": [
        {
          "name": "stunned, you begin to get up",
          "link": "servants approach",
          "pid": "290"
        }
      ],
      "name": "keep quiet",
      "pid": "293",
      "position": {
        "x": "2686",
        "y": "3987"
      }
    },
    {
      "text": "dead among the corpses\n\nENDGAME",
      "name": "body cellar death",
      "pid": "294",
      "position": {
        "x": "2681",
        "y": "4171"
      }
    },
    {
      "text": "You knot a loose loop into one end of the rope, and make a couple of practice throws snagging shin-bones and jagged boulders on the floor of the cavern. When you're confident, you toss the rope up the chute, aiming for a spar of rock sticking out halfway up. On the second try, it catches. \n\nYou haul yourself painfully up the slippery chute, step by aching step. Once, your foot skids on the blood and you nearly lose yourself, desperate not to return to the horror below. As you gain ground above the jagged rock, you realise you will have to abandon the rope in order to keep your grip on the walls of the passage.\n\nYour fingertips grip to the edge of the chute and you pull yourself into the light. \n(set: $inv to it-(a: \"rope\"))\n(link-goto: \"you tumble, breathlessly, over the edge of the body chute\", \"hallway 2d\")",
      "name": "use your rope",
      "pid": "295",
      "position": {
        "x": "3325",
        "y": "3976"
      }
    },
    {
      "text": "You begin with the grim task of clearing a path for a run-up, carelessly tossing body-parts to one side. You feel yourself becoming inured to the continual agonies required to survive in the Skull. Once a path is cleared, you practice the run twice, taking five steps and leaping. Your fingertips barely graze the ledge. You pace backwards, and prepare to exert yourself to your full extent.\n\n(if: $leapscore>5)[As you leap, your fingers grasp the edge of the chute firmly. You hang there for a second, before hauling yourself upwards. The chute is slick with blood, but you scramble up bit by bit, willing yourself away from the the horror below\n\n(link-goto: \"you tumble, breathlessly, over the edge of the body chute\", \"hallway 2d\")]\n(if: $leapscore<=5)[This leap is no better than before. You feel your fingers grasping in futility at the edge of the chute, before you fall forwards onto a pile of rotten corpses. \n\n[[try again->servants approach]] \n[[give up->lie here a while]] ]",
      "links": [
        {
          "name": "try again",
          "link": "servants approach",
          "pid": "290"
        },
        {
          "name": "give up",
          "link": "lie here a while",
          "pid": "286"
        }
      ],
      "name": "a running leap",
      "pid": "296",
      "position": {
        "x": "3398",
        "y": "4112"
      }
    },
    {
      "text": "(set: $leapscore to $health+(random:1,4))\n(if: $playerTags contains \"drunk\")[(set: $leapscore to it-1)]\n(goto: \"a running leap\")",
      "name": "leapcodepage",
      "pid": "297",
      "position": {
        "x": "3266",
        "y": "4122"
      }
    }
  ],
  "name": "FragmentsOfSkullMaster",
  "startnode": "1",
  "creator": "Twine",
  "creator-version": "2.2.1",
  "ifid": "437DEA39-C4E6-49D8-85B4-E6A4EB2F9F54"
}